///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ЧП "Плюс Софт"
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем Wsh,Блокировка,УровеньРаспаковки; 

&НаКлиенте
Перем JS_ДокументБраузера;

&НаКлиенте
Перем СтруктураКлюча;

&НаКлиенте
Перем СтрокаНаПодпись;

&НаКлиенте
Перем Идентификатор;

&НаКлиенте
Перем ПодписанныйТекст;

&НаКлиенте
Перем ПослеАвторизации; 

&НаКлиенте
Перем ВыполнитьЗакрытиеФормы;

#КонецОбласти

 #Область СлужебныеФункцииПриВводеДанных

 &НаСервереБезКонтекста
 Функция ПолучитьНоменклатуруНаСервере(pGTIN)
	 Если pGTIN="" тогда
		 Возврат Справочники.Номенклатура.ПустаяСсылка();
	 Иначе
		 Возврат Справочники.Номенклатура.НайтиПоРеквизиту("GTIN",pGTIN);
	 КонецЕсли;
 КонецФункции 

&НаКлиенте
Функция ПолучитьНомерСерииюИзДокумента(GTIN)
	
	НомерСерии="";
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		Если СтрокаДок.ВыборСтроки и СтрокаДок.GTIN=GTIN  тогда
			НомерСерии=СтрокаДок.НомерСерии;
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерСерии;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьЗаписьИзРеестра(КодМаркировки)
	
		ВозвратСтруктура=Новый Структура; 
	
		Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		Запись.КодМаркировки=Кодмаркировки; 
		Запись.Прочитать();
		
		Если Запись.Выбран() тогда
			ВозвратСтруктура.Вставить("Выбран",Истина);
			ВозвратСтруктура.Вставить("КодМаркировки",Запись.КодМаркировки);
			ВозвратСтруктура.Вставить("КодSSCC1",Запись.КодSSCC1);
			ВозвратСтруктура.Вставить("Номенклатура",Запись.Номенклатура);
			ВозвратСтруктура.Вставить("НомерСерии",Запись.НомерСерии);
			ВозвратСтруктура.Вставить("ЕмкостьУпаковки",Запись.ЕмкостьУпаковки);
			ВозвратСтруктура.Вставить("Статус",Запись.Статус);
			ВозвратСтруктура.Вставить("ДокументПрихода",Запись.ДокументПрихода);
			ВозвратСтруктура.Вставить("ДокументРасхода",Запись.ДокументРасхода);
		Иначе
			ВозвратСтруктура.Вставить("Выбран",Ложь);
	    КонецЕсли;
		
		Возврат ВозвратСтруктура; 

КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСтрокиДокумента()
	
	СтруктураВозврат=Новый Структура;
	Если Объект.ДокументОснование<>Неопределено тогда
		Для Каждого СтрокаДок из Объект.Контроль Цикл
	 		Если СтрокаДок.ВыборСтроки   тогда
				СтруктураВозврат.Вставить("GTIN",СтрокаДок.GTIN);
				СтруктураВозврат.Вставить("Номенклатура",СтрокаДок.Номенклатура);
				СтруктураВозврат.Вставить("НомерСерии",СтрокаДок.НомерСерии);
				прервать;
			КонецЕсли;
		КонецЦикла;     
	КонецЕсли;
	
	Если СтруктураВозврат.Количество()=0 тогда
		СтруктураВозврат.Вставить("GTIN","");
		СтруктураВозврат.Вставить("Номенклатура",ПолучитьНоменклатуруНаСервере("")); // пустая ссылка
		СтруктураВозврат.Вставить("НомерСерии","");
		Если Объект.ДокументОснование<>Неопределено тогда
			Сообщить("Не выбрана строка документа");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврат;
	
КонецФункции 
	

&НаКлиенте
Функция ПолучитьСериюНоменклатурыИзДокумента(GTIN)   // полное наименование
	
	НомерСерии="";
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		Если СтрокаДок.ВыборСтроки и СтрокаДок.GTIN=GTIN  тогда
			НомерСерии=СокрЛП(СтрокаДок.НомерСерии);  
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерСерии;
	
КонецФункции

#КонецОбласти	
	

#Область ИмпортИзCSV

&НаКлиенте 
Функция ПроверкаВыбораСтрок() 
	
	// проверка выбора строк  - оставляем выбор только для одинаковых строк GTIN+НомерСерии

	КоличВыбранныхСтрок=0;
	Для каждого КонтрольСтр Из Объект.Контроль Цикл  
		Если КонтрольСтр.ВыборСтроки  и КоличВыбранныхСтрок=0 тогда
			GTIN0=КонтрольСтр.GTIN;
			НомерСерии0=КонтрольСтр.НомерСерии;
			КоличВыбранныхСтрок=КоличВыбранныхСтрок+1;
		иначе	
			Если КонтрольСтр.GTIN<>GTIN0 или КонтрольСтр.НомерСерии<>НомерСерии0 тогда
				КонтрольСтр.ВыборСтроки=Ложь;
			иначе
				КоличВыбранныхСтрок=КоличВыбранныхСтрок+1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличВыбранныхСтрок; 
	
КонецФункции

&НаКлиенте 
Процедура ЗагрузкаИзCSVНачало(Команда) 
	
	КоличВыбранныхСтрок=ПроверкаВыбораСтрок(); 
		
	Если КоличВыбранныхСтрок=0  тогда
		Если  Объект.ДокументОснование=Неопределено Тогда
			  КоличВыбранныхСтрок=1;
		иначе
			Сообщить("Выберите строки документа для загрузки");
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	Если КоличВыбранныхСтрок>0 Тогда
	//ВыполнитьОбработкуОповещения(Оповещение);
		ОчиститьСписокКМНачало(Новый ОписаниеОповещения("ЗагрузкаИзCSVПродолжение",ЭтотОбъект));	// очистка с вопросом
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ЗагрузкаИзCSVПродолжение(Результат,ДопПараметры) Экспорт

	НачСпискаКМ=Объект.КодыСписок.Количество()+1;            // начало загруженных кодов
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите CSV файл'")+ "(*.CSV)|*.CSV";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите CSV файл";
	
	ФлОшиб=0;

	
		Если ДиалогОткрытияФайла.Выбрать() Тогда 
			ЗагрузитьИзФайла(ДиалогОткрытияФайла.ПолноеИмяФайла,1,ФлОшиб);   
			Если ФлОшиб=1 тогда 
				возврат;
			КонецЕсли;	
		КонецЕсли;	
		
	Если  Объект.ДокументОснование<>Неопределено тогда   // контроль и подсчет количества по документу
		
		Для каждого ТабСтрока Из Объект.КодыСписок Цикл 
			Если ТабСтрока.НомерСтроки<НачСпискаКМ тогда Продолжить;  
			КонецЕсли;
			ТабСтрока.Проверка=Истина; 
			СтрокаДокумента=Неопределено;
			Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
				ТабСтрока.Проверка=Ложь; 
			иначе
				ТабСтрока.Проверка=Истина; 
				ТабСтрока.Номенклатура=СтрокаДокумента.Номенклатура;
				ТабСтрока.НомерСерии=СтрокаДокумента.НомерСерии; 
			КонецЕсли;
		 КонецЦикла;
		
	КонецЕсли;	
 КонецПроцедуры  


&НаКлиенте
Процедура ЗагрузитьИзФайла(ПутьКФайлу,НомерСтрокиДокумента,ФлОшиб) 
		
	Документ= Новый ТекстовыйДокумент;
	Документ.Прочитать(ПутьКФайлу); 

	
	КодSSCC1Нач="0";
	НомерСтроки=1; 
	мВведеноУпаковок=0;
	мВведено=0;
	КоличКмВУпаковке=0;
	
	КолСтрок=Документ.КоличествоСтрок();

	КоличКмВУпаковке=Емкость;
 	ВложенныеУпаковки=Новый Структура;
	
	СтрокаКонтроль=ПолучитьДанныеСтрокиДокумента();

	ФлОшиб=0;

	Для Инд=НомерСтроки По КолСтрок Цикл
		СтрокаДокумента=Документ.ПолучитьСтроку(Инд);
		
		Если Прав(СтрокаДокумента,1)=";"  тогда
			ФлУпак=1;
		ИначеЕсли Лев(СтрокаДокумента,1)=";" Тогда
			ФлУпак=0;
		ИначеЕсли УпаковкаУровень>1 тогда	
			ФлУпак=1;
		//ИначеЕсли Лев(СтрокаДокумента,2)="01" и Сред(СтрокаДокумента,17,2)="21" Тогда
		//     ФлУпак=0;
        Иначе
            ФлУпак=0;
		КонецЕсли;	
			
		Если ФлУпак=1 тогда                                                    
			КодSSCC1=СокрЛП(СтрЗаменить(СтрокаДокумента,";",""));
			Если КодSSCC1=""  тогда продолжить;   // пропуск пустых строк
			КонецЕсли;
			
	 		Если Лев(КодSSCC1,2)="01" и Сред(КодSSCC1,17,2)="21"  тогда 
				Если ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда 
					Сообщить("Несоответствие структуры КМ выбраннму типу упаковки! Импорт прекращен!") ; 
					ТабСтрока=Объект.КодыСписок.Добавить();
					ТабСтрока.Товар=КодSSCC1; 
					ФлОшиб=1;
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если КодSSCC1Нач="0" тогда    // первый вход
				Если Инд>1 тогда
					Сообщить("Файл импорта содержит коды упаковок. Строки 1-"+Строка(Инд-1)+" не имеют кода упаковки! Импорт прекращен!");
					ФлОшиб=1;
					Возврат;
				Иначе
					Если УпаковкаУровень<=1  тогда
						Сообщить("Файл импорта содержит коды упаковок. Выберите транспортную упаковку! ");
						ФлОшиб=1;
					иначе
						ВложенныеУпаковки=ПолучитьПараметрыВложеннойУпаковки(УпаковкаЕдИзм,УпаковкаУровень);
					КонецЕсли;	
					Если ФлОшиб=1 тогда
						Возврат;
					иначе
						Элементы.Контроль.ПодчиненныеЭлементы.КонтрольСертификация.Видимость=Ложь;
						КодSSCC1Нач=КодSSCC1;
						мВведено=мВведено+КоличКмВУпаковке;
						КоличКмВУпаковке=0;
					Конецесли;
					
				Конецесли;
				
			ИначеЕсли КодSSCC1<>КодSSCC1Нач тогда 
				Если КоличКмВУпаковке <> Емкость  тогда
					//Если Объект.ДокументОснование=Неопределено тогда
						Если КоличКмВУпаковке > 0  тогда
							Сообщить("Отклонение! Код упаковки -"+КодSSCC1Нач+" - количество КМ "+Строка(КоличКмВУпаковке)); 
						КонецЕсли;	
					//КонецЕсли;
				КонецЕсли;;
				мВведеноУпаковок=мВведеноУпаковок+1;
				Если КоличКмВУпаковке=0 тогда      // только упаковка
					ТабСтрока=Объект.КодыСписок.Добавить();
					//ТабСтрока.КодSSCC1=КодSSCC1Нач; 
					ТабСтрока.Товар=КодSSCC1Нач; 
					ТабСтрока.Статус=0;
					ТабСтрока.ЕмкостьУпаковки=Емкость;
					ТабСтрока.Количество=УпаковкаКоличество;
					ТабСтрока.УровеньУпаковки=УпаковкаУровень;
					ТабСтрока.ТипУпаковки=ТипУпаковки;
					
					мВведено=мВведено+Емкость;
					Если Объект.ДокументОснование=Неопределено тогда
						ТабСтрока.Проверка=Истина;
						//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
					Иначе
						ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
						ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	
					Конецесли;
				КонецЕсли;
				КодSSCC1Нач=КодSSCC1; 
				мВведено=мВведено+КоличКмВУпаковке;
				КоличКмВУпаковке=0;
			КонецЕсли;	
			
			Продолжить;
		КонецЕсли;
		
		// вложенный код
		КоличКмВУпаковке=КоличКмВУпаковке+1;
		КодМаркировки=СокрЛП(СтрЗаменить(СтрокаДокумента,";",""));   
		
		ТабСтрока=Объект.КодыСписок.Добавить();
		ТабСтрока.Товар=КодМаркировки; 
		ТабСтрока.КодSSCC1=КодSSCC1; 
		ТабСтрока.Статус=0;

		Если ВложенныеУпаковки.Количество()>0 Тогда 
			ТабСтрока.ЕмкостьУпаковки=ВложенныеУпаковки.Емкость;
			ТабСтрока.Количество=ВложенныеУпаковки.Количество;
			ТабСтрока.УровеньУпаковки=ВложенныеУпаковки.УровеньУпаковки;
			ТабСтрока.ТипУпаковки=ВложенныеУпаковки.ТипУпаковки;
		иначе	
			ТабСтрока.ЕмкостьУпаковки=Емкость;
			ТабСтрока.Количество=УпаковкаКоличество;
			ТабСтрока.УровеньУпаковки=УпаковкаУровень;
			ТабСтрока.ТипУпаковки=ТипУпаковки; 
		КонецЕсли;  
		
		Если ТабСтрока.УровеньУпаковки<2 тогда         // потребительская или групповая
			ТабСтрока.Товар=УбратьКодПроверкиИКриптохвост(ТабСтрока.Товар,ТабСтрока.УровеньУпаковки,ТипТовара);
			ТабСтрока.GTIN=ПолучитьGTINПоКодуМаркировки(ТабСтрока.Товар,ТабСтрока.УровеньУпаковки,ТипТовара); 
			Если ТабСтрока.GTIN=Неопределено тогда
				Сообщить("Строка "+СтрЗаменить(Строка(ТабСтрока.НомерСтроки),Символ(160),"")+" КМ "+ТабСтрока.Товар+" не содержит GTIN! ");
			КонецЕсли;	
		иначе  // GTIN по документу
			ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
		КонецЕсли;
		
		ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	

			
		Если Объект.ДокументОснование=Неопределено тогда
			ТабСтрока.Проверка=Истина;
			//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
		Конецесли;
	КонецЦикла;  
	

	// последняя упаковка
	Если КодSSCC1<>Неопределено тогда
		Если КоличКмВУпаковке<>Емкость  тогда
			Если КоличКмВУпаковке > 0  тогда
				//Сообщить("Отклонение! Код коробки -"+КодSSCC1+" - количество КМ "+Строка(КоличКмВУпаковке)); 
				Сообщить("Отклонение! Код коробки -"+КодSSCC1+" - количество КМ "+Формат(КоличКмВУпаковке,"Ч10")); 
			КонецЕсли;	
			Если КоличКмВУпаковке=0 тогда      // только упаковка
				ТабСтрока=Объект.КодыСписок.Добавить();
				//ТабСтрока.КодSSCC1=КодSSCC1Нач; 
				ТабСтрока.Товар=КодSSCC1Нач; 
				ТабСтрока.Статус=0;
				ТабСтрока.ЕмкостьУпаковки=Емкость;
				ТабСтрока.Количество=УпаковкаКоличество;
				ТабСтрока.УровеньУпаковки=УпаковкаУровень;
				ТабСтрока.ТипУпаковки=ТипУпаковки;

				мВведено=мВведено+Емкость;
				Если Объект.ДокументОснование=Неопределено тогда
					ТабСтрока.Проверка=Истина;
					//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);  
				Иначе
					ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
					ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	
				Конецесли;
			КонецЕсли;
		КонецЕсли;
		мВведеноУпаковок=мВведеноУпаковок+1
	КонецЕсли;
	
	Если Объект.ДокументОснование=Неопределено тогда
		//Введено=Объект.КодыСписок.Количество(); 
		Введено=мВведено;
		ВведеноУпаковок=мВведеноУпаковок;
	иначе
		//Емкость=0;       // по документу используется для построчного контроля
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти

&НаСервереБезКонтекста
Функция ОпределитьКомплектациюНаСервере(ДокументОснование)
        ЕстьМаркировка=Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КодыМаркировки.Статус КАК Статус,
			|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
			|	КодыМаркировки.КодМаркировки КАК КодМаркировки
			|ИЗ
			|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
			|ГДЕ
			|	КодыМаркировки.ДокументПрихода = &Ссылка";   
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
        	Запрос.Текст=СтрЗаменить(Запрос.Текст,"ДокументПрихода","ДокументРасхода");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();  
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
			ЕстьМаркировка=Истина;
		КонецЕсли; 
		Возврат ЕстьМаркировка;
КонецФункции

&НаСервере
Процедура ЗаписатьКомплектациюНаСервере(МассивКодов,МассивУпаковок) 

	МассивРазагрегации=Новый Массив();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	КодыМаркировки.ДокументПрихода.Ссылка КАК ДокументПрихода,
	|	КодыМаркировки.ДокументРасхода.Ссылка КАК ДокументРасхода,
	|	КодыМаркировки.Статус КАК Статус,
	|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
	|	КодыМаркировки.Номенклатура КАК Номенклатура,
	|	КодыМаркировки.КодSSCC1 КАК КодSSCC1
	|ИЗ
	|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
	|ГДЕ
	|	(КодыМаркировки.КодМаркировки В (&МассивКодов)
	|			ИЛИ КодыМаркировки.КодSSCC1 В (&МассивУпаковок))
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодМаркировки";
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Запрос.УстановитьПараметр("МассивУпаковок", МассивУпаковок);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	ВыборкаТЗ=РезультатЗапроса.Выгрузить();

	Если ВыборкаТЗ.Количество()>0 тогда     // проверка найденных кодов  
		
		Для Каждого Выборка из ВыборкаТЗ Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Товар", Выборка.КодМаркировки);
			НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
			ТабСтрока=Неопределено;
			Если НайденныеСтроки.Количество()>0  тогда 
				Если НайденныеСтроки[0].Проверка тогда 
					ТабСтрока=НайденныеСтроки[0];      // код есть в списке КМ
				КонецЕсли;
			КонецЕсли;	 
			
			Если ТабСтрока<>Неопределено тогда 
				ФлОшибЗап=ПроверитьЗапись(Выборка,НайденныеСтроки[0]);
				Если ФлОшибЗап=1 тогда
					ФлОшиб=1;
				КонецЕсли;
				
			иначе	//  поиск упаковки - в выборку КМ попал по агрегатному коду	
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Товар", Выборка.КодSSCC1);
				НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора); 
				Если НайденныеСтроки.Количество()>0 тогда   // найден агрегатный код - разогрегация ошибка
					Если МассивРазагрегации.Найти(Выборка.КодSSCC1)=Неопределено тогда
						МассивРазагрегации.Добавить();
						МассивРазагрегации[МассивРазагрегации.ВГраница()]=Выборка.КодSSCC1; 
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
		
	Если МассивРазагрегации.Количество()>0 тогда    // вывод сообщений об ошибках разагрегации
		Для инд=0 по МассивРазагрегации.Количество()-1 Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Товар", МассивРазагрегации[инд]);
			НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора); 
			Если НайденныеСтроки.Количество()>0 тогда   // разогрегация ошибка
				Сообщить("строка "+Строка(НайденныеСтроки[0].НомерСтроки)+" Код упаковки "+НайденныеСтроки[0].Товар+" разагрегирован!") ; 
				ФлОшиб=1;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
	// поиск ненайденных кодов, если была реализация 
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Для Каждого ТабСтрока из Объект.КодыСписок Цикл
			Если ТабСтрока.Проверка=Ложь тогда Продолжить;
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("КодМаркировки", ТабСтрока.Товар);
			НайденныеСтроки = ВыборкаТЗ.НайтиСтроки(ПараметрыОтбора); 
			Если НайденныеСтроки.Количество()=0 тогда   // код в реестре не найден- ошибка
				Сообщить("строка "+ТабСтрока.НомерСтроки+" Код маркировки "+ТабСтрока.Товар+" в реестре КМ не найден!") ; 
				ФлОшиб=1;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	 

	Если ФлОшиб=1 Тогда
		Сообщить("Есть ошибки. Запись списка КМ не произведена! ");
		Возврат;
	КонецЕсли;	 
	
	// определим статус по документу основания
	Если Объект.ДокументОснование=Неопределено тогда
		мСтатус=0;
	Иначе
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")  тогда //приход 
			//мСтатус=1;				
			мСтатус=2;		// пока без учета проведения		
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
			//мСтатус=3;
			мСтатус=4;    // пока без учета проведения
		КонецЕсли;
		//Если Объект.ДокументОснование.Проведен тогда
		//	мСтатус=мСтатус+1;
		//КонецЕсли;
	КонецЕсли; 
	
	// Запись в реестр
	ФлОшиб=0;
	Для Каждого ТабСтрока из Объект.КодыСписок Цикл
		
		Если ТабСтрока.Проверка=Ложь тогда Продолжить;
		КонецЕсли;
		
		Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		Запись.КодМаркировки=ТабСтрока.Товар; 
		Запись.Прочитать(); 
		
		Если Запись.Выбран()=Ложь  Тогда   // новый код
			Запись.КодМаркировки=ТабСтрока.Товар;
		КонецЕсли;
		
		Если Запись.Статус=0  тогда    // первичная запись или после удаления маркировки с прихода
			Запись.НомерСерии=ТабСтрока.НомерСерии;
			Запись.Номенклатура=ТабСтрока.Номенклатура; 
			Запись.КоличествоЕдиницТовара=ТабСтрока.Количество;
			Если Не Запись.ПроверенНасайте тогда
				Запись.КодSSCC1=ТабСтрока.КодSSCC1;
				Запись.ЕмкостьУпаковки=ТабСтрока.ЕмкостьУпаковки;
				Запись.ТипУпаковки=ТабСтрока.ТипУпаковки;
			КонецЕсли;
		КонецЕсли;	
		
		Если (мСтатус=1 или мСтатус=2) и Запись.Статус=0 тогда
			Запись.ДокументПрихода=Объект.ДокументОснование; 
			Запись.Статус=мСтатус;
			Запись.Записать(); 
		ИначеЕсли (мСтатус=3 или мСтатус=4) и Запись.Статус=2 тогда
			Запись.ДокументРасхода=Объект.ДокументОснование;
			Запись.Статус=мСтатус;
			Запись.Записать(); 
        иначе
			ФлОшиб=1; 
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если ФлОшиб=1 тогда 
		Сообщить("строка "+ТабСтрока.НомерСтроки+" Не соттветствие статуса ("+Запись.Статус+") записи реестра виду документа-основания! ");
		Сообщить("Запись прервана!");
		Возврат;
	КонецЕсли;
			
		//	//запись статуса и связей с документами найденных кодов  
		//Если Выборка.Количество()>0  Тогда         
		//	Выборка.Сбросить() ;
		//	Пока Выборка.Следующий() Цикл 
		//		Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		//		Запись.КодМаркировки=Выборка.КодМаркировки; 
		//		Запись.Прочитать();
		//		Если Запись.Выбран() тогда
		//			Если (мСтатус=1 или мСтатус=2) и Запись.Статус=0 тогда
		//				Запись.ДокументПрихода=Объект.ДокументОснование; 
		//				Запись.Статус=мСтатус; 
		//				
		//				//обновить Номенклатуру и НомерСерии ,Емкость для уже введенных кодов
		//				ПараметрыОтбора = Новый Структура;
		//				ПараметрыОтбора.Вставить("Товар", Выборка.КодМаркировки);
		//				НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
		//				Если НайденныеСтроки.Количество()>0 тогда   
		//					Запись.КодSSCC1=НайденныеСтроки[0].КодSSCC1;
		//					Запись.Номенклатура=НайденныеСтроки[0].Номенклатура;
		//					Запись.НомерСерии=НайденныеСтроки[0].НомерСерии;
		//					Запись.КоличествоЕдиницТовара=НайденныеСтроки[0].Количество;
		//					Запись.ТипУпаковки=НайденныеСтроки[0].ТипУпаковки;
		//					Запись.ЕмкостьУпаковки=НайденныеСтроки[0].ЕмкостьУпаковки; 
		//					Если НайденныеСтроки[0].ПроверенНаСайте=1 тогда
		//						Запись.ПроверенНаСайте=Истина;
		//					КонецЕсли;	
		//				КонецЕсли;
		//				
		//				Запись.Записать(); 
		//				
		//			ИначеЕсли (мСтатус=3 или мСтатус=4) и Запись.Статус=2 тогда
		//				Запись.ДокументРасхода=Объект.ДокументОснование;
		//				Запись.Статус=мСтатус;
		//				Запись.Записать(); 
		//			КонецЕсли;	 
		//		КонецЕсли;
		//		
		//		Инд=МассивКодов.Найти(Выборка.КодМаркировки);
		//		Если Не Инд=Неопределено тогда
		//			МассивКодов.Удалить(инд);
		//		КонецЕсли;	
		//	КонецЦикла; 
		//конецЕсли;
		//
		//// запись оставшихся новых кодов 
		////Если ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		//	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		//		//Если ТабСтр.Товар<>"" тогда
		//			ЗначениеКода=ТабСтр.Товар;
		//		//Иначе
		//		//	//ЗначениеКода=ТабСтр.КодSSCC1;
		//		//КонецЕсли;	
		//		
		//		Инд=МассивКодов.Найти(ЗначениеКода);
		//		Если Инд=Неопределено тогда
		//			продолжить;
		//		КонецЕсли;	
		//		
		//		Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		//		Запись.КодМаркировки=ТабСтр.Товар; 
		//		Запись.Прочитать();
		//		Если Не Запись.Выбран() тогда
		//			Запись.ПроверенНаСайте=ТабСтр.ПроверенНаСайте;
		//			Запись.КодSSCC1=ТабСтр.КодSSCC1;
		//			Запись.КодМаркировки=ЗначениеКода;;
		//			Запись.КоличествоЕдиницТовара=ТабСтр.Количество;
		//			Запись.Номенклатура=ТабСтр.Номенклатура;
		//			Запись.НомерСерии=ТабСтр.НомерСерии; 
		//			Запись.ТипУпаковки=ТабСтр.ТипУпаковки;
		//			Запись.ЕмкостьУпаковки=ТабСтр.ЕмкостьУпаковки;
		//			Запись.Статус=мСтатус;
		//			Если мСтатус=1 или мСтатус=2 тогда
		//				Запись.ДокументПрихода=Объект.ДокументОснование;
		//			ИначеЕсли мСтатус=3 или мСтатус=4 тогда         // только если разагрегация
		//				Запись.ДокументПрихода=ТабСтр.ДокументПрихода; 
		//				Запись.ДокументРасхода=Объект.ДокументОснование; 	
		//			КонецЕсли;
		//			Запись.Записать(); 
		//			
		//			//// корректировка количества записи-коробки 
		//			//Если мСтатус=3 или мСтатус=4 тогда   // только если разагрегация
		//			//	Запись.КодМаркировки=ТабСтр.КодSSCC1; 
		//			//	Запись.Прочитать();
		//			//	Если Запись.Выбран() тогда
		//			//		Запись.КоличествоЕдиницТовара=Запись.КоличествоЕдиницТовара-1;	
		//			//		Запись.Записать();
		//			//	КонецЕсли;
		//			//КонецЕсли;
		//		КонецЕсли;
		//	КонецЦикла;	
		////КонецЕсли;
		Если Объект.ДокументОснование=Неопределено тогда 
			Сообщить("Выполнена запись кодов маркировки в реестр "); 
		Иначе
			// обновить таблицу импорта 
			Для Каждого ТабСтр из Объект.КодыСписок Цикл
				Если ТабСтр.Проверка=Ложь тогда
					Продолжить;
				КонецЕсли;
				
				ТабСтр.Статус=мСтатус;
				Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда //приход
					ТабСтр.ДокументПрихода=Объект.ДокументОснование;
				Иначе	
					ТабСтр.ДокументРасхода=Объект.ДокументОснование; 
				КонецЕсли;	
			КонецЦикла;
			Сообщить("Записаны коды маркировки для документа "+Объект.ДокументОснование); 
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомплектацию(Команда) 
	
	// проверить на повторную запись
	Если ОпределитьКомплектациюНаСервере(Объект.ДокументОснование) тогда
		Сообщить(" Запись кодов маркировки по документу "+Объект.ДокументОснование+" уже производилась!" );
		Возврат;
	КонецЕсли;
	
	Если Объект.КодыСписок.Количество()=0 Тогда
		Сообщить("Заполните таблицу Комплектация товара!");
		Возврат;
	КонецЕсли;
	
	// проверить на повтор и получить массивы кодов и упаковок  для выборки из реестра КМ
	
	КоличПовторКМ=0;
	МассивКодов=Новый Массив();
	МассивУпаковок=Новый Массив();
	ФлОшиб=0;
	Для каждого ТабСтрока Из Объект.КодыСписок Цикл 
		Если ТабСтрока.Проверка=ложь тогда            // неправильные строки пропускаем
			продолжить;
		КонецЕсли;

		Если МассивКодов.Найти(ТабСтрока.Товар)=Неопределено тогда
			МассивКодов.Добавить();
			МассивКодов[МассивКодов.ВГраница()]=ТабСтрока.Товар; 
			Если ТабСтрока.УровеньУпаковки>0 тогда
				МассивУпаковок.Добавить();
				МассивУпаковок[МассивУпаковок.ВГраница()]=ТабСтрока.Товар; 
			КонецЕсли;
		Иначе
			Сообщить("Строка "+СтрЗаменить(Строка(ТабСтрока.НомерСтроки),Символ(160),"")+" "+Табстрока.КодSSCC1+" "+ТабСтрока.Товар+"  Повтор КМ! ");
			КоличПовторКМ=КоличПовторКМ+1;
			ФлОшиб=1;
		КонецЕсли; 
	КонецЦикла;  
		
	Если ФлОшиб=1 Тогда
		Сообщить("Количество повторных кодов -"+Строка(КоличПовторКМ)+". Запись списка КМ не произведена! ");
		Возврат;
	КонецЕсли;	

	// контроль по документу всех введенных строк
	Если КонтрольПоДокументуПередЗаписью()=Ложь тогда Возврат;
    КонецЕсли;
	
	ЗаписатьКомплектациюНаСервере(МассивКодов,МассивУпаковок);
КонецПроцедуры

#Область  ОткрытьОбработку 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ДокументОснование") тогда

		Объект.ДокументОснование=Параметры.ДокументОснование; 
		
		Для каждого ТабСтрока из Параметры.ДокументОснование.Товары Цикл 
			ДокСтрока=Объект.Контроль.Добавить();                                
			Если Не ТабСтрока.Серия.Пустая() тогда
				ДокСтрока.НомерСерии=ТабСтрока.Серия.Наименование; 
			КонецЕсли;	
			//ДокСтрока.Емкость=ТабСтрока.Серия.ЕмкостьУпаковки;
			ДокСтрока.Номенклатура=ТабСтрока.Номенклатура;
			ДокСтрока.GTIN=ТабСтрока.Номенклатура.GTIN;
			ДокСтрока.Количество=ТабСтрока.Количество;
			ДокСтрока.ТипТовара=ТабСтрока.Номенклатура.ВидНоменклатуры.ОсобенностьУчета;
			
			Если ТипЗнч(Объект.ДокументОснование)<>Неопределено  и 	ДокСтрока.НомерСтроки=1 тогда
				ДокСтрока.ВыборСтроки=Истина;
				GTIN1=ДокСтрока.GTIN;
				НомерСерии1=ДокСтрока.НомерСерии;
			ИначеЕсли ТипЗнч(Объект.ДокументОснование)<>Неопределено  и ДокСтрока.НомерСтроки>1 тогда
				Если ДокСтрока.GTIN=GTIN1 и ДокСтрока.НомерСерии=НомерСерии1 тогда
					ДокСтрока.ВыборСтроки=Истина;
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПроверитьРаботуСДокументами(Отказ)
	ВыборкаСправочника = Справочники.Блокировки.Выбрать();
	Пока ВыборкаСправочника.Следующий() Цикл  
		Если ВыборкаСправочника.Ссылка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ тогда
			продолжить;
		КонецЕсли;
		
		Если   НЕ ВыборкаСправочника.ДокументОснование.Пустая() тогда
			Сообщить("Пользователь " + ВыборкаСправочника.Наименование+" работает с документом "+ВыборкаСправочника.ДокументОснование);
			Отказ=Истина;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры 

&НаСервере
Функция ЗаблокироватьОбработку()
	
	Блокировка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ.ПолучитьОбъект();  
	Попытка
		Блокировка.Заблокировать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции 

&НаСервере
Функция ЗаполнитьРеквизиты(ДокументОснованиеСсылка)
	ДокументОснованиеОбъект=ДокументОснованиеСсылка.ПолучитьОбъект(); 
	ТекстДекорации = Формат(
	"Склад: " + ДокументОснованиеОбъект.Склад.Наименование + " / " +
	"Контрагент: " + ДокументОснованиеОбъект.Контрагент.Наименование + " / " +
	?(Не ПустаяСтрока(ДокументОснованиеОбъект.Договор.Наименование), " / " +
	"Договор: " + ДокументОснованиеОбъект.Договор.Наименование, "")); 
	
	
	СоответствиеВозврат=Новый Соответствие;
	СоответствиеВозврат.Вставить("Организация",ДокументОснованиеОбъект.Организация); 
	СоответствиеВозврат.Вставить("ТекстДекорации",ТекстДекорации); 
	
	Возврат СоответствиеВозврат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Если  Объект.ДокументОснование=Неопределено тогда
		// проверим работают ли с документами пользователи 
		ПроверитьРаботуСДокументами(Отказ);
		
		
		Если Отказ тогда
			Сообщить("Работа в режиме 'без привязки к документам' заблокирована. Попробуйте позже!");
		иначе
			Если НЕ ЗаблокироватьОбработку() Тогда
				Сообщить("С обработкой уже работают в режиме 'без привязки к документам'. Попробуйте позже!");
				Отказ=истина;
			КонецЕсли;
		КонецЕсли;

	Иначе
		
		РеквизитыСоответствие=ЗаполнитьРеквизиты(Объект.ДокументОснование);
		
		Организация=РеквизитыСоответствие.Получить("Организация");
		ТекстДекорации=РеквизитыСоответствие.Получить("ТекстДекорации");

		
		Элементы.Организация.Доступность=Ложь;
		
		Элементы.ДекорацияИнформация.Заголовок=ТекстДекорации;
		
		
		Элементы.ГруппаАгрегацииРазагрегации.Видимость=Ложь;
		
		Элементы.ДекорацияПредупреждение.Видимость=Ложь;
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда

			Элементы.КонтрольСертификация.Видимость=Ложь; 
			Элементы.ТоварыСписок.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыСписокЗагрузкаИзCSV.Видимость=Ложь;
			
		КонецЕсли;
		
		Элементы.КодыРаспаковки.Видимость=Ложь;
	КонецЕсли; 
	

	// заполним списокивыбора упаковки
	УпаковкаКоличествоЗаполнитьСписокВыбора();
	
	//Упаковка=1;
	СтрКонтроль=Объект.Контроль.Получить(0);
	ТипТовара=СтрКонтроль.ТипТовара;
	
	ОшибкаВвода=Ложь; 
	wsh=Новый COMОбъект("WScript.Shell"); 
	
	ВыполнитьЗакрытиеФормы=Ложь;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормыИКонтрольВведенныхДанных 

&НаКлиенте
Процедура ТоварыСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	  //Если  Разагрегация   тогда       // по документу расхода
	  //  Если СокрЛП(КодАгрегации)="" тогда
	  //  	Сообщить("Введите код коробки для разагрегации!");
	  //  	Отказ=Истина;
	  //  	возврат;
	  //  КонецЕсли;
	//Иначе 
        // агрегация без документа
		Если СокрЛП(КодАгрегации)<>"" и Емкость=0   тогда
			Сообщить("Введите емкость упаковки!");
			Отказ=Истина;
			возврат;
		ИначеЕсли СокрЛП(КодАгрегации)<>"" и Емкость=Введено  тогда
			Сообщить("Введите новый код агрегации!"); 
			Элементы.КодАгрегации.Доступность=истина;
			Элементы.Емкость.Доступность=истина;
			КодАгрегации="";
			Введено=0;
			Отказ=Истина;
			возврат;
		КонецЕсли;	
	//КонецЕсли;	

	Если ОшибкаВвода тогда
		Отказ=Истина;
		ОшибкаВвода=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные; 
	Если ТабСтрока.Проверка=Ложь тогда     // удалить без вопроса 
		УдалениеЗавершение(Неопределено, Неопределено);	
	Иначе	
		ТекстВопроса="Вы действительно хотате удалить строку "+ТабСтрока.НомерСтроки+"?";
		ПоказатьВопрос(Новый ОписаниеОповещения("УдалениеЗавершение",ЭтотОбъект),
		ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УдалениеЗавершение(РезультатВопроса, ДопПараметры) Экспорт
    Если РезультатВопроса<>КодВозвратаДиалога.Нет Тогда
		ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	
		Если ТабСтрока.Проверка тогда
			ПересчетКоличестваКМДокументаОснования(ТабСтрока);
		КонецЕсли;

		ПараметрыОтбора = Новый Структура("НомерСтроки", ТабСтрока.НомерСтроки);
		//ПараметрыОтбора.Вставить("НомерСтроки", ТабСтрока.НомерСтроки);
		МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 тогда
			Объект.КодыСписок.Удалить(МассивСтрок[0]);	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПересчетКоличестваКМДокументаОснования(ТабСтрока)
	
	Остаток= ТабСтрока.Количество;
	Для Каждого СтрокаДок из Объект.Контроль Цикл
			Если СтрокаДок.GTIN=ТабСтрока.GTIN и СтрокаДок.НомерСерии=ТабСтрока.НомерСерии Тогда
				Если СтрокаДок.КоличествоКМ >= Остаток Тогда
					//Если ТабСтрока.Количество=1 и  СтрокаДок.КоличествоКоробок>0 тогда
					//Если ТабСтрока.Количество=1 и  СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоУпаковок*СтрокаДок.Емкость тогда
					//	Продолжить;    // должны быть еще строки
					//КонецЕсли;	
					СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ-Остаток;
					Остаток=0;
				иначе
					Остаток=Остаток-СтрокаДок.КоличествоКМ;
					СтрокаДок.КоличествоКМ=0;
				КонецЕсли;	
					//Если  СтрокаДок.Емкость<>0 Тогда
					//	СтрокаДок.КоличествоУпаковок=Цел(СтрокаДок.КоличествоКМ/СтрокаДок.Емкость);
					//КонецЕсли;
				Если Остаток=0 тогда прервать;	
				КонецЕсли;	
			КонецЕсли;	 
		КонецЦикла	 
 КонецПроцедуры   




&НаКлиенте
Процедура ТоварыСписокТоварОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОшибкаВвода=Ложь;
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	КМ=Элемент.ТекстРедактирования; 
	
	//// убираем коды 29
	//Если Сред(КМ,32,1)=Символ(29) и Сред(КМ,39,1)=Символ(29) тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,33,6);      
	//	КМ3=Сред(КМ,40);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//
	//// убираем символы 029
	//иначеЕсли Сред(КМ,32,3)="029" и Сред(КМ,41,3)="029" тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,35,6);      
	//	КМ3=Сред(КМ,44);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//КонецЕсли; 
	//
	//Если НеПолныйКод и СтрДлина(КМ)>31 Тогда
	//	КМ=Лев(КМ,31);
	//КонецЕсли;
	
	//проверка структуры КМ
	//Если Лев(КМ,2)<>"01" и Сред(КМ,17,2)<>"21"  тогда
	//	ОшибкаВвода=Истина;
	//	Сообщить("Ошибка в структуре КМ! "+КМ) ; 
	//иначе
		// проверка на повтор ввода  
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Товар", КМ);
		МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 тогда
			Сообщить("Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ;
			Текст="";
			Ошибкаввода=Истина;
		КонецЕсли;	
	//КонецЕсли;
	
	Если ОшибкаВвода тогда
		СтандартнаяОбработка=ложь;   
		wsh=Новый COMОбъект("WScript.Shell"); 
		wsh.SendKeys("{Esc}"); 
	конецесли;	
	
	Если ОшибкаВвода=Ложь Тогда
		ОкончаниеВводаТекста=Истина;
	КонецЕсли;
	
КонецПроцедуры 

//&НаКлиенте
//Процедура РазагрегацияПриИзменении(Элемент)
//	// Вставить содержимое обработчика.
//	Если Разагрегация тогда
//		Элементы.КодАгрегации.Видимость=Истина;
//		Элементы.Емкость.Видимость=Истина;
//		Элементы.Емкость.ТолькоПросмотр=Истина;
//		Элементы.Введено.Видимость=Истина;
//		Упаковка=1;
//		Элементы.Упаковка.Доступность=Ложь;
//	    Элементы.ГруппаТоварыСписок.ПодчиненныеЭлементы.ТоварыСписокТовар.Доступность=Истина;	
//		Элементы.ГруппаТоварыСписок.ПодчиненныеЭлементы.ТоварыСписокКодSSCC1.Доступность=Ложь;	
//	иначе
//		Элементы.КодАгрегации.Видимость=Ложь;
//		Элементы.Емкость.Видимость=Ложь;
//		Элементы.Введено.Видимость=Ложь;
//		Элементы.Упаковка.Доступность=Истина;
//		КодАгрегации="";
//		Емкость=0;
//		Введено=0;
//	конецесли;
//	
//КонецПроцедуры



&НаСервере	
Функция ПроверитьЗапись(Запись,НомерСтроки) 
	SGTIN=СокрЛП(Запись.КодSSCC1)+" "+Лев(Запись.КодМаркировки,31); 
	ФлОшибПров=0;
	Если Объект.ДокументОснование=неопределено тогда
		Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!"); 
		ФлОшибПров=1;
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
		Если Запись.Статус<2 тогда
			Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" не оприходован!") ; 
			ФлОшибПров=1;
		ИначеЕсли Запись.Статус>2 Тогда
			Если  Объект.ДокументОснование.Ссылка<>Запись.ДокументРасхода.Ссылка тогда
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже связан с другим документом реализации!");
			иначе
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!");
			КонецЕсли;	
			ФлОшибПров=1;
		КонецЕсли;
	иначе     // документ прихода
		Если Запись.Статус>2 тогда
			Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже в обороте - есть связь с документом реализации!"); 
			ФлОшибПров=1;
		ИначеЕсли Запись.Статус<>0 Тогда
			Если Объект.ДокументОснование.Ссылка<>Запись.ДокументПрихода.Ссылка тогда
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже связан с "+Запись.ДокументПрихода.Ссылка);
			иначе	
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!");
			КонецЕсли;	
			ФлОшибПров=1;
		КонецЕсли;	
	КонецЕсли; 

	Возврат ФлОшибПров;
КонецФункции

&НаКлиенте
Функция КонтрольПоДокументу(GTIN,КоличКодов,НомерСтроки,СтрокаДокументаВыбор);
	
	ФлGTIN=0;
	ФлВыборСтроки=0;
	СтрокаДокументаВыбор=Новый Структура;
	
	Остаток=КоличКодов;
	Откат=Новый Массив(Объект.Контроль.Количество()+1);
	
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		
		Если СтрокаДок.ВыборСтроки=Ложь тогда продолжить;
		КонецЕсли;
		
		ФлВыборСтроки=1;
		НомерСерии=""; 
		
		Откат[СтрокаДок.НомерСтроки]=СтрокаДок.КоличествоКМ; // сохраним старое значение
		
		Если СтрокаДок.GTIN<>GTIN  тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДок.GTIN=GTIN Тогда 
			
			Если ФлGTIN=0 тогда 
				СтрокаДокументаВыбор.Вставить("GTIN",GTIN);
				СтрокаДокументаВыбор.Вставить("Номенклатура",СтрокаДок.Номенклатура); 
				СтрокаДокументаВыбор.Вставить("НомерСерии",СтрокаДок.НомерСерии);
				ФлGTIN=1;
			КонецЕсли;
			
			Разность=СтрокаДок.Количество-СтрокаДок.Сертификация-СтрокаДок.КоличествоКМ;
			Если Разность>=Остаток тогда
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Остаток;
				Остаток=0;
			иначе
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Разность;
				Остаток=Остаток-Разность;
			КонецЕсли;
			
			Если Остаток=0 тогда прервать;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Если ФлВыборСтроки=0 и Не Объект.ДокументОснование=Неопределено тогда 
		Сообщить("Выберите строку(строки при совпадении серий) для подсчета введеных кодов "); 
		Возврат Ложь;
		
	ИначеЕсли ФлGTIN=0 и Не Объект.ДокументОснование=Неопределено тогда 
		Сообщить("строка "+Строка(НомерСтроки)+"GTIN в документе не найден!"); 
		Возврат Ложь;
	КонецЕсли;
	
	Если Остаток>0  тогда 
		Сообщить("строка "+Строка(НомерСтроки)+" количество единиц  товара в КМ превышает количество в документе!");
		// восстановим старые значения
		Для Каждого СтрокаДок из Объект.Контроль Цикл
			Если Откат[СтрокаДок.НомерСтроки]<> Неопределено тогда 
				СтрокаДок.КоличествоКМ=Откат[СтрокаДок.НомерСтроки] // восстановим старое значение  
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции 

&НаКлиенте
Функция КонтрольПоДокументуПередЗаписью();
	БезОшибок=Истина;
	Для Каждого СтрокаДок из Объект.Контроль Цикл 
		СтрокаДок.КоличествоКМ=0;
	КонецЦикла;	  
	
	Для Каждого ТабСтрока из Объект.КодыСписок Цикл
		Если Табстрока.Проверка=Ложь тогда
			продолжить;
		КонецЕсли;
	
		Остаток=ТабСтрока.Количество;
		Откат=Новый Массив(Объект.Контроль.Количество()+1);
		Для Каждого СтрокаДок из Объект.Контроль Цикл
			
			Если СтрокаДок.GTIN<>ТабСтрока.GTIN  и СтрокаДок.НомерСерии<>ТабСтрока.НомерСерии тогда
				Продолжить;
			КонецЕсли;
			
			Откат[СтрокаДок.НомерСтроки]=СтрокаДок.КоличествоКМ; // сохраним старое значение
			
			Разность=СтрокаДок.Количество-СтрокаДок.Сертификация-СтрокаДок.КоличествоКМ;
			Если Разность>=Остаток тогда
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Остаток;
				Остаток=0;
			иначе
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Разность;
				Остаток=Остаток-Разность;
			КонецЕсли;
			
			Если Остаток=0 тогда прервать;
			КонецЕсли;	
		КонецЦикла;

		Если Остаток>0  тогда 
			Сообщить("строка "+Строка(Табстрока.НомерСтроки)+" количество единиц  товара в КМ превышает количество в документе!");
			ТабСтрока.Проверка=Ложь;
			// восстановим старые значения
			Для Каждого СтрокаДок из Объект.Контроль Цикл
				Если Откат[СтрокаДок.НомерСтроки]<> Неопределено тогда 
					СтрокаДок.КоличествоКМ=Откат[СтрокаДок.НомерСтроки]; // восстановим старое значение 
				КонецЕсли;
			КонецЦикла;
			БезОшибок=Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// проверим итоговые цифры
	Для Каждого ТабСтрока из Объект.Контроль Цикл  
		Если ТабСтрока.Количество-Табстрока.Сертификация<>ТабСтрока.КоличествоКМ тогда
			Сообщить("Строка документа "+Строка(ТабСтрока.НомерСтроки)+" - Количество товаров в документе основания не совпадает с количеством КМ");
			БезОшибок=Ложь;
		КонецЕсли;	
	КонецЦикла;	  
	
	Возврат БезОшибок;
КонецФункции

Функция ПроверкаСоответствияТипуУпаковки(КодМаркировки);

	Результат=Истина;

	КодПроверки=""; 
	Если ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка") и  
		ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция")тогда
		КодПроверки=Лев(СокрЛП(КодМаркировки),14);
	ИначеЕсли ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка") или 
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка") тогда 
		Если Лев(КодМаркировки,2)="01" и Сред(КодМаркировки,17,2)="21"  тогда 
		иначе Результат=Ложь;
		КонецЕсли;
	ИначеЕсли ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда 
		КодПроверки=СокрЛП(КодМаркировки);
	КонецЕсли;
	// проверка на числовое значение
	Если Кодпроверки<>"" Тогда	
		Попытка
			ЧисловоеЗначение=Число(КодПроверки);
		Исключение 
			Результат=Ложь;
		КонецПопытки;
	КонецЕсли;	
    Возврат Результат;
КонецФункции
		
&НаКлиенте
Процедура ТоварыСписокТоварПриИзменении(Элемент)
	
	Если  Не ОкончаниеВводаТекста тогда  Возврат;
	КонецЕсли;
	
	ОкончаниеВводаТекста=Ложь;
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные; 
	//КМ=ТабСтрока.Товар;
	
	// проверка на повтор ввода  
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Товар", ТабСтрока.Товар);
	МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>1 тогда
		//Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
		Сообщить("Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
		ТабСтрока.Проверка=Ложь;
		ОшибкаВвода=Истина;
		ТабСтрока.Товар="";
		Возврат;
	КонецЕсли;	

	УбратьКодПроверкиИКриптохвост(ТабСтрока.Товар,УпаковкаУровень,ТипТовара);  // структура кодов Aslbelgisi

	// проверка соответствия кода выбранному типу упаковки
    Если Не ПроверкаСоответствияТипуУпаковки(ТабСтрока.Товар) Тогда
		Сообщить("Несоответствие структуры КМ выбранному типу упаковки! (строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
		ТабСтрока.Проверка=Ложь;
		ОшибкаВвода=Истина;
		Возврат;
	КонецЕсли;

	СтрокаДокументаВыбор=ПолучитьДанныеСтрокиДокумента(); 
	
	Если Лев(ТабСтрока.Товар,2)="01" и Сред(ТабСтрока.Товар,17,2)="21"  тогда 
		
		ТабСтрока.GTIN=Сред(ТабСтрока.Товар,3,14);
		// поищем в справочнике 
		НоменклатураСсылка=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
		Если НоменклатураСсылка.Пустая() тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Номенклатура по GTIN не найдена!") ; 
			ТабСтрока.Проверка=Ложь;
			ОшибкаВвода=Истина;
			Возврат;
		КонецЕсли;
		
		ТабСтрока.Номенклатура=НоменклатураСсылка;
	Иначе 
		//
		//для транспортных кодов - по документу;
		ТабСтрока.GTIN=СтрокаДокументаВыбор.GTIN;
		ТабСтрока.Номенклатура=СтрокаДокументаВыбор.Номенклатура;
	КонецЕсли;	
	
	ТабСтрока.Количество=УпаковкаКоличество;      // зависит от выбраной упаковки 
	ТабСтрока.ЕмкостьУпаковки=Емкость;      
	ТабСтрока.УровеньУпаковки=УпаковкаУровень; 
	ТабСтрока.ТипУпаковки=ТипУпаковки; 
	ТабСтрока.НомерСерии=СтрокаДокументаВыбор.НомерСерии;   // предварительная запись

	Если УпаковкаУровень>0  Тогда
		Запись=ПроверитьРазагрегацию(ТабСтрока.НомерСтроки,ТабСтрока.Товар); 
		Если Запись.ФлОшиб=1 тогда
			ТабСтрока.Проверка=Ложь;
			ОшибкаВвода=Истина; 
			Возврат;
		КонецЕсли;
	Иначе   // для неагрегатных кодов
		Запись=ПрочитатьЗаписьИзРеестра(Табстрока.Товар); 
	КонецЕсли;	

	ФлОшиб=0;
	
	Если Запись.Выбран тогда 
			ТабСтрока.КодSSCC1=Запись.КодSSCC1;
			ТабСтрока.Статус=Запись.Статус;
			ТабСтрока.ДокументПрихода=Запись.ДокументПрихода;
			ТабСтрока.ДокументРасхода=Запись.ДокументРасхода; 
			ТабСтрока.НомерСерии=Запись.НомерСерии;
			
			Если ТабСтрока.ЕмкостьУпаковки<>Запись.ЕмкостьУпаковки и Запись.Статус >0 тогда
				Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Емкость упаковки не совпадает с емкостью  в реестре уже записанного КМ ") ; 
				ФлОшиб=1;
			КонецЕсли;	 
			
			// проверка серии
			
			Если СокрЛП(Запись.НомерСерии)="" и Запись.Статус=0 тогда
			     ТабСтрока.НомерСерии=СтрокаДокументаВыбор.НомерСерии;   // код введен без документа или был очищен
			ИначеЕсли СокрЛП(ТабСтрока.НомерСерии)<>СокрЛП(СтрокаДокументаВыбор.НомерСерии)  тогда
				Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Серия КМ не совпадает с серией выбраной строки документа!") ; 
				ФлОшиб=1;
			иначе	
				ФлОшибЗап=ПроверитьЗапись(Запись,ТабСтрока.Номерстроки);  
				Если ФлОшибЗап=1 тогда
					ФлОшиб=1;
				КонецЕсли;
			КонецЕсли;	 
		
	КонецЕсли;

	Если ФлОшиб=1 тогда 
		ТабСтрока.Проверка=Ложь; 
		ОшибкаВвода=Истина;
		Возврат;
		// проверка соответствия документу 
	иначеЕсли объект.ДокументОснование <> неопределено тогда
		СтрокаДокумента=Неопределено;
		Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
			ТабСтрока.Проверка=Ложь; 
			ОшибкаВвода=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	ТабСтрока.Проверка=Истина;
		
	Если Объект.ДокументОснование=Неопределено и СокрЛП(ТабСтрока.КодSSCC1)="" тогда
		ТабСтрока.КодSSCC1=КодАгрегации; 
		Введено=Введено+1; 
		Если Емкость<>0 Тогда
			ВведеноУпаковок=Цел(введено/емкость);
		КонецЕсли;
		
		Если Введено=1 тогда
			Элементы.КодАгрегации.Доступность=Ложь;
			Элементы.Емкость.Доступность=Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписокКодSSCC1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОшибкаВвода=Ложь;
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	КодSSCC1=Элемент.ТекстРедактирования;   
	
	// проверка на повтор ввода  
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КодSSCC1", КодSSCC1);
	МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>0 тогда
		Сообщить("Повтор Кода коробки при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ;
		Текст="";
		Ошибкаввода=Истина;
		СтандартнаяОбработка=ложь; 
		
		//wsh1=Новый COMОбъект("WScript.Shell"); 
		//wsh1.SendKeys("{Esc}"); 
		wsh.SendKeys("{Esc}"); 
	КонецЕсли;
	
	Если ОшибкаВвода=Ложь Тогда
		ОкончаниеВводаТекста=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРазагрегацию(НомерСтроки,КодSSCC1)
	
	Результат=Новый Соответствие;
	
	// поиск в реестре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировки.КодSSCC1 КАК КодSSCC1,
		|	КодыМаркировки.Номенклатура КАК Номенклатура,
		|	КодыМаркировки.НомерСерии КАК НомерСерии,
		|	КодыМаркировки.ЕмкостьУпаковки КАК ЕмкостьУпаковки,
		|	КодыМаркировки.Статус КАК Статус,
		|	КодыМаркировки.ДокументПрихода КАК ДокументПрихода,
		|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
		|	КодыМаркировки.ТипУпаковки КАК ТипУпаковки
		|ИЗ
		|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
		|ГДЕ
		|	(КодыМаркировки.КодSSCC1 = &КодSSCC1
		|			ИЛИ КодыМаркировки.КодМаркировки = &КодSSCC1)";
	
	Запрос.УстановитьПараметр("КодSSCC1", КодSSCC1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВозвратСтруктура=Новый Структура; 
	ВозвратСтруктура.Вставить("ФлОшиб",0);
	ВозвратСтруктура.Вставить("Выбран",Ложь);
	
	Если Выборка.Количество()=0 тогда  
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда	
			Сообщить("строка "+Строка(НомерСтроки)+" Код маркировки "+КодSSCC1+" в реестре КМ не найден!") ;   
			ВозвратСтруктура.ФлОшиб=1;
		КонецЕсли;
	ИначеЕсли Выборка.Количество()>1 Тогда  //  в реестре есть разагрегированные коды
		Сообщить("строка "+Строка(НомерСтроки)+" Код маркировки "+КодSSCC1+" в реестре КМ разагрегирован!") ;   
		ВозвратСтруктура.ФлОшиб=1;
	иначе 
		Выборка.Следующий();
		ВозвратСтруктура.Выбран=Истина;
		ВозвратСтруктура.Вставить("КодМаркировки",Выборка.КодМаркировки);
		ВозвратСтруктура.Вставить("КодSSCC1",Выборка.КодSSCC1);
		ВозвратСтруктура.Вставить("Номенклатура",Выборка.Номенклатура);
		ВозвратСтруктура.Вставить("НомерСерии",Выборка.НомерСерии);
		ВозвратСтруктура.Вставить("ЕмкостьУпаковки",Выборка.ЕмкостьУпаковки);
		ВозвратСтруктура.Вставить("Статус",Выборка.Статус);
		ВозвратСтруктура.Вставить("ДокументПрихода",Выборка.ДокументПрихода);
		ВозвратСтруктура.Вставить("ДокументРасхода",Выборка.ДокументРасхода);
		
		
	КонецЕсли;
	
	Возврат ВозвратСтруктура; 


КонецФункции	

&НаСервере
Функция ПроверитьКодSSCC1ВРеестре(НомерСтроки,КодSSCC1,СтрокаДокумента)
	
	Результат=Новый Соответствие;
	
	// поиск в реестре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировки.Номенклатура КАК Номенклатура,
		|	КодыМаркировки.Статус КАК Статус,
		|	КодыМаркировки.ДокументПрихода КАК ДокументПрихода,
		|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
		|	ЕСТЬNULL(КодыМаркировки.Номенклатура.GTIN, """") КАК GTIN,
		|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
		|	КодыМаркировки.КодSSCC1 КАК КодSSCC1,
		|	КодыМаркировки.КодМаркировки КАК КодТовара,
		|	КодыМаркировки.НомерСерии КАК НомерСерии,
		|	КодыМаркировки.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ИЗ
		|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
		|ГДЕ
		|	(КодыМаркировки.КодSSCC1 = &КодSSCC1
		|			ИЛИ КодыМаркировки.КодМаркировки = &КодSSCC1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("КодSSCC1", КодSSCC1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТЗ=РезультатЗапроса.Выгрузить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ФлОшиб=0; 
	КоличКм=0;

	Если ВыборкаДетальныеЗаписи.Количество()=0 тогда  
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда	
			Сообщить("строка "+Строка(НомерСтроки)+" Код маркировки в реестре КМ не найден!") ;   
			ФлОшиб=1;
		иначе // по документу
			//СтрокаДокумента=ПолучитьДанныеСтрокиДокумента();
			GTIN0=СтрокаДокумента.GTIN;
			Номенклатура0=СтрокаДокумента.Номенклатура;	
			НомерСерии0=СтрокаДокумента.НомерСерии;
			//ЕмкостьУпаковки0=СтрокаДокумента.Емкость;
			//КоличКМ=ЕмкостьУпаковки0;
		КонецЕсли;
	//ИначеЕсли ВыборкаДетальныеЗаписи.Количество()=1 и 
	//	ВыборкаДетальныеЗаписи.КодSSCC1=ВыборкаДетальныеЗаписи.КодМаркировки тогда  // целая коробка 	
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество()=1 Тогда  // разагрегации нет
		
		ВыборкаДетальныеЗаписи.Следующий();		
		КоличКм=ВыборкаДетальныеЗаписи.КоличествоЕдиницТовара;
		GTIN0=ВыборкаДетальныеЗаписи.GTIN;
		Номенклатура0=ВыборкаДетальныеЗаписи.Номенклатура;	
		Статус0=ВыборкаДетальныеЗаписи.Статус;
		ДокПрихода0=ВыборкаДетальныеЗаписи.ДокументПрихода;
		ДокРасхода0=ВыборкаДетальныеЗаписи.ДокументРасхода;
		НомерСерии0=ВыборкаДетальныеЗаписи.НомерСерии;
		ЕмкостьУпаковки0=ВыборкаДетальныеЗаписи.ЕмкостьУпаковки;
		ФлОшибЗап=ПроверитьЗапись(ВыборкаДетальныеЗаписи,НомерСтроки);
		Если ФлОшибЗап=1 тогда
			ФлОшиб=1;
		КонецЕсли;

	иначе
		// проверка комплектности и подсчет количества кодов // сообщение о разагрегации
		КоличКМ=0; 
		КоличествоВыборка=ВыборкаДетальныеЗаписи.Количество();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Если ВыборкаДетальныеЗаписи.КодМаркировки=КодSSCC1 тогда 
				КоличествоВыборка=КоличествоВыборка-1;
				продолжить; //разагрегированный код 
			КонецЕсли;
			Если КоличКМ=0 тогда // первый вход
				GTIN0=ВыборкаДетальныеЗаписи.GTIN;
				Номенклатура0=ВыборкаДетальныеЗаписи.Номенклатура;	
				Статус0=ВыборкаДетальныеЗаписи.Статус;
				ДокПрихода0=ВыборкаДетальныеЗаписи.ДокументПрихода;
				ДокРасхода0=ВыборкаДетальныеЗаписи.ДокументРасхода; 
				НомерСерии0=ВыборкаДетальныеЗаписи.НомерСерии;
				ЕмкостьУпаковки0=ВыборкаДетальныеЗаписи.ЕмкостьУпаковки;
			КонецЕсли;	
			Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
			Запись.КодМаркировки=ВыборкаДетальныеЗаписи.КодМаркировки; 
			Запись.Прочитать();
			Если Запись.Выбран() тогда 
				Если  Запись.Номенклатура.GTIN=GTIN0 и Запись.Статус=Статус0
					и Запись.ДокументПрихода=ДокПрихода0 и Запись.ДокументРасхода=ДокРасхода0 тогда 
					КоличКм=КоличКм+1; 
				КонецЕсли;
				ФлОшибЗап=ПроверитьЗапись(Запись,НомерСтроки);
				Если ФлОшибЗап=1 тогда
					 ФлОшиб=1;
                КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличКМ<>КоличествоВыборка тогда
			Сообщить("строка "+Строка(НомерСтроки)+" Нарушение комплектности КМ в упаковке!(разные характеристики)") ;
			ФлОшиб=1;
		КонецЕсли;	
	КонецЕсли;

	Результат.Вставить("ФлОшиб",ФлОшиб);
	Результат.Вставить("КоличКМ",КоличКМ);

	Если ФлОшиб=0 тогда 
		Результат.Вставить("GTIN",GTIN0);
		Результат.Вставить("Номенклатура",Номенклатура0);
		Результат.Вставить("Статус",Статус0);
		Результат.Вставить("ДокПрихода",ДокПрихода0);
		Результат.Вставить("ДокРасхода",ДокРасхода0);
		Результат.Вставить("НомерСерии",НомерСерии0);
		//Результат.Вставить("ЕмкостьУпаковки",ЕмкостьУпаковки0);
	КонецЕсли;

	Возврат Результат;

КонецФункции	
	
	
&НаКлиенте
//Процедура ТоварыСписокКодSSCC1ПриИзменении(Элемент)  
Процедура ТоварыСписокКодSSCC1ПриИзменении()  
	
	//Если  Не ОкончаниеВводаТекста тогда  Возврат;
	//КонецЕсли;
	
	//ОкончаниеВводаТекста=Ложь;
	
	ВведеноУпаковок=ВведеноУпаковок+1; 
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	
	//Если СтрДлина(ТабСтрока.КодSSCC1)>18 тогда
	//	ТабСтрока.КодSSCC1=Прав(СокрЛП(ТабСтрока.КодSSCC1),18); // возможно два лишних символа впереди
	//КонецЕсли;
	
	//КодSSCC=ТабСтрока.КодSSCC1;        		
	//
	//// проверка на повтор ввода  (еще раз) 
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("КодSSCC1", КодSSCC);
	//МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	//Если МассивСтрок.Количество()>1 тогда
	//	Сообщить("Повтор кода упаковки при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
	//	ТабСтрока.Проверка=Ложь;
	//	ОшибкаВвода=Истина;
	//	ТабСтрока.КодSSCC1="";
	//	Возврат;
	//КонецЕсли;

	//GTIN устанавливается по докумнту 
	СтрокаДокументаВыбор=ПолучитьДанныеСтрокиДокумента();
	//РасшифровкаАгрегации=ПроверитьКодМаркировкиВРеестре(ТабСтрока.НомерСтроки,ТабСтрока.КодSSCC1,СтрокаДокументаВыбор); 
	РасшифровкаАгрегации=ПроверитьКодSSCC1ВРеестре(ТабСтрока.НомерСтроки,ТабСтрока.Товар,СтрокаДокументаВыбор); 
	ФлОшиб=РасшифровкаАгрегации.Получить("ФлОшиб");
	
	Если ФлОшиб=1 тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Код упаковки в реестре КМ не найден!") ;   
		КонецЕсли;
		ТабСтрока.Проверка=Ложь;
		ОшибкаВвода=Истина; 
		Возврат;
	иначе
		ТабСтрока.GTIN=РасшифровкаАгрегации.Получить("GTIN");
		ТабСтрока.Номенклатура=РасшифровкаАгрегации.Получить("Номенклатура");
		ТабСтрока.Количество=РасшифровкаАгрегации.Получить("КоличКМ");
		ТабСтрока.Статус=РасшифровкаАгрегации.Получить("Статус");		
		ТабСтрока.ДокументПрихода=РасшифровкаАгрегации.Получить("ДокПрихода");
		ТабСтрока.ДокументРасхода=РасшифровкаАгрегации.Получить("ДокРасхода");
		ТабСтрока.НомерСерии=РасшифровкаАгрегации.Получить("НомерСерии");
		//ТабСтрока.ЕмкостьУпаковки=РасшифровкаАгрегации.Получить("ЕмкостьУпаковки");
		// проверка серии
	
		//НомерСерииДокСтарый=ПолучитьНомерСерииИзДокумента(ТабСтрока.GTIN); // только номер
		НомерСерииДок=ПолучитьСериюНоменклатурыИзДокумента(ТабСтрока.GTIN);      // полное наименование
		
		Если ТабСтрока.НомерСерии="" тогда
			ТабСтрока.НомерСерии=НомерСерииДок;
		ИначеЕсли СокрЛП(НомерСерииДок)<>СокрЛП(ТабСтрока.НомерСерии) тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Серия упаковки не совпадает с серией выбраной строки документа!") ; 
			ФлОшиб=1;
		КонецЕсли;
		
		Если ФлОшиб=0 тогда
			// проверка соответствия документу
			Если объект.ДокументОснование <> неопределено тогда
				СтрокаДокумента=Неопределено;
			    Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
					ТабСтрока.Проверка=Ложь; 
					ОшибкаВвода=Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТабСтрока.Проверка=Истина;
	ОшибкаВвода=Ложь;  
	
	Введено=введено+РасшифровкаАгрегации.Получить("КоличКМ");;
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция	ПроверитьНаличиеКодSSCC1ВРеестре(КодАгрегации,ДокументОснованиеСсылка);
	// поиск в реестре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировки.Номенклатура КАК Номенклатура,
		|	КодыМаркировки.Статус КАК Статус,
		|	КодыМаркировки.ДокументПрихода КАК ДокументПрихода,
		|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
		|	КодыМаркировки.Номенклатура.GTIN КАК GTIN,
		|	КодыМаркировки.КодSSCC1 КАК КодSSCC1,
		|	КодыМаркировки.ЕмкостьУпаковки КАК ЕмкостьУпаковки,
		|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
		|	КодыМаркировки.НомерСерии КАК НомерСерии
		|ИЗ
		|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
		|ГДЕ
		|	КодыМаркировки.КодSSCC1 = &КодSSCC
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодМаркировки";
	
	Запрос.УстановитьПараметр("КодSSCC", КодАгрегации);
	
	ФлагВозврата=Истина;

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	//Если Выборка.Количество()>0 и Объект.ДокументОснование=Неопределено тогда
	Если Выборка.Количество()>0 и ДокументОснованиеСсылка=Неопределено тогда
		Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ уже есть!") ;
		Кодагрегации="";
		ФлагВозврата=Ложь;
	//ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
	ИначеЕсли ТипЗнч(ДокументОснованиеСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		Если Выборка.Количество()=0 тогда
			Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ не найден!") ;
			ФлагВозврата=Ложь;	
		иначе
			КоличКМ=0; 
			ФлАгрКод=0;
			Пока Выборка.Следующий() Цикл 
				Если Лев(Выборка.КодМаркировки,2)="01" тогда
					КоличКМ=КоличКМ+1;
				ИначеЕсли СокрЛП(Выборка.КодSSCC1)=СокрЛП(Выборка.КодМаркировки) тогда  // агрегатный код
					ФлАгрКод=1;
					Если Выборка.Статус>2 тогда
						Сообщить(" Агрегатный код упаковки "+КодАгрегации+"уже реализован "+Выборка.ДокументРасхода) ; 
						КодАгрегации="";
						ФлагВозврата=Ложь;
					Иначе
						Емкость=Выборка.ЕмкостьУпаковки;
						Введено=КоличКМ;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ФлАгрКод=0 тогда 
				Сообщить(" Агрегатный код упаковки "+КодАгрегации+" в реестре КМ не найден!") ; 
				КодАгрегации=""; 
				ФлагВозврата=Ложь;
			КонецЕсли;	
		КонецЕсли		
	КонецЕсли;
    Возврат ФлагВозврата;
КонецФункции

&НаКлиенте
Процедура КодАгрегацииПриИзменении(Элемент)
	
	Если СтрДлина(КодАгрегации)>18 тогда
			КодАгрегации=Прав(СокрЛП(КодАгрегации),18); // возможно два лишних символа впереди
	КонецЕсли;
	
	Если СтрДлина(КодАгрегации)<>18  тогда
		Сообщить(" Ошибка в коде упаковки "+КодАгрегации) ;   
	    Кодагрегации="";
		Возврат;
	КонецЕсли;

	Если ПроверитьНаличиеКодSSCC1ВРеестре(КодАгрегации,Объект.ДокументОснование) тогда
		Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ уже есть!") ;   
	    Кодагрегации="";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписокПередНачаломИзменения(Элемент, Отказ) 
	Если Элементы.ТоварыСписок.ТекущиеДанные.Проверка=Истина тогда
		Отказ=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольВыборстрокиПриИзменении(Элемент)
	ТекСтрока=Элементы.Контроль.ТекущиеДанные;
	ТипТовара=ТекСтрока.ТипТовара;

	Если ТекСтрока.ВыборСтроки=Ложь тогда 
		 ТекСтрока.ВыборСтроки=Истина;
	     Возврат;
	КонецЕсли;
	
	Для каждого КонтрольСтр Из Объект.Контроль Цикл 
		
		Если КонтрольСтр.Номерстроки=ТекСтрока.НомерСтроки тогда
			Продолжить;
		КонецЕсли;
		
		Если КонтрольСтр.GTIN=ТекСтрока.GTIN и КонтрольСтр.НомерСерии=ТекСтрока.НомерСерии тогда
			КонтрольСтр.ВыборСтроки=Истина;
		Иначе
			КонтрольСтр.ВыборСтроки=Ложь;
		КонецЕсли;
		
	КонецЦикла; 
	УпаковкаКоличествоЗаполнитьСписокВыбора();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Очистить(Команда)
	//ОчиститьСписокКМНачало(Знач Оповещение);
	ОчиститьСписокКМНачало(Новый ОписаниеОповещения("ОбработкаОчисткаЗавершение",ЭтотОбъект));	// очистка с вопросом

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьСписокКМНачало(Знач Оповещение) 
	Если Объект.КодыСписок.Количество()>0 Тогда
		ТекстВопроса = "Очистить табличную часть?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьСписокКМЗавершение",Этотобъект,Оповещение),
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);					
		Возврат;
	Иначе
		//ВыполнитьОбработкуОповещения(ДопПараметры)	
		ВыполнитьОбработкуОповещения(Оповещение)	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
//Процедура ОчиститьСписокКМЗавершение(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт 
Процедура ОчиститьСписокКМЗавершение(РезультатВопроса, ДопПараметры ) Экспорт 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.КодыСписок.Очистить(); 
		КодАгрегации="";
		Введено=0;
		ВведеноУпаковок=0;
		Если Объект.Контроль.Количество()>0  тогда 
			Для каждого СтрКонтроль из Объект.Контроль цикл
				Если  СтрКонтроль.НомерСтроки=1 тогда
					СтрКонтроль.ВыборСтроки=Истина; 
					GTIN1=СтрКонтроль.GTIN;
					НомерСерии1=СтрКонтроль.НомерСерии;
				Иначе
					Если СтрКонтроль.GTIN=GTIN1 и СтрКонтроль.НомерСерии=НомерСерии1 тогда
						СтрКонтроль.ВыборСтроки=Истина;
					иначе
						СтрКонтроль.ВыборСтроки=Ложь;
					КонецЕсли;
				КонецЕсли;
				
				СтрКонтроль.КоличествоКМ=0;
				СтрКонтроль.Сертификация=0;
			КонецЦикла;	
		КонецЕсли;	
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
	КонецЕсли;  
	
	ВыполнитьОбработкуОповещения(ДопПараметры)
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОчисткаЗавершение(Результат,ДопПараметры) Экспорт
	//Сообщить(" ОбработкаОчисткаЗавершение");
КонецПроцедуры


//&НаКлиенте
//Процедура ОбработкаКомандыЗагрузкаЗавершение(Результат,ДопПараметры) Экспорт      // для отладки
//	Сообщить(" После Вопроса на очистку");
//КонецПроцедуры

	
#Область ОбработкаЗакрытияФормы 
	
&НаСервереБезКонтекста	
Процедура РазблокироватьПоДокументу(ИмяПользователя,ДокументСсылка); 
	НайденнаяСсылка= Справочники.Блокировки.НайтиПоРеквизиту("ДокументОснование",ДокументСсылка);
	Если Не НайденнаяСсылка.Пустая() тогда
		СпрОбъект=НайденнаяСсылка.ПолучитьОбъект();
		СпрОбъект.ДокументОснование=Справочники.Блокировки.ПустаяСсылка();
		СпрОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

 &НаСервереБезКонтекста	
Процедура РазблокироватьБезДокумента(); 
 	Блокировка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ.ПолучитьОбъект(); 
	Блокировка.Разблокировать();  // общая для обработки
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если ЗавершениеРаботы  тогда 
		отказ=истина; 
		Возврат;
	КонецЕсли;
	
	Если Не ВыполнитьЗакрытиеФормы и Не ЗавершениеРаботы  тогда
		ТекстВопроса="Прервать обработку (Qayta ishlashni to'xtatish)?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаЗакрытияФормы",ЭтаФорма),
		ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		Отказ=Истина; 
	Иначе	
		
		Если Объект.ДокументОснование=Неопределено тогда
			РазблокироватьБезДокумента();  // общая для обработки
			
		Иначе // по документу      РазблокироватьБезДокумента
			ИмяПользователя=ИмяПользователя(); 
			РазблокироватьПоДокументу(ИмяПользователя,Объект.ДокументОснование); 
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаВопросаЗакрытияФормы(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьЗакрытиеФормы=Истина;	
	Закрыть();	
КонецПроцедуры 
	

#КонецОбласти 

#Область РаботаСAslBelgisi 
&НаСервере
Функция ПолучитьИННОрганизации()

	Возврат Организация.ИНН;	
	
КонецФункции

&НаСервере
Функция ПолучитьПИНФЛОрганизации()

	Возврат Организация.ПИНФЛ;	
	
КонецФункции  

&НаСервере
Процедура МассивВТаблицуЗначенийПоКоду(Массив)   
	
	Для каждого Элемент Из Массив Цикл
	
		НесуществующиеКоды.Добавить().КодМаркировки = Элемент;	
	
	КонецЦикла; 
	
КонецПроцедуры

#Область ПодключитьЭЦП 
&НаКлиенте
Процедура Подключиться(Команда)
	ПриОткрытии = Ложь;
	ПодключитьсяККомпонентеНачало(ПриОткрытии);	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяККомпонентеНачало( ПриОткрытии )
	
	ДопПараметры = Новый Структура;	
	ДопПараметры.Вставить("ПриОткрытии", ПриОткрытии);
	
	Оповещение_ПодключитьсяККомпонентеЗавершение = Новый ОписаниеОповещения("ПодключитьсяККомпонентеЗавершение", ЭтаФорма, ДопПараметры);
	Оповещение_ПодключитьсяНачало = Новый ОписаниеОповещения("ПодключитьсяНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"));
	ВыполнитьОбработкуОповещения(Оповещение_ПодключитьсяНачало, Оповещение_ПодключитьсяККомпонентеЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяККомпонентеЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	КомпонентаКриптографии_ПодключениеУстановлено = Результат;
	
	//УстановитьВидимостьИДоступность();
	
	Если НЕ Результат Тогда
		//ТекстВопроса = "Не обнаружена установленная компонента криптографии. Установить?"; 
		ТекстСообщения = "Не обнаружена установленная компонента криптографии!";
		Сообщить(ТекстСообщения);
		//ЗадатьВопросОбУстановкеКомпоненты(ТекстВопроса);
	ИначеЕсли НЕ ДопПараметры["ПриОткрытии"] Тогда
		ТекстСообщения = "Компонента криптографии успешно подключена!";
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти 


&НаКлиенте
Процедура ПроверитьКодыМаркировки(Команда)
	
	Если Объект.КодыСписок.Количество()=0 тогда
		Возврат;
	КонецЕсли;
	
	Если Организация.Пустая() тогда
		Сообщить("Выберите организацию !");
		возврат;
	КонецЕсли;
	
	ЕстьНесуществующиеКоды = Истина;
	ПослеАвторизации = Ложь;
	ТолькоПроверить=Истина;
	
	КодыРазныхТиповТоваров.Очистить();
	СтатусыСОшибками.Очистить();
	НесуществующиеКоды.Очистить();
	КодыРазныхУпаковокТоваров.Очистить(); 
	KoдыРазныхGTIN.Очистить();
	КодыРазныхЕмкостей.Очистить();
	
	КодыМаркировки = ПолучитьВсеКодыМаркировки(); 

	Если КодыМаркировки.Количество() > 100 Тогда 
		//ПоказатьПредупреждение(, НСтр("ru = 'Обработка запросов требует времени потому, что у вас более 100 кодов. Пожалуйста, отметьте кнопку ""Запомнить на 6 часов"", чтобы срок действия токена не истек!'"));
	КонецЕсли;	
	
	СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, Истина);
	
	ТекстСообщения = НСтр("ru = 'Проверка завершена!'");
	//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Сообщить(ТекстСообщения);
		
КонецПроцедуры
&НаКлиенте
Процедура РаспаковатьКодыМаркировки(Команда) 

	Если Объект.КодыСписок.Количество()=0 тогда
		Возврат;
	КонецЕсли;
	
	Если Организация.Пустая() тогда
		Сообщить("Выберите организацию !");
		возврат;
	КонецЕсли;

	ЕстьНесуществующиеКоды = Ложь;
	ПослеАвторизации = Ложь;
	ТолькоПроверить=Ложь;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход 
		КодыМаркировки=ПолучитьТекущийАгрегационныйКод();    // массив
		ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
		Запись=ПроверитьРазагрегацию(ТабСтрока.НомерСтроки,ТабСтрока.Товар); 
		Если Запись.ФлОшиб=1 тогда
			Возврат;
		КонецЕсли;
		Элементы.КодыРаспаковки.Видимость=Истина;
		Объект.КодыРаспаковки.Очистить();
	Иначе	
		КодыМаркировки = ПолучитьАгрегационныеКоды();
	Конецесли;	
		
	Если КодыМаркировки.Количество()=0 тогда
		возврат;
	КонецЕсли;
	
	Если КодыМаркировки.Количество() > 100 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Обработка запросов требует времени потому, что у вас более 100 кодов. Пожалуйста, отметьте кнопку ""Запомнить на 6 часов"", чтобы срок действия токена не истек!'"));
	КонецЕсли;	
	УровеньРаспаковки=0;
	СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, Ложь);

	ТекстСообщения = НСтр("ru = 'Распаковка завершена!'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьВсеКодыМаркировки()
	
	КодыМаркировки = Новый Массив;
	
	ПотребительскиеКодыМаркировки = Новый Массив;
	ГрупповыеКодыМаркировки = Новый Массив;
	ТранспортныеКодыМаркировки = Новый Массив;

	
	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		//Если ТабСтр.Проверка=Ложь тогда  Продолжить;
		//КонецЕсли;
		
		//ТабСтр.ПроверенНаСайте=Истина;             // предварительно
		Если ТабСтр.УровеньУпаковки=0 тогда
			ПотребительскиеКодыМаркировки.Добавить(ТабСтр.Товар);
		ИначеЕсли ТабСтр.УровеньУпаковки=1 тогда
			ГрупповыеКодыМаркировки.Добавить(ТабСтр.Товар);
		иначе
			ТранспортныеКодыМаркировки.Добавить(ТабСтр.Товар);
		Конецесли;	

	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ПотребительскиеКодыМаркировки, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ГрупповыеКодыМаркировки, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ТранспортныеКодыМаркировки, Истина);
	//ДополнитьМассив(КодыМаркировки, ПотребительскиеКодыМаркировки, Истина);
	//ДополнитьМассив(КодыМаркировки, ГрупповыеКодыМаркировки, Истина);
	//ДополнитьМассив(КодыМаркировки, ТранспортныеКодыМаркировки, Истина);
	
	Возврат КодыМаркировки;
	
КонецФункции
&НаКлиенте
Функция ПолучитьАгрегационныеКоды()
	
	КодыМаркировки = Новый Массив;
	

	ПроверкаНаСайте=Ложь;
	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		Если ТабСтр.Проверка=Ложь тогда  Продолжить;
		КонецЕсли;
		
		Если ТабСтр.ПроверенНаСайте>0 Тогда
			ПроверкаНаСайте=Истина;	
		КонецЕсли;
		
		Если ТабСтр.Количество>1 и ТабСтр.ПроверенНаСайте=1 тогда
			КодыМаркировки.Добавить(ТабСтр.Товар);
		Конецесли;	

	КонецЦикла;
	
	Если ПроверкаНаСайте=Ложь тогда
		Сообщить("Выполните проверку кодов!");
	ИначеЕсли КодыМаркировки.Количество()=0 тогда
		Сообщить("Агрегационные коды для распаковки не найдены");
	КонецЕсли;	
	
	Возврат КодыМаркировки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущийАгрегационныйКод()
	КодыМаркировки = Новый Массив; 
	Если Элементы.ТоварыСписок.ТекущиеДанные.Количество>1 тогда
		КодыМаркировки.Добавить(Элементы.ТоварыСписок.ТекущиеДанные.Товар);
	иначе
		Сообщить("Выберите агрегационный код!");
	Конецесли;	
	Возврат КодыМаркировки;
КонецФункции



&НаСервере
Функция ПолучитьТаблицуДляМаркировки()
	
	Таблица = Новый ТаблицаЗначений;
	
	//Таблица.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("Код", ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("GTIN", Метаданные.ОпределяемыеТипы.GTIN.Тип);
	Таблица.Колонки.Добавить("НаименованиеТовара", ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("ТипТовара", Новый ОписаниеТипов("ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры"));     
	Таблица.Колонки.Добавить("ТипУпаковки", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыИспользованияЕдиницыХраненияИСМП"));
	Таблица.Колонки.Добавить("УровеньУпаковки", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	Таблица.Колонки.Добавить("ЕмкостьУпаковки", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	Таблица.Колонки.Добавить("СтатусКода", Новый ОписаниеТипов("ПеречислениеСсылка.aslbelgisi_СтатусКодовМаркировки"));
	Таблица.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции

&НаСервере
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));

	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);

	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);

КонецФункции

&НаКлиенте
Процедура СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, ТолькоПроверить)
	
	ТаблицаКодов = Новый Массив;
	Токен = ПолучитьТокен(Организация);
	
	ДанныеИзСайта = ПолучитьДанныеДляКодовМаркировки(Токен, КодыМаркировки, ТаблицаКодов);	
	
	Если ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.ОшибкаАутентификации") Тогда 
		
		Если ПослеАвторизации = Истина Тогда 
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;

		ПодписанныйТекст = "";
		СтруктураОтвета = АвторизацияНачало();
		
		Если СтруктураОтвета = Неопределено Тогда 
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: Не удалось подключиться к сервису!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокаНаПодпись = СтруктураОтвета.Получить("data");
		Идентификатор = СтруктураОтвета.Получить("uuid");
		
		ПолучениеКлючаОрганизацииНачало();
		ОтправитьПодписатьСтроку(КодыМаркировки, ТолькоПроверить);
		Возврат;
		
	ИначеЕсли ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.НекорректныйЗапрос") Тогда 
		
		//ТекстСообщения = СтрШаблон(ДанныеИзСайта.ТекстОшибки);
		ТекстСообщения = ДанныеИзСайта.ТекстОшибки;
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		
		МассивВТаблицуЗначенийПоКоду(ПолучитьВсеКодыМаркировки());		
		РаботаСНеправильнымиКодамиНачало();    
		
	ИначеЕсли ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.ВнутренняяОшибкаСервиса") Тогда 
		
		//ТекстСообщения = СтрШаблон(ДанныеИзСайта.ТекстОшибки);
		ТекстСообщения = ДанныеИзСайта.ТекстОшибки;
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		
	Иначе

		Если ТаблицаКодов.Количество()=0 тогда 
			Сообщить("Все указанные коды в AslBelgisi не найдены!");  
			Возврат;

		иначеЕсли ТолькоПроверить=Ложь и ТаблицаКодов.Количество()>0 тогда     // Запись распакованных кодов   
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход 
	        	ИмяТаблицы="КодыРаспаковки";
				//Объект.КодыРаспаковки.Очистить();
			Иначе
				ИмяТаблицы="КодыСписок";
			КонецЕсли;
			
			УровеньРаспаковки=УровеньРаспаковки+1;
			
			Если УровеньРаспаковки=1 тогда
				ЗаписатьРаспакованныеКоды(ТаблицаКодов,ИмяТаблицы);
			Иначе
				ЗаписатьПараметрыРаспакованныхКодов(ТаблицаКодов,ИмяТаблицы);
			Конецесли;
		Иначе  
			АгрегационныеКоды = ПроверитьЗаписатьКодыМаркировки(ТаблицаКодов, СобратьСтруктуруМаркировки(), ТолькоПроверить);
			
			//Если АгрегационныеКоды.Количество() Тогда   // проверка вложенных кодов
			//	СинхронизоватьКодыМаркировкиССайтом(АгрегационныеКоды, ТолькоПроверить);	
			//	Возврат;
			//КонецЕсли;
			
			РаботаСНеправильнымиКодамиНачало();
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#Область ПолучениеКлючаОрганизации

&НаКлиенте
Процедура ПолучениеКлючаОрганизацииНачало()

	#Если ВебКлиент Тогда
		
		ЗаполнитьСтруктуруКлючаЭЦП();
		ПолучениеКлючаОрганизацииЗавершение(СтруктураКлюча);
		
	#Иначе
		
		Оповещение_Возврат = Новый ОписаниеОповещения("ПолучениеКлючаОрганизацииЗавершение", ЭтаФорма);
		
		ДопПараметры_Оповещение = Новый Структура;
		ДопПараметры_Оповещение.Вставить("ОписаниеОповещения", Оповещение_Возврат);
		ДопПараметры_Оповещение.Вставить("ПИНФЛ", ПолучитьПИНФЛОрганизации());
		Оповещение = Новый ОписаниеОповещения("ПолучениеКлючаОрганизацииНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_Оповещение);
		ВыполнитьОбработкуОповещения(Оповещение, ПолучитьИННОрганизации());
									
	#КонецЕсли	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеКлючаОрганизацииЗавершение(Результат, ДопПараметр = Неопределено) Экспорт

	Если НЕ Результат.Свойство("serialnumber") Тогда		
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю("Не найден ключ ЭЦП организации!");
		Сообщить("Не найден ключ ЭЦП организации!");
		Возврат;	
	КонецЕсли;
	
	СтруктураКлюча = Результат;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияПолейКриптографии()
	
	JS_Браузер = Обработки.РаботаСКриптографией.ПолучитьМакет("HTML_JS_PostReport").ПолучитьТекст();

КонецПроцедуры

&НаКлиенте
Процедура СбросЗначенийПолейКриптографии()
	
	// Сброс значений полей
	JS_ДокументБраузера.testform.data.value = "";
	JS_ДокументБраузера.testform.pkcs7.value = "";
	JS_ДокументБраузера.testform.signature_hex.value = "";
	JS_ДокументБраузера.testform.timestamp.value = "";
	JS_ДокументБраузера.testform.pkcs7tst.value = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруКлючаЭЦП()
	
	СтруктураКлюча = Новый Структура;
	
	ЗаполнитьСписокКлючейЭЦП();
	СбросЗначенийПолейКриптографии();
	
	ИндексКлюча = ПолучитьИндексКлючаВТаблице();	
	Если ИндексКлюча = -1 Тогда
		
		Сообщить("Не найден ключ ЭЦП организации!");
		Возврат;
			
	КонецЕсли;

	// выбор сертификата
	JS_ДокументБраузера.testform.key.options[ИндексКлюча].selected = Истина;
	
	СтруктураКлючаСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(КлючиЭЦП[ИндексКлюча].Значение, Истина);
	СтруктураКлюча = uzbled_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруИзСоответствия(СтруктураКлючаСоответствие);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКлючейЭЦП()
	
	КлючиЭЦП.Очистить();
	
	// Получение списка клюючей в таблицу формы
	КоличествоКлючей = JS_ДокументБраузера.testform.key.length;
	Для Индекс = 0 По КоличествоКлючей - 1 Цикл
		
		Стр = КлючиЭЦП.Добавить();
		Стр["Текст"] = JS_ДокументБраузера.testform.key.options[Индекс].text; 
		Стр["Значение"] = JS_ДокументБраузера.testform.key.options[Индекс].value; 
		
		СоответствиеКлюча = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Стр["Значение"], Истина);		
		
		Стр["ИНН"] = СоответствиеКлюча.Получить("TIN");
		Стр["ПИНФЛ"] = СоответствиеКлюча.Получить("PINFL");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексКлючаВТаблице()
	
	ИНН = ПолучитьИННОрганизации();	
	ПИНФЛ = ПолучитьПИНФЛОрганизации();
	
	ТЗКлючи = КлючиЭЦП.Выгрузить();
	
	Если ЗначениеЗаполнено(ИНН) Тогда
	
		Стр = ТЗКлючи.Найти(ИНН, "ИНН");	
		Если Стр <> Неопределено Тогда
			
			Возврат ТЗКлючи.Индекс(Стр);
			
		КонецЕсли;	
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПИНФЛ) Тогда
	
		Стр = ТЗКлючи.Найти(ПИНФЛ, "ПИНФЛ");	
		Если Стр <> Неопределено Тогда
			
			Возврат ТЗКлючи.Индекс(Стр);
			
		КонецЕсли;	
	
	КонецЕсли;	
	
	Возврат -1;
	
КонецФункции

#КонецОбласти

#Область ОтправитьПодписатьСтроку 

&НаКлиенте
Процедура ОтправитьПодписатьСтроку(КодыМаркировки, ТолькоПроверить)
	
	Если СтруктураКлюча = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'Не найден ключ ЭЦП организации!'");
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;	
		
	ДопПараметры = Новый Структура("КодыМаркировки, ТолькоПроверить", КодыМаркировки, ТолькоПроверить);

	ПодписатьСтрокуЗавершение = Новый ОписаниеОповещения("ПодписатьСтрокуЗавершение", ЭтаФорма, ДопПараметры);
	
	ПодписатьCreatePKCS7Начало = Новый Структура;
	ПодписатьCreatePKCS7Начало.Вставить("СоответствиеКлюча", СтруктураКлюча);
	ПодписатьCreatePKCS7Начало.Вставить("СтрокаНаПодпись", СтрокаНаПодпись);
	Оповещение_ПодписатьCreatePKCS7Начало = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Начало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ПодписатьCreatePKCS7Начало);
	
	ВыполнитьОбработкуОповещения(Оповещение_ПодписатьCreatePKCS7Начало, ПодписатьСтрокуЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСтрокуЗавершение(Результат, ДопПараметры = Неопределено) Экспорт 
	
	Если ПустаяСтрока(Результат) Тогда
		ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
	Иначе
		
		РезультатСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Результат, Истина);
		
		Если РезультатСоответствие.Получить("success") <> Неопределено
			И РезультатСоответствие.Получить("success") Тогда
			
			ПодписанныйТекст = РезультатСоответствие.Получить("pkcs7_64");
			ХэшПодписи = РезультатСоответствие.Получить("signature_hex");
			
			Если ПодписанныйТекст <> Неопределено Тогда
				Токен = АвторизацияЗавершение(Идентификатор, ПодписанныйТекст);
				ЗаписатьНовыйТокен(Организация, Токен);
				ПослеАвторизации = Истина;
				
				Если ЗначениеЗаполнено(Токен) Тогда 
					Если ДопПараметры <> Неопределено Тогда 
						СинхронизоватьКодыМаркировкиССайтом(ДопПараметры.КодыМаркировки, ДопПараметры.ТолькоПроверить);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
				//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
				Сообщить(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область РаботаСНеправильнымиКодами

&НаКлиенте
Процедура РаботаСНеправильнымиКодамиНачало()
	
	// установим признак проверки на сайте
	Для Каждого ТабСтр Из Объект.КодыСписок Цикл
		Если ТабСтр.Проверка тогда
			ТабСтр.ПроверенНаСайте=1;	
		КонецЕсли;	
	КонецЦикла;
	
	// учтем результат проверки
	Если КодыРазныхТиповТоваров.Количество() 
		ИЛИ СтатусыСОшибками.Количество() 
		ИЛИ НесуществующиеКоды.Количество() 
		ИЛИ KoдыРазныхGTIN.Количество()
		ИЛИ КодыРазныхЕмкостей.Количество()
		ИЛИ КодыРазныхУпаковокТоваров.Количество() Тогда 
		
		КорректировкаСпискаКМ();         // корректировка признака Проверка и ПроверенНаСайте 
		
		ТекстВопроса = "Обнаружены не соответствия кодов маркировки с Асл белгиси. Сформировать отчёт?";
		Оповещение = Новый ОписаниеОповещения("РаботаСНеправильнымиКодамиЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);					
		Возврат; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаботаСНеправильнымиКодамиЗавершение(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		// Очистить таблицы
		КодыРазныхТиповТоваров.Очистить();
		СтатусыСОшибками.Очистить();
		НесуществующиеКоды.Очистить();
		КодыРазныхУпаковокТоваров.Очистить(); 
		KoдыРазныхGTIN.Очистить();
		КодыРазныхЕмкостей.Очистить();
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТабличныйДокумент = СформироватьОтчетОбОшибке();
				
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		ИдентификаторПечатнойФормы = "ПечатьДокумент";
		
		КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Отчет об ошибке маркировки (asl belgisi)'");
		ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;  //указываем подготовленный табличный документ
		ПечатнаяФорма.ТабличныйДокумент.АвтоМасштаб = Ложь;  //по ширине страницы
		
		МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция СформироватьОтчетОбОшибке()
	
	ТабличныйДокумент = СформироватьОтчетОбОшибкеТаблица(ЭтаФорма);
	
	// Очистить таблиц
		КодыРазныхТиповТоваров.Очистить();
		СтатусыСОшибками.Очистить();
		НесуществующиеКоды.Очистить();
		КодыРазныхУпаковокТоваров.Очистить(); 
		KoдыРазныхGTIN.Очистить();
		КодыРазныхЕмкостей.Очистить();

		Возврат ТабличныйДокумент;
	
КонецФункции  


&НаСервере
Функция ПроверитьЗаписатьКодыМаркировки(ДанныеДляКодовМаркировки, ДоступныКодыМаркировки, ТолькоПроверить) 
	// Получить таблицу из массива маркировки из сайта
	ТаблицаДляМаркировкиИзСайта = ПолучитьТаблицуДляМаркировки();	
	ДополнитьТаблицу(ДанныеДляКодовМаркировки, ТаблицаДляМаркировкиИзСайта, "Код");

	// Получить таблицу из массива маркировки из список формы
	ТекущиеКодыМаркировки = ПолучитьТаблицуДляМаркировки();
	ДополнитьТаблицу(ДоступныКодыМаркировки.ПотребительскиеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
	ДополнитьТаблицу(ДоступныКодыМаркировки.ГрупповыеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
	ДополнитьТаблицу(ДоступныКодыМаркировки.ТранспортныеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
		
	Результат = ПолучитьРезультатнуюСтруктуруИзСайтаДляМаркировки(ТекущиеКодыМаркировки, ТаблицаДляМаркировкиИзСайта, ТипТовара); 
	
	
	ПотребительскихСписокКодовМаркировки=Новый СписокЗначений;
	ГрупповыхСписокКодовМаркировки=Новый СписокЗначений;
	ТранспортныхСписокКодовМаркировки=Новый СписокЗначений;

	
	Для каждого СтрокаМассива Из Результат.ПотребительскиеКоды Цикл
		ПотребительскихСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
	
	Для каждого СтрокаМассива Из Результат.ГрупповыеКоды Цикл
		ГрупповыхСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
	
	Для каждого СтрокаМассива Из Результат.ТранспортныеКоды Цикл
		ТранспортныхСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
		
	ДополнитьТаблицу(Результат.КодыРазныхТиповТоваров, КодыРазныхТиповТоваров, "КодМаркировки");
	ДополнитьТаблицу(Результат.СтатусыСОшибками, СтатусыСОшибками, "КодМаркировки");
	
	 //Один раз проверить
	Если ЕстьНесуществующиеКоды Тогда  
		ДополнитьТаблицу(Результат.КодыРазныхУпаковокТоваров, КодыРазныхУпаковокТоваров, "КодМаркировки");
		
		ДополнитьТаблицу(Результат.НесуществующиеКоды, НесуществующиеКоды, "КодМаркировки");
		ЕстьНесуществующиеКоды = Ложь;
	КонецЕсли;

	ДополнитьТаблицу(Результат.КодыРазныхGTIN, KoдыРазныхGTIN, "КодМаркировки");
	ДополнитьТаблицу(Результат.КодыРазныхЕмкостей, КодыРазныхЕмкостей, "КодМаркировки");
														 
	// Получит агрегационные коды 
	АгрегационныеКоды = Новый Массив;
	
	Если ТолькоПроверить Тогда 
		
		Для каждого СтрокаМассива Из ДанныеДляКодовМаркировки Цикл
			Если СтрокаМассива.Агрегации <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АгрегационныеКоды, СтрокаМассива.Агрегации);
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат АгрегационныеКоды; 
КонецФункции 

&НаКлиенте
Функция СобратьСтруктуруМаркировки() 

	//ТипТовара=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ЛекарственныеСредства");
	//ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка");

	Структура = Новый Структура;
	Структура.Вставить("ТипТовара", ТипТовара);
	//Структура.Вставить("ТипУпаковки", ТипУпаковки);

	ПотребительскиеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ПотребительскихСписокКодовМаркировки Цикл
	//	ПотребительскиеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	ГрупповыеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ГрупповыхСписокКодовМаркировки Цикл
	//	ГрупповыеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	ТранспортныеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ТранспортныхСписокКодовМаркировки Цикл
	//	ТранспортныеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		Если ТабСтр.Проверка тогда

			Если ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка") тогда
				ПотребительскиеКодыМаркировки.Добавить(Новый Структура("Код, GTIN,Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN,ТабСтр.Проверка,ТабСтр.УровеньУпаковки,ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"),ТабСтр.Количество, ТипТовара));

			ИначеЕсли ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка") тогда  
				ГрупповыеКодыМаркировки.Добавить(Новый Структура("Код, GTIN,Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN,ТабСтр.Проверка,ТабСтр.УровеньУпаковки,ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"),ТабСтр.Количество, ТипТовара));

			ИначеЕсли ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда
				ТранспортныеКодыМаркировки.Добавить(Новый Структура("Код,GTIN, Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN ,ТабСтр.Проверка,ТабСтр.УровеньУпаковки, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"),ТабСтр.Количество, ТипТовара));
			Конецесли;	
		Конецесли;	
	КонецЦикла;
	
	Структура.Вставить("ПотребительскиеКодыМаркировки", ПотребительскиеКодыМаркировки);
	Структура.Вставить("ГрупповыеКодыМаркировки", ГрупповыеКодыМаркировки);
	Структура.Вставить("ТранспортныеКодыМаркировки", ТранспортныеКодыМаркировки);
	
	Возврат Структура;
	
КонецФункции
#КонецОбласти   

&НаКлиенте
Процедура КорректировкаСпискаКМ()
	
	Для каждого СтрокаТЧ Из НесуществующиеКоды Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из СтатусыСОшибками Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из KoдыРазныхGTIN Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из КодыРазныхЕмкостей Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура КорректировкаСтрокиСписка(СтрокаТЧ) 
	
	Код=СтрокаТЧ.КодМаркировки;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Товар", Код);
	
	НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 тогда
		ТабСтрока=НайденныеСтроки[0];
		Если ТабСтрока.Проверка тогда  // корретировка КМ в документе
			ПересчетКоличестваКМДокументаОснования(ТабСтрока);
		КонецЕсли;
		ТабСтрока.Проверка=Ложь;  
		ТабСтрока.ПроверенНаСайте=2;     // проверен - ошибки

		// корретировка строки в списке КМ
		Если СтрокаТЧ.Свойство("GTINСайт")  тогда              
			Если ТабСтрока.GTIN<>СтрокаТЧ.GTINСайт тогда
				ТабСтрока.GTIN=СтрокаТЧ.GTINСайт;
				ТабСтрока.Номенклатура=ПолучитьНоменклатурунаСервере(ТабСтрока.GTIN);
			Конецесли;
		КонецЕсли;
		Если СтрокаТЧ.Свойство("ЕмкостьУпаковкиСайт")  тогда
			Если ТабСтрока.ЕмкостьУпаковки<>0 Тогда
				КоличествоЕдиницТовара=ТабСтрока.Количество/ТабСтрока.ЕмкостьУпаковки;
				ТабСтрока.ЕмкостьУпаковки=СтрокаТЧ.ЕмкостьУпаковкиСайт;
				ТабСтрока.Количество=СтрокаТЧ.ЕмкостьУпаковкиСайт*КоличествоЕдиницТовара;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

 

&НаКлиенте
Процедура ЗаписатьРаспакованныеКоды(ТаблицаКодов,ИмяТаблицы);  
	АгрегационныеКоды = Новый Массив;
	АгрегационныеКодыВсе = Новый Массив;
	
	Для каждого СтрокаМассива Из ТаблицаКодов Цикл
		Если СтрокаМассива.Агрегации <> Неопределено Тогда 
			АгрегационныеКоды.Очистить();

			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АгрегационныеКоды, СтрокаМассива.Агрегации); 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АгрегационныеКодыВсе, СтрокаМассива.Агрегации);
			
			Для Инд=0 по АгрегационныеКоды.Количество()-1 Цикл

				Если Инд=0 тогда                         // первая строка
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Товар", СтрокаМассива.Код);
					//НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
					НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 тогда
						ТабСтрока=НайденныеСтроки[0]; 
						GTIN=ТабСтрока.GTIN;
						НомерСерии=ТабСтрока.НомерСерии;
						Номенклатура=ТабСтрока.Номенклатура;
						КоличествоЕдиницТовара=ТабСтрока.Количество/АгрегационныеКоды.Количество();
						Статус=ТабСтрока.Статус;
					иначе
						ТабСтрока=Объект[ИмяТаблицы].Добавить(); 
						Если ИмяТаблицы="КодыРаспаковки" тогда
							GTIN=СтрокаМассива.GTIN;
							Номенклатура=СтрокаМассива.НаименованиеТовара;
							Статус=СтрокаМассива.СтатусКода; 
						КонецЕсли;	
					КонецЕсли;
				иначе
					ТабСтрока=Объект[ИмяТаблицы].Добавить();
                КонецЕсли;

				ТабСтрока.КодSSCC1=СтрокаМассива.Код; 
				ТабСтрока.Товар=АгрегационныеКоды[Инд];
				ТабСтрока.GTIN=GTIN;
				ТабСтрока.Номенклатура=Номенклатура;
				ТабСтрока.НомерСерии=НомерСерии; 
				ТабСтрока.Количество=КоличествоЕдиницТовара;
				ТабСтрока.Статус=Статус;
				
				ТабСтрока.Проверка=Истина; 
				ТабСтрока.ПроверенНаСайте=1; 
				
			КонецЦикла;
		Иначе
			Если ИмяТаблицы="КодыРаспаковки" тогда
				ТабСтрока=Объект[ИмяТаблицы].Добавить(); 
				ТабСтрока.Товар=СтрокаМассива.Код;
				ТабСтрока.GTIN=СтрокаМассива.GTIN;
				ТабСтрока.Номенклатура=СтрокаМассива.НаименованиеТовара;
				ТабСтрока.Статус=СтрокаМассива.СтатусКода;
				ТабСтрока.ЕмкостьУпаковки=СтрокаМассива.ЕмкостьУпаковки;
				ТабСтрока.ТипУпаковки=СтрокаМассива.ТипУпаковки;
				ТабСтрока.Проверка=Ложь;         // агрегаций нет
			КонецЕсли;
			Сообщить("Для упаковки с кодом  "+СтрокаМассива.Код+"  вложенные коды не найдены! ");
		КонецЕсли;
	КонецЦикла; 
	
	Объект[ИмяТаблицы].Сортировать("КодSSCC1");
	Если АгрегационныеКодыВсе.Количество()>0 тогда
		СинхронизоватьКодыМаркировкиССайтом(АгрегационныеКодыВсе, Ложь); // еже раз для получения след. уровня
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПараметрыРаспакованныхКодов(ТаблицаКодов,ИмяТаблицы);  
	Для каждого СтрокаМассива Из ТаблицаКодов Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Товар", СтрокаМассива.Код);
		//НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 тогда
			ТабСтрока=НайденныеСтроки[0];
			ТабСтрока.ТипУпаковки=СтрокаМассива.ТипУпаковки;		
			ТабСтрока.УровеньУпаковки=СтрокаМассива.УровеньУпаковки;
			ТабСтрока.ЕмкостьУпаковки=СтрокаМассива.ЕмкостьУпаковки;
		КонецЕсли;
	КонецЦикла; 
	КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиРаботыССайтом

#Область ОбщиеМетоды  
Функция АвторизацияНачало() Экспорт
	
	ОтветСоответствие = aslbelgisi_МетодыДляИнтеграцииССайтом.authKey();
	
	Если Не ЗначениеЗаполнено(ОтветСоответствие.Получить("data")) 
		ИЛИ	Не ЗначениеЗаполнено(ОтветСоответствие.Получить("uuid")) Тогда 
			Возврат Неопределено;		
	КонецЕсли;

	Возврат ОтветСоответствие;
	
КонецФункции

Функция АвторизацияЗавершение(Идентификатор, ПодписаннаяСтрока) Экспорт
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("uuid", Идентификатор);
	СтруктураЗапроса.Вставить("data", ПодписаннаяСтрока);
	
	ТелоЗапроса = uzbled_EImzoСлужебный.ЗаписатьВСтрокуJSON(СтруктураЗапроса);
	Токен = aslbelgisi_МетодыДляИнтеграцииССайтом.authSimpleSignIn(ТелоЗапроса);
	
	Если Не ЗначениеЗаполнено(Токен) Тогда 
		ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: получил пустой токен!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция ПолучитьДанныеДляКодовМаркировки(Токен, КодыМаркировки, ТаблицаКодов) Экспорт 
	
	// Это структура для ошибки
	ДанныеИзСайта = Новый Структура("ТипОшибки, ТекстОшибки");
		
	ТелоЗапроса = uzbled_EImzoСлужебный.ЗаписатьВСтрокуJSON(КодыМаркировки);
	ОтветСоответствие = aslbelgisi_МетодыДляИнтеграцииССайтом.cisesInfo(Токен, ТелоЗапроса);
	
	ТипОшибки = ОтветСоответствие.Получить("ТипОшибки");
	ИнформацииОКодахМаркировки = ОтветСоответствие.Получить("ИнформацииОКодахМаркировки");
 
	Если ТипОшибки = Неопределено Тогда 
		
		Для Каждого СтрокаМассива Из ИнформацииОКодахМаркировки Цикл
			
			Если СтрокаМассива.Получить("errorCode") = Неопределено Тогда 
				ИнформацияОКоде = СтрокаМассива.Получить("cisInfo");
				КодМаркировки = ИнформацияОКоде.Получить("cis"); 
				GTIN = ИнформацияОКоде.Получить("gtin");
				УровеньУпаковки=ПолучитьУровеньУпаковкиИзСайта(ИнформацияОКоде.Получить("packageType"));
				НаименованиеТовара=ИнформацияОКоде.Получить("productName");
				ТипУпаковкиСайт = ПолучитьТипУпаковкиИзСайта(ИнформацияОКоде.Получить("packageType"));
				ТипТовараСайт = ПолучитьТипТовараИзСайта(ИнформацияОКоде.Получить("productGroup"));
				СтатусКода = ПолучитьСтатусКодаИзСайта(ИнформацияОКоде.Получить("status"));		
				Агрегации = ИнформацияОКоде.Получить("child");
				Если Агрегации<>Неопределено тогда
					ЕмкостьУпаковки=Агрегации.Количество(); 
				Иначе
					ЕмкостьУпаковки=1;
				КонецЕсли;
				ТаблицаКодов.Добавить(Новый Структура("Код,GTIN,НаименованиеТовара,ТипТовара,УровеньУпаковки, ТипУпаковки, СтатусКода, Агрегации,ЕмкостьУпаковки", 
					КодМаркировки,GTIN,НаименованиеТовара, ТипТовараСайт,УровеньУпаковки, ТипУпаковкиСайт, СтатусКода, Агрегации,ЕмкостьУпаковки));
					
			КонецЕсли;

		КонецЦикла;
		
	Иначе
		ДанныеИзСайта.ТипОшибки = ОтветСоответствие.Получить("ТипОшибки");				
		ДанныеИзСайта.ТекстОшибки = ОтветСоответствие.Получить("error_message");
	КонецЕсли;
	
	Возврат ДанныеИзСайта;
	
КонецФункции

#КонецОбласти  

#Область ЭкспортныеПроцедурыИФункции

Процедура ЗаписатьНовыйТокен(Организация, Токен) Экспорт
	
	Запись = РегистрыСведений.aslbelgisi_Токены.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Токен = Токен;
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьРезультатнуюСтруктуруИзСайтаДляМаркировки(ТекущаяТаблица, ТаблицаИзСайта, ТипТовара) Экспорт
	
	Результат = Новый Структура;
	
	// Несуществующие коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара
		|ПОМЕСТИТЬ ВТ_НесуществующиеКоды
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|ГДЕ
		|	ТекущаяТаблица.Код НЕ В(&Код)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НесуществующиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_НесуществующиеКоды.Пометка КАК Пометка,
		|	ВТ_НесуществующиеКоды.ТипУпаковки КАК ТипУпаковки,
		|	ВТ_НесуществующиеКоды.ТипТовара КАК ТипТовара
		|ИЗ
		|	ВТ_НесуществующиеКоды КАК ВТ_НесуществующиеКоды";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("Код", ТаблицаИзСайта.ВыгрузитьКолонку("Код"));
	
	НесуществующиеКоды1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("НесуществующиеКоды", НесуществующиеКоды1);
	
	// Проверить статус кодов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|ГДЕ
		|	НЕ ТаблицаИзСайта.СтатусКода В (&СтатусКода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта";
	
	СтатусКода = Новый Массив;
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.ПустаяСсылка());
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.Нанесён);
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.ВведенВОборот);
	
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	Запрос.УстановитьПараметр("СтатусКода", СтатусКода);
	
	СтатусыСОшибками1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("СтатусыСОшибками", СтатусыСОшибками1);

	// Проверить по типу упаковки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ТаблицаИзСайта.GTIN КАК GTIN,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода,
		|	ТекущаяТаблица.GTIN КАК GTIN
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ЕСТЬNULL(ВТ_ТекущаяТаблица.Пометка, ЛОЖЬ) КАК Пометка,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ВТ_ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ВТ_ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ВТ_ТаблицаИзСайта.GTIN КАК GTIN,
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	ИсправленнаяТаблица = Запрос.Выполнить().Выгрузить();

	
	
	// Получить общие коды
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НесуществующиеКоды, ИсправленнаяТаблица);
	
	// Получить измененную упаковку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТекущаяТаблица.ТипУпаковки КАК ПредыдущаяУпаковка,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ПеремещеннаяУпаковка
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|ГДЕ
		|	ВТ_ТаблицаИзСайта.ТипУпаковки <> ВТ_ТекущаяТаблица.ТипУпаковки";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ИсправленнаяТаблица);
	КодыРазныхУпаковокТоваров1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхУпаковокТоваров", КодыРазныхУпаковокТоваров1);  
	
	
	// Проерить GTIN для транспортных упаковок. Для потребительских GTIN берется из кода маркировки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ТаблицаИзСайта.GTIN КАК GTIN,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара,
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода,
		|	ТекущаяТаблица.GTIN КАК GTIN,
		|	ТекущаяТаблица.НаименованиеТовара КАК НаименованиеТовара
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.GTIN КАК GTINСайт,
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовараСайт,
		|	ВТ_ТекущаяТаблица.GTIN КАК GTIN,
		|	ВТ_ТекущаяТаблица.НаименованиеТовара КАК НаименованиеТовара,
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.GTIN <> ВТ_ТекущаяТаблица.GTIN КАК НеРавны,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковкиСайт
		|ПОМЕСТИТЬ ВТ_Общая
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Общая.GTINСайт КАК GTINСайт,
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт,
		|	ВТ_Общая.GTIN КАК GTIN,
		|	ВТ_Общая.НаименованиеТовара КАК НаименованиеТовара,
		|	ВТ_Общая.КодМаркировки КАК КодМаркировки,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Общая.ТипУпаковкиСайт) КАК ТипУпаковкиСайт
		|ИЗ
		|	ВТ_Общая КАК ВТ_Общая
		|ГДЕ
		|	ВТ_Общая.НеРавны";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	КодыРазныхGTIN1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхGTIN", КодыРазныхGTIN1);
	
	// Провверить значение ЕмкостьУпаковки

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара,
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовараСайт,
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.ЕмкостьУпаковки <> ВТ_ТекущаяТаблица.ЕмкостьУпаковки КАК НеРавны,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковкиСайт,
		|	ВТ_ТаблицаИзСайта.ЕмкостьУпаковки КАК ЕмкостьУпаковкиСайт
		|ПОМЕСТИТЬ ВТ_Общая
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт,
		|	ВТ_Общая.КодМаркировки КАК КодМаркировки,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Общая.ТипУпаковкиСайт) КАК ТипУпаковкиСайт,
		|	ВТ_Общая.ЕмкостьУпаковкиСайт КАК ЕмкостьУпаковкиСайт,
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт1
		|ИЗ
		|	ВТ_Общая КАК ВТ_Общая
		|ГДЕ
		|	ВТ_Общая.НеРавны";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	КодыРазныхЕмкостей1= Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхЕмкостей", КодыРазныхЕмкостей1);
	
	// Проверить по типу товара
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.ТипТовара КАК ТипТовара
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипТовара <> &ТипТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.ТипТовара КАК ТипТовара
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица); 
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	КодыРазныхТиповТоваров1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("КодыРазныхТиповТоваров", КодыРазныхТиповТоваров1);

		
	// Потребительские коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка);
	ПотребительскиеКоды = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());	
	Результат.Вставить("ПотребительскиеКоды", ПотребительскиеКоды);
	
	// Групповые коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка);
	ГрупповыеКоды1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("ГрупповыеКоды", ГрупповыеКоды1);
	
	// Транспортные коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка);
	
	ТранспортныеКоды1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("ТранспортныеКоды", ТранспортныеКоды1);
						
	Возврат Результат;

КонецФункции

Функция ПолучитьТокен(Организация) Экспорт
	
	Токен = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	aslbelgisi_Токены.Токен КАК Токен
		|ИЗ
		|	РегистрСведений.aslbelgisi_Токены КАК aslbelgisi_Токены
		|ГДЕ
		|	aslbelgisi_Токены.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Токен = ВыборкаДетальныеЗаписи.Токен;	
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция ПолучитьТипУпаковкиИзСайта(ТипУпаковки) Экспорт
	
	Если ТипУпаковки = "АТК" ИЛИ ТипУпаковки = "BUNDLE"  
		ИЛИ ТипУпаковки = "LEVEL5" ИЛИ ТипУпаковки = "LEVEL4"  
		ИЛИ ТипУпаковки = "LEVEL3" ИЛИ ТипУпаковки = "LEVEL2" Тогда 
		
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка;

	ИначеЕсли ТипУпаковки = "LEVEL1" Тогда 
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка;
	Иначе
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьУровеньУпаковкиИзСайта(ТипУпаковки) Экспорт
	
	Если ТипУпаковки = "АТК" ИЛИ ТипУпаковки = "BUNDLE" тогда
		Возврат 99;
	ИначеЕсли ТипУпаковки="UNIT" тогда
		Возврат 0; 
	ИначеЕсли СтрНайти(ТипУпаковки,"LEVEL")>0 Тогда 
		Возврат Число(СтрЗаменить(ТипУпаковки,"LEVEL",""));
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипТовараИзСайта(ТипТовара) Экспорт
	
	Если ТипТовара = "tobacco" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
	ИначеЕсли ТипТовара = "pharma" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеСредства;
	ИначеЕсли ТипТовара = "alcohol" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция;
	ИначеЕсли ТипТовара = "water" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ВодаИПрохладительныеНапитки;
	ИначеЕсли ТипТовара = "beer" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ПивоИПивныеНапитки;
	ИначеЕсли ТипТовара = "appliances" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.БытоваяТехника;
	Иначе
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьСтатусКодаИзСайта(Статус) Экспорт
	
	Если Статус = "EMITTED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Эмитирован;
	ИначеЕсли Статус = "APPLIED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Нанесён;
	ИначеЕсли Статус = "INTRODUCED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВведенВОборот;
	ИначеЕсли Статус = "WRITTEN_OFF" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Утилизирован;
	ИначеЕсли Статус = "WITHDRAWN" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВыведенИзОборота;
	ИначеЕсли Статус = "INTRODUCED_RETURNED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВозвращёнВОборот;
	ИначеЕсли Статус = "DISAGGREGATED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Дезагрегирован;
	ИначеЕсли Статус = "APPLIED_NOT_PAID" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.НанесёнНеОплачен;
	Иначе
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник, Колонка) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить(Колонка, СтрокаТаблицыИсточник[Колонка]);
		НайденныеСтроки = ТаблицаПриемник.НайтиСтроки(ПараметрыОтбора);
				
		Если Не НайденныеСтроки.Количество() Тогда 
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОтчетОбОшибкеТаблица(СтруктураФормы) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	//Макет = ПолучитьОбщийМакет("ОтчетОбОшибкеМаркировки");
	//Макет = Обработки.КомплектацияДвиженияМаркированныхТоваров.ПолучитьМакет("ОтчетОбОшибкеМаркировки");
	Макет = Обработки.КомплектацияДвиженияТоваровКМ.ПолучитьМакет("ОтчетОбОшибкеМаркировки");

	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заполнить(Новый Структура("Дата, Организация", ТекущаяДата(), СтруктураФормы.Организация));
	ТабДок.Вывести(Область);
	
	Если СтруктураФормы.НесуществующиеКоды.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокНесуществующихКодов");
		Область = Макет.ПолучитьОбласть("ЗаголовокНесуществующихКодов");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.НесуществующиеКоды Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧНесуществующиеКоды");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);	
		КонецЦикла; 
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;

	Если СтруктураФормы.КодыРазныхТиповТоваров.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСТипом");
		Область = Макет.ПолучитьОбласть("ЗаголовокСТипом");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхТиповТоваров Цикл
			Область = Макет.ПолучитьОбласть("СтрокиТЧСТипом");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	Если СтруктураФормы.СтатусыСОшибками.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокССтатусом");
		Область = Макет.ПолучитьОбласть("ЗаголовокССтатусом");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.СтатусыСОшибками Цикл
			Область = Макет.ПолучитьОбласть("СтрокиТЧССтатусом");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	Если СтруктураФормы.КодыРазныхУпаковокТоваров.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСУпаковкой");
		Область = Макет.ПолучитьОбласть("ЗаголовокСУпаковкой");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхУпаковокТоваров Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСУпаковкой");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
	
	Если СтруктураФормы.KoдыРазныхGTIN.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСGTIN");
		Область = Макет.ПолучитьОбласть("ЗаголовокСGTIN");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.KoдыРазныхGTIN Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСGTIN");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
	
	Если СтруктураФормы.КодыРазныхЕмкостей.Количество() Тогда
		//СтруктураФормы.КодыРазныхЕмкостей.Количество()
		ТабДок.НачатьГруппуСтрок("ЗаголовокСЕмкость");
		Область = Макет.ПолучитьОбласть("ЗаголовокСЕмкость");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхЕмкостей Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСЕмкость");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
		
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

&НаСервере
Функция СформироватьСписокВыбораНаСервере(НоменклатураСсылка) 
	МассивСЗ=Новый Массив;
	Если НоменклатураСсылка.ИспользоватьУпаковки=Ложь тогда
		МассивСЗ.Вставить(0,НоменклатураСсылка.ЕдиницаИзмерения);  // базовая единица измерния
	иначе
		Если НоменклатураСсылка.наборУпаковок=Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры тогда
			Владелец=НоменклатураСсылка;
		Иначе
			Владелец=НоменклатураСсылка.наборУпаковок;
		КонецЕсли;
		
		Выборка=Справочники.УпаковкиЕдиницыИзмерения.Выбрать(,Владелец,,"Наименование");	

		Пока Выборка.Следующий() Цикл
			Если Выборка.Наименование=НоменклатураСсылка.ЕдиницаИзмерения.Наименование тогда
				МассивСЗ.Вставить(0,Выборка.Ссылка);  // базовая единица измерния
			иначе
				МассивСЗ.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивСЗ;     //НоменклатураСсылка.ЕдиницаИзмерения=Выборка.Ссылка
КонецФункции 

&НаКлиенте
Процедура УпаковкаКоличествоЗаполнитьСписокВыбора()
	Элементы.УпаковкаЕдИзм.СписокВыбора.Очистить();
	СтрокаДок=ПолучитьДанныеСтрокиДокумента();
	МассивДляВыбора=СформироватьСписокВыбораНаСервере(СтрокаДок.Номенклатура);
	Элементы.УпаковкаЕдИзм.СписокВыбора.ЗагрузитьЗначения(МассивДляВыбора);
	УпаковкаЕдИзм=МассивДляВыбора[0]; 
	УпаковкаКоличествоПриИзменении(Неопределено)
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоИЕмкостьУпаковкиНаСервере(УпаковкаСсылка)
	текст="";
    Уровень=0;

	КоличествоУпаковок=УпаковкаСсылка.КоличествоУпаковок; 
	ПредыдущаяУпаковка=УпаковкаСсылка; 

	Пока  КоличествоУпаковок>0 Цикл 
		Текст=Текст+Строка(КоличествоУпаковок)+"X";
		Уровень=Уровень+1;
		ПредыдущаяУпаковка=ПредыдущаяУпаковка.Родитель;
		КоличествоУпаковок=ПредыдущаяУпаковка.КоличествоУпаковок;  // предыдущая упаковка
	КонецЦикла;  
	
	Если КоличествоУпаковок=0 и Уровень>0 тогда  // последняя упаковка 
		Текст=Текст+Строка(ПредыдущаяУпаковка.Числитель)+"X";
		Уровень=Уровень+1;
	КонецЕсли;	
	
	Если Текст<>"" Тогда
		Текст=Сред(Текст,1,СтрДлина(Текст)-1);  
		Если Текст="1" тогда
			Текст="";
		иначе
	    	Текст="("+Текст+")";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыУпаковки=Новый Структура;
	ПараметрыУпаковки.Вставить("текст", текст);
	ПараметрыУпаковки.Вставить("Количество", УпаковкаСсылка.Числитель);
	ПараметрыУпаковки.Вставить("Емкость", УпаковкаСсылка.КоличествоУпаковок); 
	ПараметрыУпаковки.Вставить("Уровень", Уровень); 
		
	Возврат ПараметрыУпаковки;
	
КонецФункции 

&НаКлиенте
Процедура УпаковкаКоличествоПриИзменении(Элемент)
	
	ПараметрыУпаковки=ПолучитьКоличествоИЕмкостьУпаковкиНаСервере(УпаковкаЕдИзм);
	
	УпаковкаКоличество=ПараметрыУпаковки.Количество;
	Емкость=ПараметрыУпаковки.Емкость;
	УпаковкаУровень=ПараметрыУпаковки.Уровень;
	
	Текст=ПараметрыУпаковки.Текст; 
	Элементы.ДекорацияПредупреждение.Заголовок="";
	Элементы.ДекорацияПредупреждение.Видимость=Ложь;
	
	Если (Емкость=0 и УпаковкаКоличество=0) или (Емкость=0 и УпаковкаКоличество=1) или (Емкость=1 и УпаковкаКоличество=1) тогда
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка");
		Текст=Текст+" Потребительская"; 
		УпаковкаУровень=0;
	ИначеЕсли Емкость=0 и УпаковкаКоличество>1 тогда
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка"); 
		Текст=Текст+" Групповая";
		УпаковкаУровень=1;
		Емкость=УпаковкаКоличество;
	иначе
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"); 
		Текст=Текст+" Транспортная";
		Элементы.ДекорацияПредупреждение.Заголовок="Для транспортных упаковок GTIN подставляется из документа!";
		Элементы.ДекорацияПредупреждение.Видимость=Истина;
	КонецЕсли;
	Элементы.ДекорацияУпаковка.Заголовок=Текст;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВложеннойУпаковки(УпаковкаСсылка,УровеньУпаковки)
	
	ПараметрыУпаковки=Новый Структура;  
	
	Если УровеньУпаковки>1 Тогда
	
		ВложеннаяУпаковка=УпаковкаСсылка.Родитель;

		ПараметрыУпаковки.Вставить("Количество", ВложеннаяУпаковка.Числитель);
		ПараметрыУпаковки.Вставить("Емкость", ВложеннаяУпаковка.КоличествоУпаковок);

		Если ВложеннаяУпаковка.КоличествоУпаковок=0 и ВложеннаяУпаковка.Числитель>1 Тогда   // групповая
			ПараметрыУпаковки.Вставить("УровеньУпаковки", 1);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка")); 

		ИначеЕсли ВложеннаяУпаковка.КоличествоУпаковок=0 и ВложеннаяУпаковка.Числитель=1 Тогда   // потребительская
			ПараметрыУпаковки.Вставить("УровеньУпаковки", 0);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка")); 
		иначе	
			ПараметрыУпаковки.Вставить("УровеньУпаковки",УровеньУпаковки-1);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка")); 
		КонецЕсли;

	КонецЕсли;

	Возврат ПараметрыУпаковки;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьGTINПоКодуМаркировки(КодМаркировки,УровеньУпаковки,ТипТовара);
	
	Если УровеньУпаковки>2  Тогда 
	     Возврат Неопределено;
	КонецЕсли;

	Если ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция") и 
		 УровеньУпаковки=0 тогда
		 GTIN=Сред(КодМаркировки,1,14); 
	иначеЕсли Сред(КодМаркировки,1,2)="01" тогда	// признак GTIN	
		GTIN=Сред(КодМаркировки,3,14);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат GTIN;
КонецФункции 

&НаКлиенте
Функция УбратьКодПроверкиИКриптохвост(КодМаркировки,УровеньУпаковки,ТипТовара);
	
	Если УровеньУпаковки>1 Тогда 
	     Возврат КодМаркировки;          // без изменений   транспортная упаковка
	 КонецЕсли;
	 
	
	//Для Поз29=1 по СтрДлина(КодМаркировки) Цикл 
	//	Если КодСимвола(Сред(КодМаркировки,Поз29,1))=29 тогда
	//		Если Сред(КодМаркировки,Поз29+1,2)="91" тогда
	//			КодМаркировки=Сред(КодМаркировки,1,Поз29-1);  // усеченный код GTIN + серия 
	//		КонецЕсли;	
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;

	//Возврат КодМаркировки;
	
	
	Если ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция") тогда
		Если  УровеньУпаковки=0 тогда
	 		КодМаркировки=Сред(КодМаркировки,1,21); 
		иначе		
		 	КодМаркировки=Сред(КодМаркировки,1,25); 
		КонецЕсли;

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция") или
		      ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") или 
	          ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво") тогда 
		
		Если  УровеньУпаковки=0 тогда
	 		КодМаркировки=Сред(КодМаркировки,1,25); 
		иначе		
		 	КодМаркировки=Сред(КодМаркировки,1,31); 
		КонецЕсли;

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеСредства") тогда 
		КодМаркировки=Сред(КодМаркировки,1,31); 

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.УпакованнаяВода") тогда  
		КодМаркировки=Сред(КодМаркировки,1,31); 

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БытоваяТехника") тогда 
 		КодМаркировки=Сред(КодМаркировки,1,38); 
    КонецЕсли;

	Возврат КодМаркировки;
КонецФункции 

&НаКлиенте
Процедура ЗакрытьРаспаковку(Команда)
	Объект.КодыРаспаковки.Очистить();
	Элементы.КодыРаспаковки.Видимость=Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьРаспаковкуВРеестрКМ(Команда)
	Если Объект.КодыРаспаковки.Количество()>0 тогда  
		Если Объект.КодыРаспаковки[0].Проверка=Ложь тогда
			Сообщить("Запись не требуется. Вложенные коды не найдены!");
			Возврат;
		Иначе
			ЗаписатьРаспаковкуВРеестрНаСервере(Объект.КодыРаспаковки[0].КодSSCC1)
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРаспаковкуВРеестрНаСервере(КодSSCC1) 
	
	//МассивКодов=Новый Массив(1); 
	//МассивКодов[0]=КодSSCC1;   

	МассивУпаковок=Новый Массив(1);
	МассивУпаковок[0]=КодSSCC1; 

	МассивКодов=Новый Массив(); 

	МассивКодов.Добавить();
	МассивКодов[МассивКодов.ВГраница()]=КодSSCC1;       // упаковка

	Для каждого ТабСтрока Из Объект.КодыРаспаковки Цикл    // коды разагрегации
		МассивКодов.Добавить();
		МассивКодов[МассивКодов.ВГраница()]=ТабСтрока.Товар; 
    КонецЦикла;

	// проверка на наличие кодов в реестре	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
			|	КодыМаркировки.ДокументПрихода.Ссылка КАК ДокументПрихода,
			|	КодыМаркировки.ДокументРасхода.Ссылка КАК ДокументРасхода,
			|	КодыМаркировки.Статус КАК Статус,
			|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
			|	КодыМаркировки.Номенклатура КАК Номенклатура,
			|	КодыМаркировки.КодSSCC1 КАК КодSSCC1
			|ИЗ
			|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
			|ГДЕ
			|	(КодыМаркировки.КодМаркировки В (&МассивКодов)
			|			ИЛИ КодыМаркировки.КодSSCC1 В (&МассивУпаковок))
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодМаркировки";
		
		Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
		Запрос.УстановитьПараметр("МассивУпаковок", МассивУпаковок);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		//ВыборкаТЗ=РезультатЗапроса.Выгрузить();

		Выборка = РезультатЗапроса.Выбрать();    
		
		Если Выборка.Количество()=0 тогда     // Кода в регистре нет - ошибка
		    Сообщить("Код упаковки "+КодSSCC1+" в реестре не найден! Ошибка.");
		    Возврат; 
		ИначеЕсли Выборка.Количество()>1 тогда 
			Сообщить("Код упаковки "+КодSSCC1+" уже разагрегирован! Ошибка.");
			Возврат; 
		ИначеЕсли Выборка.Следующий() и Выборка.КодМаркировки<>КодSSCC1 тогда 
		    Сообщить("Код упаковки "+КодSSCC1+" в реестре не найден! Ошибка.");
		    Возврат; 
		КонецЕсли;
		
       // запись вложенных кодов
		
	   Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
	   Запись.КодМаркировки=КодSSCC1; 
	   Запись.Прочитать(); 
	   Если Запись.Выбран() тогда
		   // сохраним значения
		   КодSSCC1=Запись.КодМаркировки;
		   КоличествоЕдиницТовара=Запись.КоличествоЕдиницТовара;
		   Номенклатура=Запись.Номенклатура;
		   НомерСерии=Запись.НомерСерии; 
		   Статус=Запись.Статус;
		   ДокументПрихода=Запись.ДокументПрихода; 
		   ДокументРасхода=Запись.ДокументРасхода; 	
		   
		   // изменим реквизиты агрегатного кода
		   Запись.КоличествоЕдиницТовара=0;
		   Запись.Статус=0;
		   Запись.ДокументПрихода=""; 
		   Запись.ДокументРасхода=""; 	
		   Запись.Записать(); 
	   КонецЕсли;
	   
	   КоличествоВложенныхКодов=Объект.КодыРаспаковки.Количество();

	   Для Каждого ТабСтр из Объект.КодыРаспаковки Цикл
		   Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		   Запись.КодМаркировки=ТабСтр.Товар; 
		   Запись.Прочитать();
		   Если Не Запись.Выбран() тогда
			   Запись.ПроверенНаСайте=Истина;
			   Запись.КодSSCC1=КодSSCC1;
			   Запись.КодМаркировки=ТабСтр.Товар;
			   Запись.КоличествоЕдиницТовара=КоличествоЕдиницТовара/КоличествоВложенныхКодов;
			   Запись.Номенклатура=Номенклатура;
			   Запись.НомерСерии=НомерСерии; 
			   Запись.ТипУпаковки=ТабСтр.ТипУпаковки;
			   Запись.ЕмкостьУпаковки=ТабСтр.ЕмкостьУпаковки;
			   Запись.Статус=Статус;
			   Запись.ДокументПрихода=ДокументПрихода; 
			   Запись.ДокументРасхода=ДокументРасхода; 	
			   Запись.Записать();
		   КонецЕсли;
		   
	   КонецЦикла;	

	   Сообщить("Выполнена запись распакованных кодов в реестр КМ"); 

		            
КонецПроцедуры

#Область Серии

&НаСервере
Процедура УстановитьВидимостьЭлементовСерий()
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	Элементы.ТоварыСтатусУказанияСерий.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	Элементы.ТоварыУказатьСерии.Видимость        = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	Элементы.ТоварыСерия.Видимость               = ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям;
	
КонецПроцедуры

//&НаСервере
//Процедура ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий)
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ОбновлятьКоличествоТоваровПриРегистрацииСерий", Истина);
//	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
//	
//	НоменклатураСервер.ОбработатьУказаниеСерий(Объект,ПараметрыУказанияСерий,ПараметрыФормыУказанияСерий,СтруктураДействий);
//	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);

//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ТекущаяСтрокаИдентификатор, КэшированныеЗначения)
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(Объект, 
				ПараметрыУказанияСерий, ТекущаяСтрокаИдентификатор, КэшированныеЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерийСервер()
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры()
//	
//	Если ТекущиеДанныеИдентификатор = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
//	ОткрытьПодборСерий(,ТекущиеДанные);
//	
//КонецПроцедуры

&НаСервере
Процедура ПодготовитьЗаполнитьУстановитьВидимостьСерий()
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ПриобретениеТоваровУслуг));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	УстановитьВидимостьЭлементовСерий();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСерииПоДаннымПоступленияТоваровНаСервере()
	
	ТаблицаТовары = Объект.Товары.Выгрузить();
	
	РезультатЗаполненияСерий = НоменклатураСервер.ЗаполнитьСерииПоДаннымТоваровУПартнеров(ТаблицаТовары, Объект, Истина);
	
	Если РезультатЗаполненияСерий.ЕстьИзменения Тогда
		СтруктураДействий = Новый Структура();
		СтруктураДействий.Вставить(
			"ПересчитатьКоличествоУпаковок",
			ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаКоличестваУпаковок());
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТовары, СтруктураДействий, Неопределено);
		
		Объект.Товары.Загрузить(ТаблицаТовары);
		
		НоменклатураСервер.ЗаполнитьСерииПоFEFO(Объект, ПараметрыУказанияСерий, Ложь);
	КонецЕсли;
	
	РезультатЗаполнения = Новый Структура("ЕстьИзменения, КоличествоИзначальноВерное");
	ЗаполнитьЗначенияСвойств(РезультатЗаполнения, РезультатЗаполненияСерий);
	
	Возврат РезультатЗаполнения;
	
КонецФункции

#КонецОбласти






