
&НаКлиенте
Асинх Процедура ЗагрузитьИзЭксель(Команда)
	
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//ДиалогОткрытияФайла.Заголовок = "Выберите табличный документ...";
	//ДиалогОткрытияФайла.Фильтр  = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2016 (*.xlsx)|*.xlsx";
	//ДиалогОткрытияФайла.Расширение = "xls,xlsx";
	//ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	//Если ДиалогОткрытияФайла.Выбрать() Тогда 
	//	ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла; 
	//КонецЕсли;   
	//
	//Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ЗагрузитьИзЭксельНаСервере(ИмяФайла);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Таблица Excel | *.xls; *.xlsx";

	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);

	Если ОписаниеФайла <> Неопределено Тогда
		ЗаполнитьНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(АдресДанных, РасширениеФайла)
	ПутьКфайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);         
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);
	
	ЗагрузитьИзЭксельНаСервере(ПутьКФайлу);
	
		
	УдалитьФайлы(ПутьКфайлу);	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭксельНаСервере(ИмяФайла)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайла);
	
	Высота = ТабДок.ВысотаТаблицы;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область(1,1,Высота,6));
	ПостроительЗапроса.Выполнить();
	
	ТаблицаЗначений = ПостроительЗапроса.Результат.Выгрузить();
	
	ИмяКолонкиНоменклатуры = ТаблицаЗначений.Колонки[0].Имя;
	ИмяКолонкиДата = ТаблицаЗначений.Колонки[1].Имя;
	ИмяКолонкиПродажи = ТаблицаЗначений.Колонки[2].Имя;
	ИмяКолонкиПродажиПрогноз = ТаблицаЗначений.Колонки[3].Имя;
	ИмяКолонкиПродажиНижняяГраница = ТаблицаЗначений.Колонки[4].Имя;
	ИмяКолонкиПродажиВерхняяГраница = ТаблицаЗначений.Колонки[5].Имя;
	
	Объект.Товары.Очистить();
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
				
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуруПоАртикулу(СтрокаТЗ[ИмяКолонкиНоменклатуры]);
		
		ДатаЗаписи = СтрЗаменить(СтрокаТЗ[ИмяКолонкиДата], ".", "");
		
		Если ЗначениеЗаполнено(ДатаЗаписи) Тогда
			ДатаПроводки = Дата(Прав(ДатаЗаписи, 4) + Сред(ДатаЗаписи, 3, 2) + Лев(ДатаЗаписи, 2));
			НоваяСтрока.Дата = ДатаПроводки;
		КонецЕсли;
		
		НоваяСтрока.Продажи = ?(ЗначениеЗаполнено(СтрокаТЗ[ИмяКолонкиПродажи]), Число(СтрокаТЗ[ИмяКолонкиПродажи]), 0);
		НоваяСтрока.ПродажиПрогноз = ?(ЗначениеЗаполнено(СтрокаТЗ[ИмяКолонкиПродажиПрогноз]), Число(СтрокаТЗ[ИмяКолонкиПродажиПрогноз]), 0);
		НоваяСтрока.ПродажиНижняяГраница = ?(ЗначениеЗаполнено(СтрокаТЗ[ИмяКолонкиПродажиНижняяГраница]), Число(СтрокаТЗ[ИмяКолонкиПродажиНижняяГраница]), 0);
		НоваяСтрока.ПродажиВерхняяГраница = ?(ЗначениеЗаполнено(СтрокаТЗ[ИмяКолонкиПродажиВерхняяГраница]), Число(СтрокаТЗ[ИмяКолонкиПродажиВерхняяГраница]), 0);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруПоАртикулу(Артикул)
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Артикул) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Номенклатура;
	
КонецФункции
	
	
