#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСПоставщиками.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.0.0.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("489f7d26-6bd5-7043-a55c-3d06d445974a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСПоставщиками.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Добавляет записи по увеличению и уменьшению ""К оплате"" в накладные по заказам и по графику договора.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВзаимозачетЗадолженности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрНакопления.РасчетыСПоставщиками";

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВтНакладныеПоГрафикам
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Регистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.КлючАналитики = Регистр.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Договоры.Ссылка = Аналитика.Договор
	|			И Договоры.ЗаданГрафикИсполнения
	|ГДЕ
	|	Регистр.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Регистр.КПоступлению > 0 
	|	И (Регистр.ЗакупкаПоЗаказу НЕ В (&ПустыеСсылкиНаЗаказы)
	|		ИЛИ Договоры.Ссылка ЕСТЬ НЕ NULL)
	|	И НЕ Регистр.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|ВЫБРАТЬ
	|	Накладные.Ссылка КАК Регистратор
	|ИЗ
	|	ВтНакладныеПоГрафикам КАК Накладные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК ЗаписиКОплате
	|			ПО ЗаписиКОплате.Регистратор = Накладные.Ссылка
	|				И ЗаписиКОплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ЗаписиКОплате.КОплате > 0
	|				И ЗаписиКОплате.ХозяйственнаяОПерация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК ЗаписиСумм
	|			ПО ЗаписиСумм.Регистратор = Накладные.Ссылка
	|				И ЗаписиСумм.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ЗаписиСумм.Сумма > 0
	|ГДЕ
	|	ЗаписиКОплате.Регистратор ЕСТЬ NULL
	|	И ЗаписиСумм.Регистратор ЕСТЬ НЕ NULL
	|
	// исправление кор.аналитики
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК КорРасчеты
	|	ПО Расчеты.Регистратор = КорРасчеты.Регистратор
	|		И Расчеты.КорАналитикаУчетаПоПартнерам = КорРасчеты.АналитикаУчетаПоПартнерам
	|		И Расчеты.КорОбъектРасчетов = КорРасчеты.ОбъектРасчетов
	|ГДЕ
	| 	Расчеты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	| 	И Расчеты.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И КорРасчеты.ОбъектРасчетов ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"),
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСПоставщиками";
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта,".")[1];
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ПараметрыОбработки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(
		Параметры.Очередь,
		Неопределено, 
		ПолноеИмяОбъекта, 
		МенеджерВременныхТаблиц);
	
	Если НЕ ПараметрыОбработки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыОбработки.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ЗаданГрафикИсполнения, ЛОЖЬ) КАК ЗаданГрафик
	|ИЗ
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК Регистр
	|			ПО Регистр.Регистратор = СсылкиДляОбработки.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Регистр.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО Аналитика.Договор = ДоговорыКонтрагентов.Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КлючиАналитики.Организация КАК Организация,
	|	КлючиАналитики.Партнер КАК Партнер,
	|	КлючиАналитики.Контрагент КАК Контрагент,
	|	КлючиАналитики.Договор КАК Договор,
	|	КлючиАналитики.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ДанныеРегистра.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	ДанныеРегистра.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	КорКлючиАналитики.Организация КАК КорОрганизация,
	|	КорКлючиАналитики.Партнер КАК КорПартнер,
	|	КорКлючиАналитики.Контрагент КАК КорКонтрагент,
	|	КорКлючиАналитики.Договор КАК КорДоговор,
	|	КорКлючиАналитики.НаправлениеДеятельности КАК КорНаправлениеДеятельности
	|ИЗ 
	|	РегистрНакопления.РасчетыСПоставщиками КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО ДанныеРегистра.Регистратор = СсылкиДляОбработки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК КлючиАналитики
	|		ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = КлючиАналитики.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК КорКлючиАналитики
	|		ПО ДанныеРегистра.КорАналитикаУчетаПоПартнерам = КорКлючиАналитики.КлючАналитики
	|ГДЕ
	| 	ДанныеРегистра.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|;
	|
	|ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор
	|ИЗ 
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТДляОбработки", ПараметрыОбработки.ИмяВременнойТаблицы);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НастройкиДоговоров = РезультатыЗапроса[0].Выгрузить();
	НастройкиДоговоров.Индексы.Добавить("АналитикаУчетаПоПартнерам");
	
	ПоляКлючаАналитики =  РезультатыЗапроса[1].Выгрузить();
	ПоляПоискаКорАналитики = "Регистратор,КорОбъектРасчетов,КорАналитикаУчетаПоПартнерам";
	ПоляПоискаАналитики = "Регистратор,ОбъектРасчетов,Организация,Контрагент,Договор,НаправлениеДеятельности";
	ПоляКлючаАналитики.Индексы.Добавить(ПоляПоискаКорАналитики);
	ПоляКлючаАналитики.Индексы.Добавить(ПоляПоискаАналитики);
	
	ОбновляемыеДанные =  РезультатыЗапроса[2].Выбрать();
	
	ПоляЗаполнения = "
		|Активность,Период,АналитикаУчетаПоПартнерам,Валюта,КОплате,
		|ХозяйственнаяОперация,ФормаОплаты,
		|ПорядокОперации,ВалютаДокумента,ИдентификаторФинЗаписи";
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ОбновляемыеДанные.Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ОбновляемыеДанные.Регистратор);
			НаборЗаписей.Прочитать();
			ДанныеНабора = НаборЗаписей.Выгрузить();
			ПоляОтбора = "АналитикаУчетаПоПартнерам,ОбъектРасчетов";
			ДанныеНабора.Индексы.Добавить(ПоляОтбора);
			
			ДатаРегистратора = Дата(1,1,1);
			ЕстьРасходКОплате = Ложь;
			ЗаписьСуммы = Неопределено;
			ЗаписьКПоступлению = Неопределено;
			ОтметитьОбработку = Истина;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сумма > 0 
					И Запись.ВидДвижения = ВидДвиженияНакопления.Расход 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					ЗаписьСуммы = Запись;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ДатаРегистратора) И ЗначениеЗаполнено(Запись.ДатаРегистратора) Тогда
					ДатаРегистратора = Запись.ДатаРегистратора;
				КонецЕсли;
				Если Запись.КПоступлению <> 0 Тогда
					ЗаписьКПоступлению = Запись;
				КонецЕсли;
				Если Запись.КОплате > 0 
					И Запись.ВидДвижения = ВидДвиженияНакопления.Приход 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					ЕстьРасходКОплате = Истина;
				КонецЕсли;
			КонецЦикла;
			
			ЗаписьНакладной = ?(ЗаписьСуммы <> Неопределено, ЗаписьСуммы, ЗаписьКПоступлению);
			
			Если Не ЕстьРасходКОплате И ЗаписьНакладной <> Неопределено Тогда
				
				Для Каждого Запись Из ДанныеНабора Цикл
					
					СтрокиНастройки = НастройкиДоговоров.НайтиСтроки(Новый Структура("АналитикаУчетаПоПартнерам",Запись.АналитикаУчетаПоПартнерам));
					Если СтрокиНастройки.Количество() = 0 Тогда 
						ЗаданГрафикИсполнения = Ложь;
					Иначе
						ЗаданГрафикИсполнения = СтрокиНастройки[0].ЗаданГрафик;
					КонецЕсли;
					
					Если (Запись.Сумма > 0 
						//ПТУ в статусе "В пути"
						ИЛИ Запись.КПоступлению > 0 И ЗаписьСуммы = Неопределено)
						И Запись.ВидДвижения = ВидДвиженияНакопления.Расход 
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
						КОплатеПриход = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(КОплатеПриход,ЗаписьНакладной,ПоляЗаполнения);
						КОплатеПриход.Период = КонецДня(Запись.ДатаПлатежа);
						КОплатеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
						КОплатеПриход.КОплате = ?(Запись.Сумма>0,Запись.Сумма,Запись.КПоступлению);
						КОплатеПриход.ВариантОплаты = Запись.ВариантОплаты;
						КОплатеПриход.ДатаПлатежа = Запись.ДатаПлатежа;
						КОплатеПриход.ЗакупкаПоЗаказу = Запись.ЗакупкаПоЗаказу;
						КОплатеПриход.ПорядокЗачетаПоДатеПлатежа = Запись.ПорядокЗачетаПоДатеПлатежа;
						КОплатеПриход.ОбъектРасчетов = Запись.ОбъектРасчетов;
						КОплатеПриход.ДатаРегистратора = ДатаРегистратора;
						Если НЕ ЗначениеЗаполнено(КОплатеПриход.ВариантОплаты) Тогда
							КОплатеПриход.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления;
						КонецЕсли;
					КонецЕсли;
					Если Запись.КПоступлению > 0
						И Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						КОплатеРасход = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(КОплатеРасход,ЗаписьНакладной,ПоляЗаполнения);
						КОплатеРасход.Период = Запись.Период;
						КОплатеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
						КОплатеРасход.КОплате = Запись.КПоступлению;
						КОплатеРасход.ЗакупкаПоЗаказу = Запись.ЗакупкаПоЗаказу;
						КОплатеРасход.ПорядокЗачетаПоДатеПлатежа = ЗаписьНакладной.ПорядокОперации;
						КОплатеРасход.ОбъектРасчетов = Запись.ОбъектРасчетов;
						КОплатеРасход.ДатаРегистратора = ДатаРегистратора;
					КонецЕсли;
				КонецЦикла;
					
			КонецЕсли;
			
			#Область ИсправлениеКорАналитики
			ТаблицыДвижений = Неопределено;
			НовыеДанныеНабора = Неопределено;
			ЗаменитьНабор = Ложь;
			Для Каждого Запись Из ДанныеНабора Цикл
				
				Если ТипЗнч(ОбновляемыеДанные.Регистратор) <> Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				 	Прервать;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Запись.КорОбъектРасчетов) Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура("АналитикаУчетаПоПартнерам,ОбъектРасчетов");
				Отбор.ОбъектРасчетов = Запись.КорОбъектРасчетов;
				Отбор.АналитикаУчетаПоПартнерам = Запись.КорАналитикаУчетаПоПартнерам;
				СтрокиКорЧасти = ДанныеНабора.НайтиСтроки(Отбор);
				Если СтрокиКорЧасти.Количество() <> 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОтборКорАналитики = Новый Структура(ПоляПоискаКорАналитики);
				ОтборКорАналитики.Регистратор = ОбновляемыеДанные.Регистратор;
				ОтборКорАналитики.КорОбъектРасчетов = Запись.КорОбъектРасчетов;
				ОтборКорАналитики.КорАналитикаУчетаПоПартнерам = Запись.КорАналитикаУчетаПоПартнерам;
				КорАналитика = ПоляКлючаАналитики.НайтиСтроки(ОтборКорАналитики);
				
				Если КорАналитика.Количество() = 0 Тогда
					ОтметитьОбработку = Ложь;
					Прервать;
				КонецЕсли;
				
				ОтборАналитики = Новый Структура(ПоляПоискаАналитики);
				ОтборАналитики.Регистратор = ОбновляемыеДанные.Регистратор;
				ОтборАналитики.ОбъектРасчетов = Запись.КорОбъектРасчетов;
				ОтборАналитики.Организация = КорАналитика[0].КорОрганизация;
				ОтборАналитики.Контрагент = КорАналитика[0].КорКонтрагент;
				ОтборАналитики.Договор = КорАналитика[0].КорДоговор;
				ОтборАналитики.НаправлениеДеятельности = КорАналитика[0].КорНаправлениеДеятельности;
			
				Аналитика = ПоляКлючаАналитики.НайтиСтроки(ОтборАналитики);
				Если Аналитика.Количество() = 1 Тогда
					Запись.КорАналитикаУчетаПоПартнерам = Аналитика[0].АналитикаУчетаПоПартнерам;
					ЗаменитьНабор = Истина;
				Иначе
					Если ТаблицыДвижений = Неопределено Тогда
						ТаблицыДвижений = Документы.ВзаимозачетЗадолженности.ДанныеДокументаДляПроведения(ОбновляемыеДанные.Регистратор, ИмяОбъекта);
					КонецЕсли;
					СтарыеДанныеНабора = НаборЗаписей.Выгрузить();
					НовыеДанныеНабора = ТаблицыДвижений.ТаблицаРасчетыСПоставщиками;
					Для Каждого Строка Из НовыеДанныеНабора Цикл
						НоваяСтрока = СтарыеДанныеНабора.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.Сумма = -Строка.Сумма;
						НоваяСтрока.КОплате = -Строка.КОплате;
						НоваяСтрока.СуммаРегл = -Строка.СуммаРегл;
						НоваяСтрока.СуммаУпр = -Строка.СуммаУпр;
					КонецЦикла;
					КопияНабора = НовыеДанныеНабора.Скопировать();
					КопияНабора.Свернуть("АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта","Сумма,КОплате,СуммаРегл,СуммаУпр");
					СтарыеДанныеНабора.Свернуть("АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта","Сумма,КОплате,СуммаРегл,СуммаУпр");
					ОтборНулей = Новый Структура("Сумма,КОплате,СуммаРегл,СуммаУпр",0,0,0,0);
					СтрокиСНулями = СтарыеДанныеНабора.НайтиСтроки(ОтборНулей);
					Если СтрокиСНулями.Количество() <> КопияНабора.Количество() Тогда
						НовыеДанныеНабора = Неопределено;
						ОтметитьОбработку = Истина;
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			Если НовыеДанныеНабора <> Неопределено Тогда
				НаборЗаписей.Загрузить(НовыеДанныеНабора);
			ИначеЕсли ЗаменитьНабор Тогда
				НаборЗаписей.Загрузить(ДанныеНабора);
			КонецЕсли;
			#КонецОбласти
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ИначеЕсли ОтметитьОбработку Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ОбновляемыеДанные.Регистратор);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры
 
#КонецОбласти

#КонецОбласти

#КонецЕсли