///////////////
// Метод API //
///////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбщиеМетоды

Функция ПолучитьАдресСервера() Экспорт
	
	//ЭтоТест = aslbelgisi_ОбработчикиРаботыССайтом.ОбщиеНастройкиПриЧтенииНаСервере().ЭтоТест;
	//
	//Если ЭтоТест Тогда		
	//	АдресСервера = "stage.aslbelgisi.uz/api/v3/true-api/";
	//Иначе
	//	АдресСервера = "aslbelgisi.uz/api/v3/true-api/";
	//КонецЕсли;
	
	АдресСервера = "aslbelgisi.uz/api/v3/true-api/";

	Возврат АдресСервера;
		
КонецФункции

Функция authKey() Экспорт
	
	АдресСервера = ПолучитьАдресСервера();
	ОтветСоответствие = Новый Соответствие;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера);
	HTTPЗапрос = Новый HTTPЗапрос("/auth/key");
	
	ОтветСервера = HTTPСоединение.Получить(HTTPЗапрос); // GET
	
	Если ОтветСервера.КодСостояния = 200 Тогда
		ОтветJSON = ОтветСервера.ПолучитьТелоКакСтроку();
		ОтветСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(ОтветJSON, Истина);
	Иначе
		ОтветСоответствие.Вставить("ТипОшибки", Перечисления.aslbelgisi_ВидыОшибок.ОшибкаПодключения);
	КонецЕсли;			
	
	Возврат ОтветСоответствие;	

КонецФункции

Функция authSimpleSignIn(ТелоЗапроса) Экспорт

	Токен = "";
	АдресСервера = ПолучитьАдресСервера();
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера);
	HTTPЗапрос = Новый HTTPЗапрос("/auth/simpleSignIn");
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); // POST
	Если ОтветСервера.КодСостояния = 200 Тогда
		
		ОтветJSON = ОтветСервера.ПолучитьТелоКакСтроку();
		ОтветСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(ОтветJSON, Истина);
		
		Токен = ?(ОтветСоответствие.Получить("token") <> Неопределено, ОтветСоответствие.Получить("token"), "");	
		
	КонецЕсли;

	Возврат Токен;	

КонецФункции

Функция cisesInfo(Токен, ТелоЗапроса) Экспорт
	
	АдресСервера = ПолучитьАдресСервера();
	ОтветСоответствие = Новый Соответствие;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос("/cises/info");
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));
	
	ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); // POST
	
	Если ОтветСервера.КодСостояния = 200 Тогда
		
		ОтветJSON = ОтветСервера.ПолучитьТелоКакСтроку();
		ИнформацииОКодахМаркировки = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(ОтветJSON, Истина);
		ОтветСоответствие.Вставить("ИнформацииОКодахМаркировки", ИнформацииОКодахМаркировки);
		
	ИначеЕсли ОтветСервера.КодСостояния = 401 Тогда
		
		ОтветСоответствие.Вставить("ТипОшибки", Перечисления.aslbelgisi_ВидыОшибок.ОшибкаАутентификации);
		
	ИначеЕсли ОтветСервера.КодСостояния = 403 ИЛИ ОтветСервера.КодСостояния = 404 Тогда
		
		ОтветJSON = ОтветСервера.ПолучитьТелоКакСтроку();
		ОтветСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(ОтветJSON, Истина);
		ОтветСоответствие.Вставить("ТипОшибки", Перечисления.aslbelgisi_ВидыОшибок.НекорректныйЗапрос);
		
	ИначеЕсли ОтветСервера.КодСостояния <> 200 Тогда 
		
		ОтветJSON = ОтветСервера.ПолучитьТелоКакСтроку();
		ОтветСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(ОтветJSON, Истина);
		ОтветСоответствие.Вставить("ТипОшибки", Перечисления.aslbelgisi_ВидыОшибок.ВнутренняяОшибкаСервиса);
		
	КонецЕсли;

	Возврат ОтветСоответствие;	

КонецФункции

#КонецОбласти

#КонецЕсли