////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейУзбекистанВызовСервера.
//
////////////////////////////////////////////////////////////////////////////////

// Проверка подключения Интернет-поддержки пользователей.
// 
// Возвращаемое значение:
//  Булево - признак подключения в информационной базе.
//
Функция ИнтернетПоддержкаПодключена() Экспорт

	Возврат ИнтернетПоддержкаПользователейУзбекистан.ИнтернетПоддержкаПодключена();	
	
КонецФункции
	
// Получает ник сервиса по переданному наименованию
Функция ПолучитьНикСервисаПоНаименованию(НаименованиеСервиса) Экспорт
	
	Возврат ИнтернетПоддержкаПользователейУзбекистан.ПолучитьНикСервисаПоНаименованию(НаименованиеСервиса);	
	
КонецФункции // ПолучитьНикСервисаПоНаименованию()

// Процедура выполняет подключение к сервисам
// Параметры:
// НикСервсиа - ник сервиса в портале ИТС, строка
// ПараметыСерыиса - параметры сервиса, состав параметров зависит от контркетного сервиса, структура
// Результат - результат выполнения процедуры, структура
//								Ключ	|	Значение
//								Успешно |   Истина/Ложь
//								ДанныеСервиса |  <ДанныеСервиса>
//  							ТекстОшибки | <Текст сообщения для пользователя, заполняется если Успешно = Ложь>
// ОшибкаАвторизацииВПорталеИТС - признак успешной атворизации, для дальнейшей обработки, булево
Процедура ПодключитьсяКСервису(НикСервиса, ПараметрыСервиса, Результат = Неопределено, ВыводитьСообщенияПользователю = Истина) Экспорт
	
	ИнтернетПоддержкаПользователейУзбекистан.ПодключитьсяКСервису(НикСервиса, ПараметрыСервиса, Результат, , ВыводитьСообщенияПользователю);	
	
КонецПроцедуры // ПодключитьсяКСервису()

Процедура ПолучитьИнформациюОПодпискеПользователяПоЛогину(ЛогинПользователяПорталаИТС, Результат = Неопределено) Экспорт

	ИнтернетПоддержкаПользователейУзбекистан.ПолучитьИнформациюОПодпискеПользователяПоЛогину(ЛогинПользователяПорталаИТС, Результат);
	
КонецПроцедуры

Функция ПолучитьКоличествоДнейДоКонцаПериодаПодписки() Экспорт
	
	Возврат ИнтернетПоддержкаПользователейУзбекистан.ПолучитьКоличествоДнейДоКонцаПериодаПодписки();	
	
КонецФункции