////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейУзбекистан.
// Подключение и загрузка курсов валют.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверка подключения Интернет-поддержки пользователей.
// 
// Возвращаемое значение:
//  Булево - признак подключения в информационной базе.
//
Функция ИнтернетПоддержкаПодключена() Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	
КонецФункции // ИнтернетПоддержкаПодключена()

// Процедура выполняет подключение к сервисам
// Параметры:
// НикСервсиа - ник сервиса в портале ИТС, строка
// ПараметыСерыиса - параметры сервиса, состав параметров зависит от контркетного сервиса, структура
// Результат - результат выполнения процедуры, структура
//								Ключ	|	Значение
//								Успешно |   Истина/Ложь
//								ДанныеСервиса |  <ДанныеСервиса>
//  							ТекстОшибки | <Текст сообщения для пользователя, заполняется если Успешно = Ложь>
// ОшибкаАвторизацииВПорталеИТС - признак успешной атворизации, для дальнейшей обработки, булево
Процедура ПодключитьсяКСервису(НикСервиса, ПараметрыСервиса, Результат = Неопределено, ОшибкаАвторизацииВПорталеИТС = Ложь, ВыводитьСообщенияПользователю = Истина) Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ДанныеСервиса", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	Тикет = "";
	
	Если НЕ ЭтоSaaS() Тогда
		
		// Проверка подключения интернет-поддержки
		ИнтернетПоддержкаПользователейПодключена = ИнтернетПоддержкаПодключена();
		Если Не ИнтернетПоддержкаПользователейПодключена Тогда
			
			ИнтернетПоддержкаПользователейПодключена = Ложь;
			ТекстОщибки = "Для пользования сервисом необходимо подключить интернет-поддержку пользователей";
			Результат.Вставить("ТекстОшибки", ТекстОщибки);
			Если ВыводитьСообщенияПользователю Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОщибки);
			Иначе
				ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОщибки);
			КонецЕсли;
			ОшибкаАвторизацииВПорталеИТС = Истина;
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАутентификацииВСервисе = ИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки(НикСервиса);
		УстановитьПривилегированныйРежим(Ложь);
		Если ЗначениеЗаполнено(ДанныеАутентификацииВСервисе.КодОшибки) Тогда
			Если ДанныеАутентификацииВСервисе.КодОшибки = "НеверныйЛогинИлиПароль" Тогда
				ИнтернетПоддержкаПользователейПодключена = Ложь;
			КонецЕсли;
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось подключиться к порталу интернет-поддержки по причине:
			|%1'"),
			ДанныеАутентификацииВСервисе.СообщениеОбОшибке);
			Если ВыводитьСообщенияПользователю Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			Иначе
				ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			КонецЕсли;
			Результат.Вставить("ТекстОшибки", ОписаниеОшибки);
			ОшибкаАвторизацииВПорталеИТС = Истина;
			Возврат;
		КонецЕсли;
		
		Тикет = ДанныеАутентификацииВСервисе.Тикет;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификацииИнтернетПоддержки = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("serviceNick", НикСервиса);
	СтруктураТелаЗапроса.Вставить("ticket", Тикет);
	СтруктураТелаЗапроса.Вставить("serviceParameters", ПараметрыСервиса);
	Если ЭтоSaaS() Тогда
		СтруктураТелаЗапроса.Вставить("SaaS", Истина);
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	СтруктураСистемнойИнформации = Новый Структура;
	СтруктураСистемнойИнформации.Вставить("ВерсияОС", СистемнаяИнформация.ВерсияОС);
	СтруктураСистемнойИнформации.Вставить("ВерсияПриложения", СистемнаяИнформация.ВерсияПриложения);
	СтруктураСистемнойИнформации.Вставить("ИдентификаторКлиента", Строка(СистемнаяИнформация.ИдентификаторКлиента));
	СтруктураСистемнойИнформации.Вставить("ИнформацияПрограммыПросмотра", СистемнаяИнформация.ИнформацияПрограммыПросмотра);
	СтруктураСистемнойИнформации.Вставить("ОперативнаяПамять", СистемнаяИнформация.ОперативнаяПамять);
	СтруктураСистемнойИнформации.Вставить("Процессор", СистемнаяИнформация.Процессор);
	СтруктураСистемнойИнформации.Вставить("ТипПлатформы", Строка(СистемнаяИнформация.ТипПлатформы));
	
	СтруктураТелаЗапроса.Вставить("systemInformation", СтруктураСистемнойИнформации);
	СтруктураТелаЗапроса.Вставить("configurationInformationRu", ПолучитьИнформациюОКонфигурации());
	
	ТелоЗапросаJSON = ЗаписатьВСтрокуJSON(СтруктураТелаЗапроса);
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПолучитьАдресСервера(), 30, Истина);
	АдресРесурса = ПолучитьАдресРесурса("GetService");
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON);
	
	ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если ОтветСервера.КодСостояния = 200 Тогда
		
		// успешно
		ОтветСоответствие = ПрочитатьСтрокуJSON(ОтветСервера.ПолучитьТелоКакСтроку(), Истина);
		
		Если ОтветСоответствие.Получить("success") <> Неопределено 
			И ОтветСоответствие.Получить("success") Тогда    
			
			ДанныеСервиса = ОтветСоответствие.Получить("serviceResult");
			
			Если ДанныеСервиса <> Неопределено Тогда
				
				Если ДанныеСервиса.Получить("success") <> Неопределено
					И ДанныеСервиса.Получить("success") Тогда
					
					Результат.Вставить("Успешно", Истина);
					Результат.Вставить("ДанныеСервиса", ОтветСоответствие.Получить("serviceResult"));
					
				Иначе
					
					ТекстОшибки = ПолучитьТекстОшибкиИзОтветаСервиса(ДанныеСервиса);
					ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
					Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось подключиться к сервису %1. Ответ сервера: %2'"), НикСервиса, ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, ОтветСервера.ПолучитьТелоКакСтроку()));
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
					Результат.Вставить("ТекстОшибки", ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, "Ошибка подключения к сервису"));
					
				КонецЕсли;
				
			Иначе
				
				ТекстОшибки = ПолучитьТекстОшибкиИзОтветаСервера(ОтветСоответствие);
				ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось подключиться к сервису %1. Ответ сервера: %2'"), НикСервиса, ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, ОтветСервера.ПолучитьТелоКакСтроку()));
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
				Результат.Вставить("ТекстОшибки", ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, "Ошибка подключения к сервису"));
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ПолучитьТекстОшибкиИзОтветаСервера(ОтветСоответствие);
			ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось подключиться к сервису %1. Ответ сервера: %2'"), НикСервиса, ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, ОтветСервера.ПолучитьТелоКакСтроку()));
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
			Результат.Вставить("ТекстОшибки", ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, "Ошибка подключения к сервису"));
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = ПолучитьТекстОшибкиИзОтветаСервера(ОтветСоответствие);
		ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подключение к сервису %1'"), НикСервиса);
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось подключиться к сервису %1. Ответ сервера: %2'"), НикСервиса, ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, ОтветСервера.ПолучитьТелоКакСтроку()));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
		Результат.Вставить("ТекстОшибки", ?(Не ПустаяСтрока(ТекстОшибки), ТекстОшибки, "Ошибка подключения к сервису"));
		
	КонецЕсли;
	
КонецПроцедуры // ПодключитьсяКСервису()

Процедура ПолучитьИнформациюОПодпискеПользователяПоЛогину(ЛогинПользователяПорталаИТС, Результат = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("ТипПодписки", "");
	Результат.Вставить("НачалоПериода", Дата(1, 1, 1));
	Результат.Вставить("КонецПериода", Дата(1, 1, 1));
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("login", ЛогинПользователяПорталаИТС);
	
	ТелоЗапросаJSON = ЗаписатьВСтрокуJSON(СтруктураТелаЗапроса);
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПолучитьАдресСервера(), 30, Истина);
	АдресРесурса = ПолучитьАдресРесурса("GetInfoByLogin");
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON);
	
	ОтветСервера = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если ОтветСервера.КодСостояния = 200 Тогда
		
		// успешно
		ОтветСоответствие = ПрочитатьСтрокуJSON(ОтветСервера.ПолучитьТелоКакСтроку(), Истина);
		
		Если ОтветСоответствие.Получить("success") <> Неопределено 
			И ОтветСоответствие.Получить("success") Тогда    
			
			userSubscriptionsInfoArray = ОтветСоответствие.Получить("userSubscriptionsInfoArray");
			
			Если userSubscriptionsInfoArray <> Неопределено Тогда
				
				userSubscriptionsInfo = userSubscriptionsInfoArray[0];
				subscriptionInfoList = userSubscriptionsInfo.Получить("subscriptionInfoList");
				
				Если subscriptionInfoList <> Неопределено 
					И ТипЗнч(subscriptionInfoList) = Тип("Массив") 
					И subscriptionInfoList.Количество() > 0 Тогда
					
					lastSubscriptionDescription = "";
					lastSubscriptionStartDate = "";
					lastSubscriptionEndDate = "";
					
					ИндексПоследнейПодписки = 0;
					
					Если subscriptionInfoList.Количество() > 1 Тогда
						
						ДатаПоследнейПодписки = Дата(1, 1, 1);
						
						Для Индекс = 0 По subscriptionInfoList.Количество() - 1 Цикл 
							
							subscriptionInfo = subscriptionInfoList[Индекс];
							endDate = subscriptionInfo.Получить("endDate"); 
							МассивРазрядовДатыОкончания = СтрРазделить(Лев(endDate, 10), "-");
							Если МассивРазрядовДатыОкончания.Количество() = 3 Тогда
								ДатаОкончания = Дата(МассивРазрядовДатыОкончания[0], МассивРазрядовДатыОкончания[1], МассивРазрядовДатыОкончания[2]);
							КонецЕсли;
							
							Если ДатаОкончания > ДатаПоследнейПодписки Тогда
								ДатаПоследнейПодписки = ДатаОкончания;
								ИндексПоследнейПодписки = Индекс;
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
					lastSubscriptionInfo = subscriptionInfoList[ИндексПоследнейПодписки];
					
					// Тип подписки
					subscriptionTypeInfo = lastSubscriptionInfo.Получить("subscriptionTypeInfo");
					lastSubscriptionDescription = subscriptionTypeInfo.Получить("description");
					
					// Период подписки
					lastSubscriptionStartDate = lastSubscriptionInfo.Получить("startDate");
					МассивРазрядовДатыОкончания = СтрРазделить(Лев(lastSubscriptionStartDate, 10), "-");
					Если МассивРазрядовДатыОкончания.Количество() = 3 Тогда
						НачалоПериода = Дата(МассивРазрядовДатыОкончания[0], МассивРазрядовДатыОкончания[1], МассивРазрядовДатыОкончания[2]);
					КонецЕсли;
					
					lastSubscriptionEndDate = lastSubscriptionInfo.Получить("endDate");
					МассивРазрядовДатыОкончания = СтрРазделить(Лев(lastSubscriptionEndDate, 10), "-");
					Если МассивРазрядовДатыОкончания.Количество() = 3 Тогда
						КонецПериода = Дата(МассивРазрядовДатыОкончания[0], МассивРазрядовДатыОкончания[1], МассивРазрядовДатыОкончания[2]);
					КонецЕсли;
					
					Результат.Вставить("ТипПодписки", lastSubscriptionDescription);
					Результат.Вставить("НачалоПериода", НачалоПериода);
					Результат.Вставить("КонецПериода", КонецПериода);
					
				Иначе
					
					description = userSubscriptionsInfo.Получить("description");
					Результат.Вставить("ТипПодписки", description);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПолучитьИнформациюОПодпискеПользователяПоЛогину()

Функция ПолучитьКоличествоДнейДоКонцаПериодаПодписки() Экспорт
	
	ДнейДоКонцаПериодаПодписки = -1;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификацииПользователяИнтернетПоддержки = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	
	ИнформацияОПодпискеПользователя = Новый Соответствие;
	ИнтернетПоддержкаПользователейУзбекистанВызовСервера.ПолучитьИнформациюОПодпискеПользователяПоЛогину(ДанныеАутентификацииПользователяИнтернетПоддержки.Логин, ИнформацияОПодпискеПользователя);
	
	Если ИнформацияОПодпискеПользователя.Получить("КонецПериода") <> Дата(1, 1, 1) Тогда
		
		ДнейДоКонцаПериодаПодписки = (ИнформацияОПодпискеПользователя.Получить("КонецПериода") - ТекущаяДата()) / 86400;
		
	КонецЕсли;
	
	Возврат Окр(ДнейДоКонцаПериодаПодписки);
	
КонецФункции

// Результат выполнения процедуры:
// ИнформацияОКонфигурации
//	Тип: Структура
//	Ключ	|	Значение
//	Успешно |   Истина/Ложь
//	ДанныеСервиса |  <ДанныеСервиса>
//  ТекстОшибки | <Текст сообщения для пользователя, заполняется если Успешно = Ложь>
Функция ПолучитьИнформациюОКонфигурации() Экспорт
	
	ИнформацияОКонфигурации = Новый Структура();
	ИнформацияОКонфигурации.Вставить("АвторскиеПрава",               Метаданные.АвторскиеПрава);
	ИнформацияОКонфигурации.Вставить("АдресИнформацииОКонфигурации", Метаданные.АдресИнформацииОКонфигурации);
	ИнформацияОКонфигурации.Вставить("АдресИнформацииОПоставщике",   Метаданные.АдресИнформацииОПоставщике);
	ИнформацияОКонфигурации.Вставить("АдресКаталогаОбновлений",      Метаданные.АдресКаталогаОбновлений);
	ИнформацияОКонфигурации.Вставить("Версия",                       Метаданные.Версия);
	ИнформацияОКонфигурации.Вставить("Имя",                          Метаданные.Имя);
	ИнформацияОКонфигурации.Вставить("КраткаяИнформация",            Метаданные.КраткаяИнформация);
	ИнформацияОКонфигурации.Вставить("ПодробнаяИнформация",          Метаданные.ПодробнаяИнформация);
	ИнформацияОКонфигурации.Вставить("Поставщик",                    Метаданные.Поставщик);
	ИнформацияОКонфигурации.Вставить("Синоним",                      Метаданные.Синоним);
	
	Возврат ИнформацияОКонфигурации;	
	
КонецФункции // ПолучитьИнформациюОКонфигурации()

// Определяет ник сервиса по переданному наименованию
Функция ПолучитьНикСервисаПоНаименованию(НаименованиеСервиса) Экспорт
	
	Если ВРЕГ(НаименованиеСервиса) = "ЗАГРУЗКАИНДЕКСОВПЕРЕОЦЕНКИОС" Тогда
		
		Возврат "uz-revaluation-indices";
		
	ИначеЕсли ВРЕГ(НаименованиеСервиса) = "ЗАГРУЗКАДАННЫХКОНТРАГЕНТАПОИНН" Тогда
		
		Возврат "uz-counteragent-by-tin";
		
	ИначеЕсли ВРЕГ(НаименованиеСервиса) = "ЗАГРУЗКАКЛАССИФИКАТОРАБАНКОВ" Тогда
		
		Возврат "uz-bank-classifier";
		
	ИначеЕсли ВРЕГ(НаименованиеСервиса) = "ЗАГРУЗКАКУРСОВВАЛЮТ" Тогда
		
		Возврат "uz-currency-rates";
		
	ИначеЕсли ВРЕГ(НаименованиеСервиса) = "ИСПОЛЬЗОВАНИЕЭДО" Тогда
		
		Возврат "uz-edo-access";
		
	ИначеЕсли ВРЕГ(НаименованиеСервиса) = "ВЫГРУЗКАРЕГЛАМЕНТИРОВАННОЙОТЧЕТНОСТИНАСАЙТГНК" Тогда
		
		Возврат "uz-reporting";
		
	КонецЕсли;	
	
	
	Возврат "";	
	
КонецФункции // ПолучитьНикСервисаПоНаименованию()

// Обработчик обновления ИБ
// Записывает логин и пароль пользователя Менеджера сервиса для работы в модели сервиса
Функция ЗаписатьОбновитьДанныеАутентификацииВБезопасноеХранилищеSaaS() Экспорт
	
	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Константа.ВнутреннийАдресМенеджераСервиса");
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("ДоступКСервисамВSaaS", "ServiceUser", "ИмяПользователя");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("ДоступКСервисамВSaaS", "1LJ?gENYJ*ZU", "Пароль");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции // ЗаписатьОбновитьДанныеАутентификацииВБезопасноеХранилищеSaaS()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Инициализирует http-соединение по переданным параметрам
Функция ПолучитьHTTPСоединение(URL, Таймаут, ЗащищенноеСоединение = Истина)
	
	Если ЗащищенноеСоединение Тогда
		HTTPСоединение = Новый HTTPСоединение(URL, , , , , Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(URL, , , , , Таймаут);
	КонецЕсли;
	
	Возврат HTTPСоединение;
	
КонецФункции // ПолучитьHTTPСоединение()

// Возращвет адрес сервера поставщика сервисов
Функция ПолучитьАдресСервера()
	
	Возврат "lc.venkon.uz";	
	
КонецФункции // ПолучитьАдресСервера()

// Возращает адрес запрашиваемого ресурса на сервере поставщика сервисов
Функция ПолучитьАдресРесурса(Ресурс)
	
	Если ВРЕГ(Ресурс) = "GETSERVICE" Тогда
		
		Возврат "services/hs/rest/v1.0/public/getService";
		
	ИначеЕсли ВРЕГ(Ресурс) = "GETINFOBYLOGIN" Тогда
		
		Возврат "services/hs/rest/v1.0/public/getInfoByLogin";
		
	КонецЕсли;
	
КонецФункции // ПолучитьАдресРесурса()

// Получает текст ошибки из стандартного ответа сервера поставщика сервисов
Функция ПолучитьТекстОшибкиИзОтветаСервера(ОтветСервера)
	
	ТекстОшибки = "";
	
	Если ОтветСервера.Получить("error") <> Неопределено Тогда
		
		КлассОшибки = ОтветСервера.Получить("error");
		
		Если КлассОшибки.Получить("errorMessageRu") <> Неопределено Тогда
			
			ТекстОшибки = КлассОшибки.Получить("errorMessageRu");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции // ПолучитьТекстОшибкиИзОтветаСервера()

// Получает текст ошибки из стандартного ответа сервиса
Функция ПолучитьТекстОшибкиИзОтветаСервиса(ОтветСервиса)
	
	ТекстОшибки = "";
	
	Если ОтветСервиса.Получить("serviceError") <> Неопределено Тогда
		
		КлассОшибки = ОтветСервиса.Получить("serviceError");
		
		Если КлассОшибки.Получить("serviceErrorMessageRu") <> Неопределено Тогда
			
			ТекстОшибки = КлассОшибки.Получить("serviceErrorMessageRu");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции // ПолучитьТекстОшибкиИзОтветаСервиса()


Функция ЭтоSaaS() Экспорт
	
	Возврат ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
КонецФункции

Функция ЭтоАвтономноеРабочееМесто() Экспорт
	
	Возврат ОбменДаннымиСервер.ЭтоАвтономноеРабочееМесто();
	
КонецФункции

#Область ФункцииДляРаботыСJSON

Функция ЗаписатьВСтрокуJSON(КонвертируемыеДанные) Экспорт
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "", Истина, ЭкранированиеСимволовJSON.СимволыВнеASCII);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, КонвертируемыеДанные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция ЗаписатьВСтрокуJSONБезПараметровЗаписи(КонвертируемыеДанные) Экспорт
	
	//ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, КонвертируемыеДанные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция ПрочитатьСтрокуJSON(СтрокаJSON, ВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	Если ИменаСвойствСоЗначениямиДата = Неопределено Тогда
		ИменаСвойствСоЗначениямиДата = "";
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ВСоответствие, ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.ISO);
	
КонецФункции

#КонецОбласти

#КонецОбласти
