
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТипЗапроса = Параметры.ТипЗапроса;
	Если ТипЗапроса = "Партии" Тогда
		Заголовок                      = НСтр("ru = 'Загрузка номеров партий из внешних файлов'");
		Элементы.НадписьСДИЗ.Видимость = Ложь;
	Иначе
		Заголовок                        = НСтр("ru = 'Загрузка номеров СДИЗ из внешних файлов'");
		Элементы.НадписьПартии.Видимость = Ложь;
	КонецЕсли;
	ИнициализироватьТабличныйДокумент();
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Закрыть(Идентификаторы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()

	// Пустой обработчик
	
КонецПроцедуры

&НаСервере
Функция Идентификаторы()

	// Пустой обработчик
	
КонецФункции

#КонецОбласти
