#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РаспределениеЗапасов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.0.0.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d05af858-ca38-4f1b-a9fc-ae8050472af0");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспределениеЗапасов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Синхронизирует записи регистра сведений ""Распределение запасов"" с остатками в регистре накопления ""Запасы и потребности""'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспределениеЗапасов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.РаспределениеЗапасов";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.РаспределениеЗапасов");
	
	Текст =
		"ВЫБРАТЬ
		|	ОстаткиПоДвижениям.Номенклатура КАК Номенклатура,
		|	ОстаткиПоДвижениям.Характеристика КАК Характеристика,
		|	ОстаткиПоДвижениям.Склад КАК Склад,
		|	ОстаткиПоДвижениям.Назначение КАК Назначение,
		|	ОстаткиПоДвижениям.Заказ КАК Заказ,
		|	ОстаткиПоДвижениям.ДатаСобытия КАК ДатаСобытия,
		|	ОстаткиПоДвижениям.ВНаличииОстаток КАК ВНаличии,
		|	ОстаткиПоДвижениям.ПоступитОстаток КАК Поступит,
		|	ОстаткиПоДвижениям.ЗаказаноОстаток КАК Заказано,
		|	ОстаткиПоДвижениям.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладе,
		|	ОстаткиПоДвижениям.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступления,
		|	ОстаткиПоДвижениям.ОтложитьРезервированиеОстаток КАК ОтложитьРезервирование,
		|	ОстаткиПоДвижениям.КОбеспечениюОстаток КАК КОбеспечению,
		|	ОстаткиПоДвижениям.НеОбеспечиватьОстаток КАК НеОбеспечивать
		|ПОМЕСТИТЬ ОстаткиПоДвижениям
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ОстаткиПоДвижениям
		|ГДЕ
		|	ОстаткиПоДвижениям.ВНаличииОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.ПоступитОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.ЗаказаноОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.РезервироватьНаСкладеОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.РезервироватьПоМереПоступленияОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.ОтложитьРезервированиеОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.КОбеспечениюОстаток <> 0
		|		ИЛИ ОстаткиПоДвижениям.НеОбеспечиватьОстаток <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Заказ, ДатаСобытия
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПоДвижениям.Номенклатура КАК Номенклатура,
		|	ОстаткиПоДвижениям.Характеристика КАК Характеристика,
		|	ОстаткиПоДвижениям.Склад КАК Склад,
		|	СУММА(ОстаткиПоДвижениям.ВНаличии) КАК ВНаличии
		|ПОМЕСТИТЬ ВНаличииПоДвижениям
		|ИЗ
		|	ОстаткиПоДвижениям КАК ОстаткиПоДвижениям
		|ГДЕ
		|	ОстаткиПоДвижениям.Заказ = НЕОПРЕДЕЛЕНО
		|	И ОстаткиПоДвижениям.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОстаткиПоДвижениям.ВНаличии <> 0
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоДвижениям.Номенклатура,
		|	ОстаткиПоДвижениям.Характеристика,
		|	ОстаткиПоДвижениям.Склад
		|ИМЕЮЩИЕ
		|	СУММА(ОстаткиПоДвижениям.ВНаличии) <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	Набор.Назначение КАК Назначение
		|ИЗ(
		|	ВЫБРАТЬ
		|		Движения.Номенклатура КАК Номенклатура,
		|		Движения.Характеристика КАК Характеристика,
		|		Движения.Склад КАК Склад,
		|		Движения.Назначение КАК Назначение
		|	ИЗ
		|		ОстаткиПоДвижениям КАК Движения
		|		
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВНаличииПоДвижениям КАК ВНаличииПоДвижениям
		|			ПО ВНаличииПоДвижениям.Номенклатура = Движения.Номенклатура
		|			 И ВНаличииПоДвижениям.Характеристика = Движения.Характеристика
		|			 И ВНаличииПоДвижениям.Склад = Движения.Склад
		|			 И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = Движения.Назначение
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|			ПО Сведения.Номенклатура = Движения.Номенклатура
		|			 И Сведения.Характеристика = Движения.Характеристика
		|			 И Сведения.Склад = Движения.Склад
		|			 И Сведения.Назначение = Движения.Назначение
		|			 И (
						// Расхождения в наличии.
		|				ЕСТЬNULL(ВНаличииПоДвижениям.ВНаличии, 0) <> 0
		|						И Движения.Заказ = НЕОПРЕДЕЛЕНО
		|						И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|						И Сведения.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
		|						И Сведения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
		|						И Сведения.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.ВНаличии = ЕСТЬNULL(ВНаличииПоДвижениям.ВНаличии, 0)
						// Расхождения запаса на складе.
		|					ИЛИ Движения.ВНаличии <> 0
		|						И Движения.Заказ = НЕОПРЕДЕЛЕНО
		|						И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|						И Сведения.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
		|						И Сведения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
		|						И Сведения.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Запас = Движения.ВНаличии
							// Расхождения ожидаемых поступлений.
		|					ИЛИ Движения.Поступит <> 0
		|						И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|						И Движения.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
		|						И Сведения.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
		|						И Сведения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.ЗаказНаПоступление = Движения.Заказ
		|						И Сведения.ДатаПоступления = Движения.ДатаСобытия
		|						И Сведения.Запас = Движения.Поступит
							// Расхождения запланированных поступлений.
		|					ИЛИ Движения.Заказано <> 0 И Движения.Заказано - Движения.Поступит > 0
		|						И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|						И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное)
		|						И Сведения.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
		|						И Сведения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.ЗаказНаПоступление = Движения.Заказ
		|						И Сведения.ДатаПоступления = Движения.ДатаСобытия
		|						И Сведения.Запас = Движения.Заказано - Движения.Поступит
							// Расхождения ожидаемых отгрузок.
		|					ИЛИ (Движения.РезервироватьНаСкладе <> 0
		|							ИЛИ Движения.РезервироватьПоМереПоступления <> 0
		|							ИЛИ Движения.ОтложитьРезервирование <> 0
		|							ИЛИ Движения.КОбеспечению <> 0
		|							ИЛИ Движения.НеОбеспечивать <> 0)
		|						И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|						И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|						И Сведения.ЗаказНаОтгрузку = Движения.Заказ
		|						И Сведения.ЖелаемаяДатаОтгрузки = Движения.ДатаСобытия
		|						И Сведения.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
		|						И Сведения.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		|						И Сведения.Резервировать = Движения.РезервироватьНаСкладе
		|						И Сведения.РезервироватьПоМереПоступления = Движения.РезервироватьПоМереПоступления
		|						И Сведения.ОтложитьРезервирование = Движения.ОтложитьРезервирование
		|						И Сведения.КОбеспечениюБезРезерва = Движения.КОбеспечению
		|						И Сведения.НеОбеспечивать = Движения.НеОбеспечивать)
		|	ГДЕ
		|		(ЕСТЬNULL(ВНаличииПоДвижениям.ВНаличии, 0) <> 0
		|					И Движения.Заказ = НЕОПРЕДЕЛЕНО
		|					И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Движения.ВНаличии <> 0
		|					И Движения.Заказ = НЕОПРЕДЕЛЕНО
		|					И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Движения.Поступит <> 0
		|					И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|					И Движения.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ Движения.Заказано <> 0 И Движения.Заказано - Движения.Поступит > 0
		|					И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|					И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ (Движения.РезервироватьНаСкладе <> 0
		|						ИЛИ Движения.РезервироватьПоМереПоступления <> 0
		|						ИЛИ Движения.ОтложитьРезервирование <> 0
		|						ИЛИ Движения.КОбеспечению <> 0
		|						ИЛИ Движения.НеОбеспечивать <> 0)
		|					И Движения.Заказ <> НЕОПРЕДЕЛЕНО)
		|				И Сведения.Номенклатура ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Сведения.Номенклатура КАК Номенклатура,
		|		Сведения.Характеристика КАК Характеристика,
		|		Сведения.Склад КАК Склад,
		|		Сведения.Назначение КАК Назначение
		|	ИЗ
		|		РегистрСведений.РаспределениеЗапасов КАК Сведения
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВНаличииПоДвижениям КАК ВНаличииПоДвижениям
		|			ПО ВНаличииПоДвижениям.Номенклатура = Сведения.Номенклатура
		|			 И ВНаличииПоДвижениям.Характеристика = Сведения.Характеристика
		|			 И ВНаличииПоДвижениям.Склад = Сведения.Склад
		|			 И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = Сведения.Назначение
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоДвижениям КАК Движения
		|			ПО Движения.Номенклатура = Сведения.Номенклатура
		|			 И Движения.Характеристика = Сведения.Характеристика
		|			 И Движения.Склад = Сведения.Склад
		|			 И Движения.Назначение = Сведения.Назначение
		|			 И (
						// Расхождения запаса на складе.
		|					Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|						И Сведения.Запас <> 0
		|						И Движения.Заказ = НЕОПРЕДЕЛЕНО
		|						И Движения.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|						И Движения.ВНаличии = Сведения.Запас
							// Расхождения ожидаемых поступлений.
		|					ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
		|						И Сведения.Запас <> 0
		|						И Движения.Заказ = Сведения.ЗаказНаПоступление
		|						И Движения.ДатаСобытия = Сведения.ДатаПоступления
		|						И Движения.Поступит = Сведения.Запас
							// Расхождения запланированных поступлений.
		|					ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное)
		|						И Сведения.Запас <> 0
		|						И Движения.Заказ = Сведения.ЗаказНаПоступление
		|						И Движения.ДатаСобытия = Сведения.ДатаПоступления
		|						И Движения.Заказано <> 0 И Движения.Заказано - Движения.Поступит = Сведения.Запас
							// Расхождения ожидаемых отгрузок.
		|					ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|						И Движения.Заказ = Сведения.ЗаказНаОтгрузку
		|						И Движения.ДатаСобытия = Сведения.ЖелаемаяДатаОтгрузки
		|						И Движения.РезервироватьНаСкладе = Сведения.Резервировать
		|						И Движения.РезервироватьПоМереПоступления = Сведения.РезервироватьПоМереПоступления
		|						И Движения.ОтложитьРезервирование = Сведения.ОтложитьРезервирование
		|						И Движения.КОбеспечению = Сведения.КОбеспечениюБезРезерва
		|						И Движения.НеОбеспечивать = Сведения.НеОбеспечивать)
		|	ГДЕ
		|		(Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|					И Сведения.Запас <> 0
		|				ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
		|					И Сведения.Запас <> 0
		|				ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное)
		|					И Сведения.Запас <> 0
		|				ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка))
		|			И Движения.Номенклатура ЕСТЬ NULL
		|		ИЛИ Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|				И Сведения.ВНаличии <> 0
		|				И ВНаличииПоДвижениям.Номенклатура ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВНаличииПоДвижениям.Номенклатура КАК Номенклатура,
		|		ВНаличииПоДвижениям.Характеристика КАК Характеристика,
		|		ВНаличииПоДвижениям.Склад КАК Склад,
		|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
		|	ИЗ
		|		ВНаличииПоДвижениям КАК ВНаличииПоДвижениям
		|		
		|			ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоДвижениям КАК Движения
		|			ПО Движения.Номенклатура = ВНаличииПоДвижениям.Номенклатура
		|			 И Движения.Характеристика = ВНаличииПоДвижениям.Характеристика
		|			 И Движения.Склад = ВНаличииПоДвижениям.Склад
		|			 И Движения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|			ПО Сведения.Номенклатура = ВНаличииПоДвижениям.Номенклатура
		|			 И Сведения.Характеристика = ВНаличииПоДвижениям.Характеристика
		|			 И Сведения.Склад = ВНаличииПоДвижениям.Склад
		|			 И Сведения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
					// Расхождения в наличии.
		|			 И (Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|					И Сведения.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
		|					И Сведения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|					И Сведения.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО
		|					И Сведения.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		|					И Сведения.ВНаличии = ВНаличииПоДвижениям.ВНаличии)
		|	ГДЕ
		|		Движения.Номенклатура ЕСТЬ NULL
		|			И ВНаличииПоДвижениям.ВНаличии <> 0
		|			И Сведения.Номенклатура ЕСТЬ NULL) КАК Набор";
	
	Запрос = Новый Запрос(Текст);
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.РаспределениеЗапасов";
	
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
		
		Набор = Неопределено;
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗапасыИПотребности");
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", Строка.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Характеристика", Строка.Характеристика);
			ЭлементБлокировки.УстановитьЗначение("Склад", Строка.Склад);
			Если ЗначениеЗаполнено(Строка.Назначение) Тогда
				ЭлементБлокировки.УстановитьЗначение("Назначение", Строка.Назначение);
			КонецЕсли;
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РаспределениеЗапасов");
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", Строка.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Характеристика", Строка.Характеристика);
			ЭлементБлокировки.УстановитьЗначение("Склад", Строка.Склад);
			ЭлементБлокировки.УстановитьЗначение("Назначение", Строка.Назначение);
			
			Блокировка.Заблокировать();
			
			Набор = РаспределениеЗапасов.ОбновлениеИБПоТовару(Строка);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Если Набор = Неопределено Тогда
				Набор = СоздатьНаборЗаписей();
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
				Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
				Набор.Отбор.Склад.Установить(Строка.Склад);
				Набор.Отбор.Назначение.Установить(Строка.Назначение);
			КонецЕсли;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
		КонецПопытки;
		
	КонецЦикла;
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
