///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ЭкспортныеПроцедурыИФункции

Функция ПолучитьПутьККомпонентеКриптографии() Экспорт
	//Возврат Константы.ПутьККомпонентеКриптографии.Получить();
	Возврат "c:\wefo\eimzoClient.jar";
КонецФункции

Функция ПолучитьКаталогКомпонентыКриптографии() Экспорт
	
	Возврат Константы.КаталогУстановкиКомпонентыКриптографии.Получить();
	
КонецФункции

Процедура ЗаписатьПутьККомпонентеКриптографии(Путь) Экспорт
	
	Константы.ПутьККомпонентеКриптографии.Установить(Путь);
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанныеКомпонентыКриптографии() Экспорт 
	
	ДДКомпонентыКриптографии = ПолучитьОбщийМакет("uzbled_КомпонентаКриптографии");
	
	Возврат ПоместитьВоВременноеХранилище(ДДКомпонентыКриптографии);
	
КонецФункции

Функция ПолучитьТекстИзФайла(Адрес, Расширение = "") Экспорт
	
	Если ПустаяСтрока(Расширение) Тогда
		Расширение = ".txt";
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(ИмяФайла);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	
	ТекстИзФайла = ТекстовыйДокумент.ПолучитьТекст();
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат ТекстИзФайла;
	
КонецФункции

Функция ЗаписатьСтрокиВФайл(МассивСтрок, Расширение = "", Кодировка = Неопределено, ЭкранироватьСимволы = Ложь) Экспорт
	
	Если ПустаяСтрока(Расширение) Тогда
		Расширение = ".txt";
	КонецЕсли;
	
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;		
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Для каждого Стр Из МассивСтрок Цикл
		
		СтрокаНаЗапись = Стр;
		
		Если ЭкранироватьСимволы Тогда
			
			СоответствиеДляЭкранирования = Новый Соответствие;
			СоответствиеДляЭкранирования.Вставить("string", СтрокаНаЗапись);
			СтрокаJSON = ЗаписатьВСтрокуJSON(СоответствиеДляЭкранирования);
			СтрокаНаЗапись = СтрЗаменить(СтрокаJSON, "{""string"":""", "");
			СтрокаНаЗапись = СтрЗаменить(СтрокаНаЗапись, """}", "");
			
		КонецЕсли;
		
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаНаЗапись);
		
	КонецЦикла;
	
	ТекстовыйДокумент.Вывод = ИспользованиеВывода.Разрешить;
	ТекстовыйДокумент.Записать(ИмяФайла, Кодировка); 
	ДД = Новый ДвоичныеДанные(ИмяФайла);
	Адрес = ПоместитьВоВременноеХранилище(ДД);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Адрес;
	
КонецФункции

Функция ЗаписатьВСтрокуJSON(КонвертируемыеДанные) Экспорт
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, Символы.Таб, Истина, ЭкранированиеСимволовJSON.СимволыВнеASCII);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, КонвертируемыеДанные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции 

Функция ПрочитатьСтрокуJSON(СтрокаJSON, ВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	Попытка
		
		Если ПустаяСтрока(СтрокаJSON) Тогда
			Возврат ?(ВСоответствие, Новый Соответствие, Новый Структура); 
		КонецЕсли;
		
		Если ИменаСвойствСоЗначениямиДата = Неопределено Тогда
			ИменаСвойствСоЗначениямиДата = "";
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		Возврат ПрочитатьJSON(ЧтениеJSON, ВСоответствие, ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.ISO);
		
	Исключение
		
	//	ЗаписьЖурналаРегистрации(НСтр("ru='Ошибка чтения JSON'", uzbled_ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		//УровеньЖурналаРегистрации.Ошибка, , , СтрокаJSON);
		
		Возврат ?(ВСоответствие, Новый Соответствие, Новый Структура); 
		
	КонецПопытки;
	
КонецФункции

Процедура СохранитьНастройки(serialnumber, keyId) Экспорт
	
	КлючНастроек = "keyId_" + serialnumber;
	ХранилищеОбщихНастроек.Сохранить(КлючНастроек, КлючНастроек, keyId);	
	
КонецПроцедуры

Функция ПолучитьНастройки(serialnumber) Экспорт
	
	КлючНастроек = "keyId_" + serialnumber;
	ЗначениеНастроек = ХранилищеОбщихНастроек.Загрузить(КлючНастроек, КлючНастроек);
	keyId = ?(ЗначениеНастроек <> Неопределено, ЗначениеНастроек, "");	
	
	Возврат keyId;
	
КонецФункции

#КонецОбласти