
#Область ПрограммныйИнтерфейс

// Устанавливает значение функциональной опции ИспользоватьСтатусыЗаказовНаВнутреннееПотребление.

Процедура УстановитьИспользованиеСтатусовВЗаказахНаВнутреннееПотребление() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьСтатусыЗаказовНаВнутреннееПотребление = Константы.НеЗакрыватьЗаказыНаВнутреннееПотреблениеБезПолнойОтгрузки.Получить() Или Константы.ИспользоватьСогласованиеЗаказовНаВнутреннееПотребление.Получить();
	Константы.ИспользоватьСтатусыЗаказовНаВнутреннееПотребление.Установить(ИспользоватьСтатусыЗаказовНаВнутреннееПотребление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
