
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПрогнозПродаж.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрогнозПродажТовары.Ссылка.Организация КАК Организация,
		|	ПрогнозПродажТовары.Ссылка КАК Ссылка,
		|	ПрогнозПродажТовары.НомерСтроки КАК НомерСтроки,
		|	ПрогнозПродажТовары.Номенклатура КАК Номенклатура,
		|	НАЧАЛОПЕРИОДА(ПрогнозПродажТовары.Дата, ДЕНЬ) КАК Период,
		|	ПрогнозПродажТовары.Продажи КАК Продажи,
		|	ПрогнозПродажТовары.ПродажиПрогноз КАК ПродажиПрогноз,
		|	ПрогнозПродажТовары.ПродажиНижняяГраница КАК ПродажиНижняяГраница,
		|	ПрогнозПродажТовары.ПродажиВерхняяГраница КАК ПродажиВерхняяГраница
		|ИЗ
		|	Документ.ПрогнозПродаж.Товары КАК ПрогнозПродажТовары
		|ГДЕ
		|	ПрогнозПродажТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Проводка = Движения.ПрогнозПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры
