///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ЭкспортныеПроцедурыИФункции

#Область ПроверкаУстановкиКомпоненты

#КонецОбласти

#Область УстановкаКомпоненты

// Процедура запускает процесс установки файла компоненты криптографии
// Вызывается асинхронно
// Параметры:
// 		ОписаниеОповещения - Описание оповещения вызова процедуры по завершению установки
// 		ДопПараметры - дополнительные параметры асинхронного вызова процедуры (не используется)
Процедура УстановкаКомпонентаКриптографииНачало(ОписаниеОповещения, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		КаталогКомпонентыКриптографии = uzbled_EImzoСлужебный.ПолучитьКаталогКомпонентыКриптографии();
		
		Если Не ПустаяСтрока(КаталогКомпонентыКриптографии) Тогда
			ПутьККомпонентеКриптографии = КаталогКомпонентыКриптографии + "eimzoClient.jar";
		Иначе
			ПутьККомпонентеКриптографии = ПолучитьИмяВременногоФайла(".jar");
		КонецЕсли;
		
		ДопПараметры_УстановкаКомпонентаКриптографииЗавершение = Новый Структура;
		ДопПараметры_УстановкаКомпонентаКриптографииЗавершение.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ДопПараметры_УстановкаКомпонентаКриптографииЗавершение.Вставить("ПутьККомпонентеКриптографии", ПутьККомпонентеКриптографии);
		
		Оповещение = Новый ОписаниеОповещения("УстановкаКомпонентаКриптографииЗавершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_УстановкаКомпонентаКриптографииЗавершение);
		
		АдресКомпонентыКриптографии = uzbled_EImzoСлужебный.ПолучитьДвоичныеДанныеКомпонентыКриптографии();
		ДДКомпонентыКриптографии = ПолучитьИзВременногоХранилища(АдресКомпонентыКриптографии);
		ДДКомпонентыКриптографии.НачатьЗапись(Оповещение, ПутьККомпонентеКриптографии);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура записывает путь к компоненту в соответствующую константу
// Вызывается асинхронно
// Параметры:
// 		ДопПараметры - дополнительные параметры асинхронного вызова процедуры, структура
//					ключ "ОписаниеОповещения" содержит описание оповещения процедуры (функции) куда возвращается результат
// ***
// Результат установки всегда Истина, т.к. асинхронный метод записи двоичных данных в файл
// не сообщает о результате записи
Процедура УстановкаКомпонентаКриптографииЗавершение(ДопПараметры) Экспорт

	#Если НЕ ВебКлиент Тогда
		
		uzbled_EImzoСлужебный.ЗаписатьПутьККомпонентеКриптографии(ДопПараметры["ПутьККомпонентеКриптографии"]);
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Истина);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ПолучитьВерсию

#КонецОбласти

#Область ПодключитьсяКВебСокету

// Процедура запускает процесс подключения к компоненте
// Успешное подключение означает: - установлена jre (jdk, jvm); - установлена компонента криптографии; - установление e-imzo
// Вызывается асинхронно
// Параметры:
// 		ОписаниеОповещения - Описание оповещения вызова процедуры по завершению подключения
// 		ДопПараметры - дополнительные параметры асинхронного вызова процедуры (не используется)
Процедура ПодключитьсяНачало(ОписаниеОповещения = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПутьКВыходномуФайлу = "";
		
		СтрокаЗапроса = ПолучитьСтрокуЗапроса("Подключиться", ПутьКВыходномуФайлу);
		
		ДопПараметры_ПодключитьсяПродолжение = Новый Структура;
		ДопПараметры_ПодключитьсяПродолжение.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ДопПараметры_ПодключитьсяПродолжение.Вставить("ПутьКВыходномуФайлу", ПутьКВыходномуФайлу);
		
		Оповещение_ПодключитьсяПродолжение = Новый ОписаниеОповещения("ПодключитьсяПродолжение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодключитьсяПродолжение);
		
		ДопПараметры_ВыполнитьКомандуСистемыНачало = Новый Структура;
		ДопПараметры_ВыполнитьКомандуСистемыНачало.Вставить("ОписаниеОповещения", Оповещение_ПодключитьсяПродолжение);
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьКомандуСистемыНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ВыполнитьКомандуСистемыНачало);
		
		ВыполнитьОбработкуОповещения(Оповещение, СтрокаЗапроса);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура продолжает процесс подключения к компоненте
// Происходит чтение файла, куда был записан результат подключения
// Вызывается асинхронно
// Параметры:
// 		Результат - признак отработки запроса к e-imzo
// 		ДопПараметры - дополнительные параметры асинхронного вызова [ПутьКВыходномуФайлу, ОписаниеОповещения]
Процедура ПодключитьсяПродолжение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		РезультатСтрока = "";
		
		Если Результат Тогда
			
			ПутьКВыходномуФайлу = ДопПараметры["ПутьКВыходномуФайлу"];
			
			Попытка
				ДД = Новый ДвоичныеДанные(ПутьКВыходномуФайлу);
				РезультатСтрока = uzbled_EImzoСлужебный.ПолучитьТекстИзФайла(ПоместитьВоВременноеХранилище(ДД), ".json");
			Исключение
			КонецПопытки;			
			
		КонецЕсли;
		
		ДопПараметры_ПодключитьсяЗавершение = Новый Структура;
		ДопПараметры_ПодключитьсяЗавершение.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
		
		Оповещение_ПодключитьсяЗавершение = Новый ОписаниеОповещения("ПодключитьсяЗавершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодключитьсяЗавершение);
		
		ВыполнитьОбработкуОповещения(Оповещение_ПодключитьсяЗавершение, РезультатСтрока);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура завершает процесс подключения к компоненте
// Происходит разбор результата подключения
// Вызывается асинхронно
// Параметры:
// 		Результат - результат выполнения запроса (Строка)
// 		ДопПараметры - дополнительные параметры асинхронного вызова [ОписаниеОповещения]
Процедура ПодключитьсяЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПодключениеУстановлено = Ложь;
		
		Если НЕ ПустаяСтрока(Результат) Тогда
			
			Попытка
				
				РезультатаСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Результат, Истина);
				
				Если РезультатаСоответствие.Получить("success") <> Неопределено
					И РезультатаСоответствие.Получить("success") Тогда
					
					ПодключениеУстановлено = Истина;
					
				Иначе
					
					ПодключениеУстановлено = Ложь;
					
				КонецЕсли;	
				
			Исключение
				
				ПодключениеУстановлено = Ложь;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если ДопПараметры["ОписаниеОповещения"] <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], ПодключениеУстановлено);
		КонецЕсли;
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеСпискаКлючей

// Процедура запускает процесс получения списка ключей доступный пользователю ОС
// Вызывается асинхронно
// Параметры:
// 		ОписаниеОповещения - Описание оповещения вызова процедуры по завершению процесса
// 		ДопПараметры - дополнительные параметры асинхронного вызова процедуры (не используется)
Процедура ПолучитьСписокКлючейНачало(ОписаниеОповещения, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПутьКВыходномуФайлу = "";
		
		СтрокаЗапроса = ПолучитьСтрокуЗапроса("ПолучитьСписокКлючей", ПутьКВыходномуФайлу);
		
		ДопПараметры_ПолучитьСписокКлючейПродолжение = Новый Структура;
		ДопПараметры_ПолучитьСписокКлючейПродолжение.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ДопПараметры_ПолучитьСписокКлючейПродолжение.Вставить("ПутьКВыходномуФайлу", ПутьКВыходномуФайлу);
		
		Оповещение_ПолучитьСписокКлючейПродолжение = Новый ОписаниеОповещения("ПолучитьСписокКлючейПродолжение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПолучитьСписокКлючейПродолжение);
		
		ДопПараметры_ВыполнитьКомандуСистемыНачало = Новый Структура;
		ДопПараметры_ВыполнитьКомандуСистемыНачало.Вставить("ОписаниеОповещения", Оповещение_ПолучитьСписокКлючейПродолжение);
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьКомандуСистемыНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ВыполнитьКомандуСистемыНачало);
		
		ВыполнитьОбработкуОповещения(Оповещение, СтрокаЗапроса);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Новый Массив);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура продолждает процесс получения списка ключей доступный пользователю ОС
// Вызывается асинхронно
// Параметры:
// 		Результат - признак отработки запроса к e-imzo
// 		ДопПараметры - дополнительные параметры асинхронного вызова [ОписаниеОповещения]
Процедура ПолучитьСписокКлючейПродолжение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		РезультатСтрока = "";
		
		Если Результат Тогда
			
			ПутьКВыходномуФайлу = ДопПараметры["ПутьКВыходномуФайлу"];
			
			РезультатСтрока = "";
			
			ДД = Новый ДвоичныеДанные(ПутьКВыходномуФайлу);
			
			РезультатСтрока = uzbled_EImzoСлужебный.ПолучитьТекстИзФайла(ПоместитьВоВременноеХранилище(ДД), ".json");
			
		КонецЕсли;
		
		ДопПараметры_ПолучитьСписокКлючейЗавершение = Новый Структура;
		ДопПараметры_ПолучитьСписокКлючейЗавершение.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
		
		Оповещение = Новый ОписаниеОповещения("ПолучитьСписокКлючейЗавершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПолучитьСписокКлючейЗавершение);
		
		ВыполнитьОбработкуОповещения(Оповещение, РезультатСтрока);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Новый Массив);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура завершает процесс получения списка ключей доступный пользователю ОС
// Происходит разбор результата подключения и создания массива ключей
// Вызывается асинхронно
// Параметры:
// 		Результат - результат выполнения запроса (Строка)
// 		ДопПараметры - дополнительные параметры асинхронного вызова [ОписаниеОповещения]
Процедура ПолучитьСписокКлючейЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		МассивКлючей = Новый Массив;
		
		Если НЕ ПустаяСтрока(Результат) Тогда
			
			РезультатСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Результат, Истина);
			
			Если РезультатСоответствие.Получить("success") <> Неопределено
				И РезультатСоответствие.Получить("success") Тогда
				
				СписокВыбора = Новый СписокЗначений;
				
				Certificates = РезультатСоответствие.Получить("certificates");
				Для каждого Certificate Из Certificates Цикл
					
					СоответствиеКлючей = Новый Соответствие;
					
					СоответствиеКлючей.Вставить("СтруктураКлюча", Новый Структура);
					СоответствиеКлючей.Вставить("ПараметрыКлюча", "");
					СоответствиеКлючей.Вставить("ПредставлениеКлюча", "");
					
					СоответствиеКлючей["ПараметрыКлюча"] = Certificate;   
					СоответствиеКлючей["СтруктураКлюча"] = uzbled_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруИзСоответствия(Certificate);
					СоответствиеКлючей["СтруктураКлюча"].Вставить("file_name", СоответствиеКлючей["СтруктураКлюча"].name);
					СписокКлючей = uzbled_ОбщегоНазначенияКлиентСервер.ПреобразоватьСписокВСписокЗначений(Certificate.Получить("alias"), ",");
					СоответствиеКлючей["СтруктураКлюча"] = uzbled_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруИзСпискаЗначений(СписокКлючей, СоответствиеКлючей["СтруктураКлюча"]); 
					СоответствиеКлючей["СтруктураКлюча"].Вставить("active", Истина);
					СоответствиеКлючей["СтруктураКлюча"].Вставить("plugin", "pfx");
					СоответствиеКлючей["ПредставлениеКлюча"] = ПолучитьПредставлениеКлюча(Certificate); //Certificate.Получить("alias"); 
					Если СоответствиеКлючей["СтруктураКлюча"].Свойство("validfrom") Тогда
						СоответствиеКлючей["СтруктураКлюча"].Вставить("validFromDate", ПолучитьДатуИзСтроки(СоответствиеКлючей["СтруктураКлюча"].validfrom, 2)); 
						СоответствиеКлючей["СтруктураКлюча"].Вставить("validToDate", ПолучитьДатуИзСтроки(СоответствиеКлючей["СтруктураКлюча"].validto, 2));
						Если СоответствиеКлючей["СтруктураКлюча"].validToDate < ТекущаяДата()  Тогда
							СоответствиеКлючей["СтруктураКлюча"].Вставить("active", Ложь);
						КонецЕсли;
					Иначе
						СоответствиеКлючей["СтруктураКлюча"].Вставить("active", Ложь);
					КонецЕсли;
					// Получаем ID ключа в 10 системе счисления
					Если СоответствиеКлючей["СтруктураКлюча"].active Тогда
						СоответствиеКлючей["СтруктураКлюча"].Вставить("id", ПеревестиЧислоИзШестнадцатиричногоВДесятичное(СоответствиеКлючей["СтруктураКлюча"].serialnumber));
					КонецЕсли;
					
					МассивКлючей.Добавить(СоответствиеКлючей);
					
				КонецЦикла;
				
			Иначе
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], МассивКлючей);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Новый Массив);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеКлючаОрганизации

Процедура ПолучениеКлючаОрганизацииНачало(ИНН, ДопПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПИНФЛ = ?(ДопПараметры.Свойство("ПИНФЛ"), ДопПараметры["ПИНФЛ"], "");
		
		//УчетнаяЗапись = Неопределено;
		//Если ДопПараметры.Свойство("УчетнаяЗапись", УчетнаяЗапись) И ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		//	ИНН = uzbled_ЭлектронныеДокументыВызовСервера.ПолучитьИННДляАвторизации(УчетнаяЗапись);
		//	ПИНФЛ = uzbled_ЭлектронныеДокументыВызовСервера.ПолучитьПИНФЛДляАвторизации(УчетнаяЗапись);
		//КонецЕсли;
		
		ДопПараметры_ПолучитьЭЦПЗавершение = Новый Структура;
		ДопПараметры_ПолучитьЭЦПЗавершение.Вставить("ИНН", ИНН);
		ДопПараметры_ПолучитьЭЦПЗавершение.Вставить("ПИНФЛ", ПИНФЛ);
		ДопПараметры_ПолучитьЭЦПЗавершение.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
		
		Оповещение_ПолучениеКлючаОрганизацииЗавершение = Новый ОписаниеОповещения("ПолучениеКлючаОрганизацииЗавершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПолучитьЭЦПЗавершение);
		Оповещение_ПолучитьСписокКлючейНачало = Новый ОписаниеОповещения("ПолучитьСписокКлючейНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"));
		ВыполнитьОбработкуОповещения(Оповещение_ПолучитьСписокКлючейНачало, Оповещение_ПолучениеКлючаОрганизацииЗавершение);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Новый Структура);
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПолучениеКлючаОрганизацииЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		Успешно = Ложь;
		МассивКлючей = Результат;
		ИНН = ДопПараметры["ИНН"];
		ПИНФЛ = ДопПараметры["ПИНФЛ"];
		СтруктураКлюча = Новый Структура;
		
		Для каждого СоответствиеКлюча Из МассивКлючей Цикл
			
			СтруктураКлюча = СоответствиеКлюча["СтруктураКлюча"];
			
			Если СтруктураКлюча["active"] Тогда
				
				alias = СтруктураКлюча["alias"];
				Если 	(ЗначениеЗаполнено(ПИНФЛ) И ПИНФЛ = ПолучитьПИНФЛИзAlias(alias))
					ИЛИ (ЗначениеЗаполнено(ИНН) И ИНН = ПолучитьИННИзAlias(alias)) Тогда
					
					Успешно = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], ?(Успешно, СтруктураКлюча, Новый Структура));
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Новый Структура);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ПодписатьCreatePKCS7

Процедура ПодписатьCreatePKCS7Начало(ОписаниеОповещения, ДопПараметры = Неопределено) Экспорт 
	
	#Если НЕ ВебКлиент Тогда
		
		СоответствиеКлюча = ДопПараметры["СоответствиеКлюча"];	
		
		Если ТипЗнч(СоответствиеКлюча) = Тип("Соответствие") Тогда
			СтруктураКлюча = СоответствиеКлюча.Получить("СтруктураКлюча");
		Иначе
			СтруктураКлюча = СоответствиеКлюча;
		КонецЕсли;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("any string");
		МассивСтрок.Добавить(СтруктураКлюча.disk);
		МассивСтрок.Добавить(СтруктураКлюча.path);
		МассивСтрок.Добавить(СтруктураКлюча.file_name);
		МассивСтрок.Добавить(СтруктураКлюча.alias);
		
		Адрес = uzbled_EImzoСлужебный.ЗаписатьСтрокиВФайл(МассивСтрок, ".txt", КодировкаТекста.UTF8);
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		ИмяФайла = ПолучитьИмяВременногоФайла(".txt");
		
		ПослеОбновления = Ложь;
		Если ДопПараметры.Свойство("ПослеОбновления") Тогда 
			ПослеОбновления = ДопПараметры["ПослеОбновления"];
		КонецЕсли;
		
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1 = Новый Структура;
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1.Вставить("ОписаниеОповещения", ОписаниеОповещения);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1.Вставить("СоответствиеКлюча", ДопПараметры["СоответствиеКлюча"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1.Вставить("СтрокаНаПодпись", ДопПараметры["СтрокаНаПодпись"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1.Вставить("ПослеОбновления", ПослеОбновления);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение1.Вставить("ИмяФайла", ИмяФайла);
		
		Оповещение_ПодписатьCreatePKCS7Продолжение1 = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Продолжение1", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Продолжение1);
		
		ДД.НачатьЗапись(Оповещение_ПодписатьCreatePKCS7Продолжение1, ИмяФайла);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, "");
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодписатьCreatePKCS7Продолжение1(ДопПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПутьКВыходномуФайлу = "";
		
		СтрокаЗапроса = ПолучитьСтрокуЗапроса("ЗагрузитьИдКлюча", ПутьКВыходномуФайлу, ДопПараметры["ИмяФайла"]);
		
		// получение keyId из хранилища
		СоответствиеКлюча = ДопПараметры["СоответствиеКлюча"];	
		Если ТипЗнч(СоответствиеКлюча) = Тип("Соответствие") Тогда
			СтруктураКлюча = СоответствиеКлюча.Получить("СтруктураКлюча");
		Иначе
			СтруктураКлюча = СоответствиеКлюча;
		КонецЕсли;
		
		keyId = uzbled_EImzoСлужебный.ПолучитьНастройки(СтруктураКлюча["serialnumber"]);
		
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2 = Новый Структура;
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("ПутьКВыходномуФайлу", ПутьКВыходномуФайлу);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("СоответствиеКлюча", ДопПараметры["СоответствиеКлюча"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("СтрокаНаПодпись", ДопПараметры["СтрокаНаПодпись"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("ПослеОбновления", ДопПараметры["ПослеОбновления"]);
		ДопПараметры_ПодписатьCreatePKCS7Продолжение2.Вставить("keyId", keyId);
		
		Оповещение_ПодписатьCreatePKCS7Продолжение2 = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Продолжение2", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Продолжение2);
		
		Если ДопПараметры["ПослеОбновления"] ИЛИ ПустаяСтрока(keyId) Тогда
			
			ДопПараметры_ВыполнитьКомандуСистемыНачало = Новый Структура;
			ДопПараметры_ВыполнитьКомандуСистемыНачало.Вставить("ОписаниеОповещения", Оповещение_ПодписатьCreatePKCS7Продолжение2);	
			Оповещение = Новый ОписаниеОповещения("ВыполнитьКомандуСистемыНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ВыполнитьКомандуСистемыНачало);
			
			ВыполнитьОбработкуОповещения(Оповещение, СтрокаЗапроса);	
			
		Иначе
			
			ВыполнитьОбработкуОповещения(Оповещение_ПодписатьCreatePKCS7Продолжение2, Истина);		
			
		КонецЕсли;
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодписатьCreatePKCS7Продолжение2(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		Если Результат Тогда
			
			keyId = ДопПараметры["keyId"];
			
			Если ДопПараметры["ПослеОбновления"] ИЛИ ПустаяСтрока(keyId) Тогда
				
				ПутьКВыходномуФайлу = ДопПараметры["ПутьКВыходномуФайлу"];
				
				СтрокаJSON = "";
				
				ДД = Новый ДвоичныеДанные(ПутьКВыходномуФайлу);
				СтрокаJSON = uzbled_EImzoСлужебный.ПолучитьТекстИзФайла(ПоместитьВоВременноеХранилище(ДД), ".json");
				РезультатСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(СтрокаJSON, Истина);
				IDКлючСтруктура = uzbled_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруИзСоответствия(РезультатСоответствие);
				keyId = IDКлючСтруктура.keyId;
				
				// сохранение keyId в хранилище
				СоответствиеКлюча = ДопПараметры["СоответствиеКлюча"];	
				Если ТипЗнч(СоответствиеКлюча) = Тип("Соответствие") Тогда
					СтруктураКлюча = СоответствиеКлюча.Получить("СтруктураКлюча");
				Иначе
					СтруктураКлюча = СоответствиеКлюча;
				КонецЕсли;
				
				uzbled_EImzoСлужебный.СохранитьНастройки(СтруктураКлюча["serialnumber"], keyId);
				
			КонецЕсли;		
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить("any string");
			МассивСтрок.Добавить(ДопПараметры["СтрокаНаПодпись"]);
			
			Адрес = uzbled_EImzoСлужебный.ЗаписатьСтрокиВФайл(МассивСтрок, ".txt", КодировкаТекста.UTF8);
			ДД = ПолучитьИзВременногоХранилища(Адрес);
			ИмяФайла = ПолучитьИмяВременногоФайла(".txt");
			
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3 = Новый Структура;
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("СоответствиеКлюча", ДопПараметры["СоответствиеКлюча"]);
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("СтрокаНаПодпись", ДопПараметры["СтрокаНаПодпись"]);
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("ПослеОбновления", ДопПараметры["ПослеОбновления"]);
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("ИмяФайла", ИмяФайла);
			ДопПараметры_ПодписатьCreatePKCS7Продолжение3.Вставить("keyId", keyId);
			
			Оповещение_ПодписатьCreatePKCS7Продолжение3 = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Продолжение3", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Продолжение3);
			
			ДД.НачатьЗапись(Оповещение_ПодписатьCreatePKCS7Продолжение3, ИмяФайла);
			
		Иначе
			
			ДопПараметры_ПодписатьCreatePKCS7Завершение = Новый Структура;
			ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
			
			Оповещение_ПодписатьCreatePKCS7Завершение = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Завершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Завершение);
			
			ВыполнитьОбработкуОповещения(Оповещение_ПодписатьCreatePKCS7Завершение, Ложь);
			
		КонецЕсли;
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодписатьCreatePKCS7Продолжение3(ДопПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		ПутьКВыходномуФайлу = "";
		
		СтрокаЗапроса = ПолучитьСтрокуЗапроса("Подписать", ПутьКВыходномуФайлу, ДопПараметры["ИмяФайла"], ДопПараметры["keyId"]);
		
		ДопПараметры_ПодписатьCreatePKCS7Завершение = Новый Структура;
		ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("ОписаниеОповещения", ДопПараметры["ОписаниеОповещения"]);
		ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("СоответствиеКлюча", ДопПараметры["СоответствиеКлюча"]);
		ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("СтрокаНаПодпись", ДопПараметры["СтрокаНаПодпись"]);
		ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("ПослеОбновления", ДопПараметры["ПослеОбновления"]);
		ДопПараметры_ПодписатьCreatePKCS7Завершение.Вставить("ПутьКВыходномуФайлу", ПутьКВыходномуФайлу);
		
		Оповещение_ПодписатьCreatePKCS7Завершение = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Завершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Завершение);
		
		ДопПараметры_ВыполнитьКомандуСистемыНачало = Новый Структура;
		ДопПараметры_ВыполнитьКомандуСистемыНачало.Вставить("ОписаниеОповещения", Оповещение_ПодписатьCreatePKCS7Завершение);
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьКомандуСистемыНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ВыполнитьКомандуСистемыНачало);
		
		ВыполнитьОбработкуОповещения(Оповещение, СтрокаЗапроса);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодписатьCreatePKCS7Завершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		Если Результат Тогда
			
			ПутьКВыходномуФайлу = ДопПараметры["ПутьКВыходномуФайлу"];
			
			ДД = Новый ДвоичныеДанные(ПутьКВыходномуФайлу);
			СтрокаJSON = uzbled_EImzoСлужебный.ПолучитьТекстИзФайла(ПоместитьВоВременноеХранилище(ДД), ".json");
			
			Если Не ПустаяСтрока(СтрокаJSON) Тогда
				
				ПодписанныйТекст = СтрокаJSON;
				РезультатСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(СтрокаJSON, Истина);
				
				Если РезультатСоответствие.Получить("success") <> Неопределено
					И РезультатСоответствие.Получить("success") Тогда
					
					ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], ПодписанныйТекст);	
					
				ИначеЕсли НЕ ДопПараметры["ПослеОбновления"] Тогда
					
					ДопПараметры_ПодписатьCreatePKCS7Начало = Новый Структура;
					ДопПараметры_ПодписатьCreatePKCS7Начало.Вставить("СоответствиеКлюча", ДопПараметры["СоответствиеКлюча"]);
					ДопПараметры_ПодписатьCreatePKCS7Начало.Вставить("СтрокаНаПодпись", ДопПараметры["СтрокаНаПодпись"]);
					ДопПараметры_ПодписатьCreatePKCS7Начало.Вставить("ПослеОбновления", Истина);
					Оповещение_ПодписатьCreatePKCS7Начало = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Начало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_ПодписатьCreatePKCS7Начало);
					ВыполнитьОбработкуОповещения(Оповещение_ПодписатьCreatePKCS7Начало, ДопПараметры["ОписаниеОповещения"]);
					
				Иначе
					
					ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
			
		КонецЕсли;	
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], "");
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ПодписатьAppendPKCS7Attached

#КонецОбласти

#Область УстановитьШтампВремени

#КонецОбласти

#Область РасшифроватьПодпись


#КонецОбласти

#КонецОбласти

#Область ПроцедурыВыполнениеКомандыЧерезКоманднуюСтрокуОС

Процедура ВыполнитьКомандуСистемыНачало(ТекстКоманды, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(ТекстКоманды);
		
		Адрес = uzbled_EImzoСлужебный.ЗаписатьСтрокиВФайл(МассивСтрок, ".bat", КодировкаТекста.OEM);
		
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьКомандуСистемыЗавершение", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры);
		
		ВыполнитьОбработкуОповещения(Оповещение, ДД);
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ВыполнитьКомандуСистемыЗавершение(ДвоичныеДанные, ДопПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
			Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
			
			КомандаВыполненаУспешно = Ложь;
			
			BATFile = ПолучитьИмяВременногоФайла(".bat");
			ДвоичныеДанные.Записать(BATFile);
			
			WSShell = Новый COMОбъект("WScript.Shell");
			
			Попытка
				WSShell.Run("""" + BATFile + """", 0, 1);
				КомандаВыполненаУспешно = Истина;
			Исключение
			КонецПопытки;
			
			Если Не КомандаВыполненаУспешно Тогда
				
				// TODO
				
			КонецЕсли;
			
			Попытка
				УдалитьФайлы(BATFile);
			Исключение
			КонецПопытки;
			
			ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], КомандаВыполненаУспешно);
			
		Иначе
			
			ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
			
		КонецЕсли;
		
	#Иначе
		
		ВыполнитьОбработкуОповещения(ДопПараметры["ОписаниеОповещения"], Ложь);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеЭкспортныеПроцедурыИФункции

#КонецОбласти

#Область ВнутренниеПроцедурыИФункции

Функция ПолучитьСтрокуЗапроса(ВидЗапроса, ПутьКВыходномуФайлу = "", Параметр1 = Неопределено, Параметр2 = Неопределено)
	
	#Если НЕ ВебКлиент Тогда
		
		ПутьККомпонентеКриптографии = uzbled_EImzoСлужебный.ПолучитьПутьККомпонентеКриптографии();
		
		ПутьКВыходномуФайлу = ПолучитьИмяВременногоФайла(".json");	
		СтрокаЗапроса = "java -jar" + " """ + ПутьККомпонентеКриптографии + """";
		
		Если ВРег(ВидЗапроса) = "ПОЛУЧИТЬВЕРСИЮ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-get_version" + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ПОДКЛЮЧИТЬСЯ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-handshaking" + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ПОЛУЧИТЬСПИСОККЛЮЧЕЙ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-list_certificates_pfx" + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ЗАГРУЗИТЬКЛЮЧИ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-load_key_pfx" + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ЗАГРУЗИТЬИДКЛЮЧА" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-load_key_pfx" + " """ + Параметр1 + """ > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ПОДПИСАТЬ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-create_pkcs7" + " """ + Параметр1 + """ " + Параметр2 + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "ПОДПИСАТЬВТОРАЯСТОРОНА" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-append_pkcs7_attached" + " """ + Параметр1 + """ " + Параметр2 + " > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "РАСШИФРОВАТЬПОДПИСЬ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-get_pkcs7_attached_info" + " """ + Параметр1 + """ > """ + ПутьКВыходномуФайлу + """";
			
		ИначеЕсли ВРег(ВидЗапроса) = "УСТАНОВИТЬШТАМПВРЕМЕНИ" Тогда
			
			СтрокаЗапроса = СтрокаЗапроса + " " + "-attach_timestamp_token_pkcs7" + " """ + Параметр1 + """ " + Параметр2 + " > """ + ПутьКВыходномуФайлу + """";
			
		КонецЕсли;
		
		Возврат СтрокаЗапроса;
		
	#Иначе
		
		Возврат "";
		
	#КонецЕсли
	
КонецФункции

Функция ПолучитьПредставлениеКлюча(Certificate)
	
	Если Certificate.Получить("subjectName") <> Неопределено Тогда
		alias = Certificate.Получить("subjectName");
	ИначеЕсли Certificate.Получить("alias") <> Неопределено Тогда
		alias = Certificate.Получить("alias");
	Иначе
		Возврат "";
	КонецЕсли;
	Представление = "";
	Пока Истина Цикл
		Стр = "";
		ИндексРазделителя = Найти(alias, ",");
		Если ИндексРазделителя <> 0 Тогда
			Стр = Лев(alias, ИндексРазделителя - 1);
		Иначе
			Стр = alias;
		КонецЕсли;
		Стр = Сред(Стр, Найти(Стр, "=") + 1);
		Если Представление =  "" Тогда
			Представление = Стр;
		Иначе
			Представление = Представление + " " + Стр;
		КонецЕсли;
		Если ИндексРазделителя = 0 Тогда
			Прервать;
		КонецЕсли;
		alias = Сред(alias, ИндексРазделителя + 1) 
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(Знач Строка, ФорматСтроки = 1) Экспорт
	
	Год = 1;
	Месяц = 1;
	День = 1;
	Час = 1;
	Минута = 1;
	Секунда = 1;
	
	Если ФорматСтроки = 1 Тогда
		Месяц = ПолучитьНомерМесяцаПоСокращенномуНаменованию(Лев(Строка, Найти(Строка, " ") - 1)); 
		День = Число(Сред(Строка, Найти(Строка, " ")+1, Найти(Строка, ",") - Найти(Строка, " ") - 1));
		Строка = Сред(Строка, Найти(Строка, ",") + 2);
		Год = Число(Лев(Строка, 4));
		Строка = Сред(Строка, Найти(Строка, " ") + 1);
		Час = Число(Лев(Строка, Найти(Строка, ":") - 1));
		Строка = Сред(Строка, Найти(Строка, ":") + 1);
		Минута = Число(Лев(Строка, Найти(Строка, ":") - 1));
		Строка = Сред(Строка, Найти(Строка, ":") + 1);
		Секунда = Число(Лев(Строка, Найти(Строка, " ") - 1));
		Строка = Сред(Строка, Найти(Строка, " ") + 1);
		
		Если Строка = "PM" Тогда
			Если Час = 12 Тогда
				Час = 0;
			Иначе 
				Час = Час + 12;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Год = Число(Лев(Строка, Найти(Строка, ".") - 1));
		Строка = Сред(Строка, Найти(Строка, ".") + 1);
		Месяц = Число(Лев(Строка, Найти(Строка, ".") - 1));
		Строка = Сред(Строка, Найти(Строка, ".") + 1);
		День = Число(Лев(Строка, Найти(Строка, " ") - 1));
		Строка = Сред(Строка, Найти(Строка, " ") + 1);
		Час = Число(Лев(Строка, Найти(Строка, ":") - 1));
		Строка = Сред(Строка, Найти(Строка, ":") + 1);
		Минута = Число(Лев(Строка, Найти(Строка, ":") - 1));
		Строка = Сред(Строка, Найти(Строка, ":") + 1);
		Секунда = Число(Строка);
		
	КонецЕсли;
	
	Возврат Дата(Год, Месяц, День, Час, Минута, Секунда);
	
КонецФункции

Функция ПолучитьНомерМесяцаПоСокращенномуНаменованию(Строка)
	
	Если Строка = "Jan" Тогда
		Возврат 1;
	ИначеЕсли Строка = "Feb" Тогда
		Возврат 2;
	ИначеЕсли Строка = "Mar" Тогда
		Возврат 3;
	ИначеЕсли Строка = "Apr" Тогда
		Возврат 4;
	ИначеЕсли Строка = "May" Тогда
		Возврат 5;
	ИначеЕсли Строка = "Jun" Тогда
		Возврат 6;
	ИначеЕсли Строка = "Jul" Тогда
		Возврат 7;
	ИначеЕсли Строка = "Aug" Тогда
		Возврат 8;
	ИначеЕсли Строка = "Sept" Тогда
		Возврат 9;
	ИначеЕсли Строка = "Oct" Тогда
		Возврат 10;
	ИначеЕсли Строка = "Nov" Тогда
		Возврат 11;
	ИначеЕсли Строка = "Dec" Тогда
		Возврат 12;
	КонецЕсли;	
	
	Возврат "1";
	
КонецФункции

Функция ПеревестиЧислоИзШестнадцатиричногоВДесятичное(СтрокаХекс)
	
	мСтрокаХекс = СокрЛП(СтрокаХекс);
	СтрДлинаХексЧисла = СтрДлина(мСтрокаХекс);
	ДесятичноеЧисло = 0;
	
	Для Сч = 0 По СтрДлинаХексЧисла-1 Цикл
		Множитель = Pow(16,Сч);
		НехЧисло1Байт = Сред(мСтрокаХекс,СтрДлинаХексЧисла-Сч,1);
		Если НехЧисло1Байт = "a" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 10*Множитель;
		ИначеЕсли НехЧисло1Байт = "b" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 11*Множитель;
		ИначеЕсли НехЧисло1Байт = "c" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 12*Множитель;
		ИначеЕсли НехЧисло1Байт = "d" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 13*Множитель;
		ИначеЕсли НехЧисло1Байт = "e" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 14*Множитель;
		ИначеЕсли НехЧисло1Байт = "f" Тогда
			ДесятичноеЧисло = ДесятичноеЧисло + 15*Множитель;
		Иначе
			Попытка
				ДесятичноеЧисло = ДесятичноеЧисло + Число(НехЧисло1Байт)*Множитель;
			Исключение;
				//не число от 0 до 9
			КонецПопытки
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДесятичноеЧисло;
	
КонецФункции

Функция ПолучитьИННИзAlias(alias)
	
	ИНН = "";
	
	КлючИНН = "1.2.860.3.16.1.1=";
	ПозицияНачалоКлючаИНН = СтрНайти(alias, КлючИНН);
	
	Если ПозицияНачалоКлючаИНН <> 0 Тогда
		
		ИНН = Сред(alias, ПозицияНачалоКлючаИНН + СтрДлина(КлючИНН), 9);
		
	Иначе
		
		КлючИНН = "uid=";
		ПозицияНачалоКлючаИНН = СтрНайти(alias, КлючИНН);
		
		Если ПозицияНачалоКлючаИНН <> 0 Тогда
			
			ИНН = Сред(alias, ПозицияНачалоКлючаИНН + СтрДлина(КлючИНН), 9);			
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ИНН;
	
КонецФункции

Функция ПолучитьПИНФЛИзAlias(alias)
	
	ПИНФЛ = "";
	
	КлючПИНФЛ = "1.2.860.3.16.1.2=";
	ПозицияНачалоКлючаПИНФЛ = СтрНайти(alias, КлючПИНФЛ);
	
	Если ПозицияНачалоКлючаПИНФЛ <> 0 Тогда
		
		ПИНФЛ = Сред(alias, ПозицияНачалоКлючаПИНФЛ + СтрДлина(КлючПИНФЛ), 14);	
		
	КонецЕсли;
	
	Возврат ПИНФЛ;
	
КонецФункции

#КонецОбласти
