// ОПИСАНИЕ ПЕРЕМЕННЫХ

&НаСервере
Перем мОбъектОтчета;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметров = Новый Структура;
	ОбъектОтчета = ОбъектОтчета(ЭтаФорма.ИмяФормы); 
	ОбъектОтчета.ПодготовитьДанныеОтчета(СтруктураПараметров);    
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПараметрыФормы()
	
	СтруктураПараметров.НачалоПериода 			= ПериодОтчета.ДатаНачала;
	СтруктураПараметров.КонецПериода 			= ПериодОтчета.ДатаОкончания;
	СтруктураПараметров.Регион 					= Регион;
	СтруктураПараметров.Менеджер 				= Менеджер; 
	СтруктураПараметров.ОтборРегион             = ОтборРегион;
	СтруктураПараметров.ОтборМенджер            = ОтборМенджер;
	
КонецПроцедуры	

&НаКлиенте
Процедура Сформировать(Команда)
		
	Если НЕ ЗначениеЗаполнено(ПериодОтчета) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен Период отчета.";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;  
	Если НЕ ЗначениеЗаполнено(Регион) И ОтборРегион Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен Регион отчета или отключите галочку!";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Менеджер) И ОтборМенджер Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен Валюта отчета или отключите галочку!";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	ЗаполнитьПараметрыФормы();
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	ТекОбъект.Сформировать(СтруктураПараметров, ТабДок);
	
КонецПроцедуры

&НаСервере
Функция ОбъектОтчета(ИмяФормы) Экспорт
		
	Если мОбъектОтчета = Неопределено Тогда 
		мОбъектОтчета = РеквизитФормыВЗначение("Отчет");
	КонецЕсли;
	
	Возврат мОбъектОтчета;
	
КонецФункции

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Менеджер) Тогда
		ОтборМенджер = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегионПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Регион) Тогда
		ОтборРегион = Истина;
	КонецЕсли;
КонецПроцедуры










