Процедура РасчитатьЛиквидностьТоваров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
		|	СУММА(РаспределениеЗапасов.Свободно) КАК КоличествоОстаток
		|ПОМЕСТИТЬ втДоступныеТовары
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеЗапасов.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК КоличествоОстатокУКомиссионера
		|ПОМЕСТИТЬ втОстатокУКомиссионера
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(&Период, ) КАК ТоварыОрганизацийОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
		|		ПО ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
		|			И (АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента))
		|			И (АналитикаНоменклатуры.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером))
		|			И (АналитикаНоменклатуры.Договор.КомиссионныеПродажи25)
		|
		|СГРУППИРОВАТЬ ПО
		|	АналитикаНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрогнозПродажОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ПрогнозПродажОбороты.ПродажиПрогнозОборот / ДЕНЬ(КОНЕЦПЕРИОДА(ПрогнозПродажОбороты.Период, МЕСЯЦ))) КАК СрСуточныйПрогноз
		|ПОМЕСТИТЬ втПрогнозПродаж
		|ИЗ
		|	РегистрНакопления.ПрогнозПродаж.Обороты(, , День, ) КАК ПрогнозПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрогнозПродажОбороты.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоступныеТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втПрогнозПродаж.СрСуточныйПрогноз, 0) > 0
		|				И втДоступныеТовары.Номенклатура.ПлечоПоставки > 0
		|			ТОГДА (втДоступныеТовары.КоличествоОстаток + ЕСТЬNULL(втОстатокУКомиссионера.КоличествоОстатокУКомиссионера, 0)) / ЕСТЬNULL(втПрогнозПродаж.СрСуточныйПрогноз, 0) * (1 / втДоступныеТовары.Номенклатура.ПлечоПоставки)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ликвидность
		|ИЗ
		|	втДоступныеТовары КАК втДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатокУКомиссионера КАК втОстатокУКомиссионера
		|		ПО втДоступныеТовары.Номенклатура = втОстатокУКомиссионера.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПрогнозПродаж КАК втПрогнозПродаж
		|		ПО втДоступныеТовары.Номенклатура = втПрогнозПродаж.Номенклатура";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.ЛиквидностьТоваров.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ликвидность) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ТекущаяДата();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
		
КонецПроцедуры
