///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ЧП "Плюс Софт"
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  

	Отказ=Ложь;
	ПараметрОснование=Объект.ДокументОснование; 
	
	БлокировкаПроверка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ.ПолучитьОбъект(); 
	БлокировкаИсключение=Ложь;
	
	Попытка
		БлокировкаПроверка.Заблокировать();
	Исключение
		Сообщить("С обработкой уже работают в режиме 'без привязки к документам'. Попробуйте позже!");
		БлокировкаИсключение=истина;
		Отказ=Истина;
	КонецПопытки;
	
	Если Не БлокировкаИсключение Тогда
		БлокировкаПроверка.Разблокировать();
		ИмяПользователя=ИмяПользователя();
		НайденнаяСсылка= Справочники.Блокировки.НайтиПоРеквизиту("ДокументОснование",ПараметрОснование);
		Если не НайденнаяСсылка.Пустая() тогда
			Если ИмяПользователя <> НайденнаяСсылка.Наименование Тогда
				Сообщить("С документом "+ПараметрОснование+" уже работает пользователь "+ НайденнаяСсылка.Наименование);
				Отказ=Истина; 
			КонецЕсли; 
			Возврат;
		КонецЕсли;

		// ищем пользователя
		НайденнаяСсылка= Справочники.Блокировки.НайтиПоНаименованию(ИмяПользователя,Истина);
		Если НайденнаяСсылка.Пустая() тогда
			СпрОбъект=Справочники.Блокировки.СоздатьЭлемент();
			СпрОбъект.Наименование=ИмяПользователя;
			СпрОбъект.Записать();
		иначе
			СпрОбъект=НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли; 
		СпрОбъект.ДокументОснование=ПараметрОснование;
		СпрОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьКомплектациюНаСервере(ДокументОснование)
        ЕстьМаркировка=Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КодыМаркировки.Статус КАК Статус,
			|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
			|	КодыМаркировки.КодМаркировки КАК КодМаркировки
			|ИЗ
			|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
			|ГДЕ
			|	КодыМаркировки.ДокументПрихода = &Ссылка";   
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
        	Запрос.Текст=СтрЗаменить(Запрос.Текст,"ДокументПрихода","ДокументРасхода");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();  
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
			ЕстьМаркировка=Истина;
		КонецЕсли; 
		Возврат ЕстьМаркировка;
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьРазкомплектациюНаСервере(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыМаркировки.Статус,
	|	КодыМаркировки.ДокументРасхода,
	|	КодыМаркировки.КодМаркировки
	|ИЗ
	|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
	|ГДЕ
	|	КодыМаркировки.ДокументПрихода = &Ссылка";   
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ДокументПрихода","ДокументРасхода");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапроса.Количество()>0 Тогда
		//Тзвыборка=Новый ТаблицаЗначений;
		ТзВыборка=РезультатЗапроса.Выгрузить(); 
		ТзВыборка.Свернуть("Статус,ДокументРасхода"); 
		
		Если ТзВыборка.Количество()>0 Тогда
			
			Для  Каждого ТзВыборкаСтр из ТзВыборка Цикл
				Если ТзВыборкаСтр.Статус>2 и ТипЗнч(ДокументОснование)<> Тип("ДокументСсылка.РеализацияТоваровУслуг")тогда
					//Сообщить("Есть связь с документом "+ТзВыборкаСтр.ДокументРасхода); 
					Возврат Ложь;
				КонецЕсли;
			КонецЦикла; 

			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
				Запись.КодМаркировки=ВыборкаДетальныеЗаписи.КодМаркировки; 
				Запись.Прочитать();
				Если Запись.Выбран() тогда  
					Если ТипЗнч(ДокументОснование)= Тип("ДокументСсылка.РеализацияТоваровУслуг")тогда
						Запись.ДокументРасхода="";
						// определим статус
						ДокПрихода=Запись.ДокументПрихода.Ссылка.ПолучитьОбъект();
						Если ДокПрихода.Проведен тогда
							Запись.Статус=2;
						Иначе	
							Запись.Статус=1;
						КонецЕсли;
					Иначе	 
						Запись.Статус=0; 
						Запись.ДокументПрихода="";
						Запись.ДокументРасхода="";
						Запись.НомерСерии="";
						Запись.Номенклатура=Справочники.Номенклатура.ПустаяСсылка(); 
						Запись.КоличествоЕдиницТовара=0;
						Если Не Запись.ПроверенНасайте тогда
							Запись.КодSSCC1="";
							Запись.ЕмкостьУпаковки=0;
							Запись.ТипУпаковки=Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ПустаяСсылка();
						КонецЕсли;
					КонецЕсли;	 
					Запись.Записать(); 
				КонецЕсли;	
			КонецЦикла; 
		КонецЕсли;
		//ДокОснование=ДокументОснование.ПолучитьОбъект();
		//ДокОснование.ИмпортКодовМаркировки=Ложь;
		//ДокОснование.Записать();
		//Сообщить("Документ "+параметрОснование+" разкомплектован!");
	//КонецЕсли;	
	    Возврат Истина;
КонецФункции	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ=Истина;
	
	ЕстьКомплектация=ОпределитьКомплектациюНаСервере(Объект.ДокументОснование);
	
	Если ЕстьКомплектация Тогда 
		ТекстВопроса = "Документ уже укомплектован! Отменить комплектацию?";
		ОповещениеВозврат=Новый ОписаниеОповещения("ПриОткрытииЗавершение",ЭтотОбъект);
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьКомплектациюВыполнить",Этотобъект,ОповещениеВозврат),
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	иначе	
		ПриОткрытииЗавершение(Неопределено,Неопределено);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьКомплектациюВыполнить(Результат,Знач ОповещениеВозврат) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Не ВыполнитьРазкомплектациюНаСервере(Объект.ДокументОснование) Тогда 
			Сообщить("Есть связь с документами расхода. Отмена комплектации невозможна!");
		иначе
			Сообщить(" Документ разкомплектован!");
			ВыполнитьОбработкуОповещения(ОповещениеВозврат);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат,ДопПараметры) Экспорт	
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыполнитьУдалениеБлокировки", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("ДокументОснование", Объект.ДокументОснование); 
	ОткрытьФорму("Обработка.КомплектацияДвиженияТоваровКМ.Форма.Форма",ПараметрыФормы,,,,,ОповещениеОЗакрытии);
КонецПроцедуры
	
&НаКлиенте
Процедура ВыполнитьУдалениеБлокировки(Результат,ДопПараметры) Экспорт
	ИмяПользователя=ИмяПользователя(); 
	РазблокироватьПоДокументу(ИмяПользователя,Объект.ДокументОснование); 
КонецПроцедуры	

&НаСервереБезКонтекста	
Процедура РазблокироватьПоДокументу(ИмяПользователя,ДокументСсылка); 
	НайденнаяСсылка= Справочники.Блокировки.НайтиПоРеквизиту("ДокументОснование",ДокументСсылка);
	Если Не НайденнаяСсылка.Пустая() тогда
		СпрОбъект=НайденнаяСсылка.ПолучитьОбъект();
		СпрОбъект.ДокументОснование=Справочники.Блокировки.ПустаяСсылка();
		СпрОбъект.Записать();
	КонецЕсли;
КонецПроцедуры


