///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = Неопределено;
	
	Попытка
		Модуль = Вычислить(Имя); // ВычислитьВБезопасномРежиме не требуется, т.к. проверка надежная.
	Исключение
	КонецПопытки;
	
	Возврат Модуль;
	
КонецФункции

Функция ПолучитьСтруктуруИзСоответствия(Соответствие) Экспорт
	
	СтруктураВозврата = Новый Структура;
	Для каждого ЭлеменСоответствия Из Соответствие Цикл
		Попытка
			СтруктураВозврата.Вставить(ЭлеменСоответствия.Ключ, ЭлеменСоответствия.Значение);
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСоответствиеИзСтруктуры(Структура) Экспорт
	
	СоответствиеВозврата = Новый Соответствие;
	Для каждого ЭлеменСтруктуры Из Структура Цикл
		Попытка
			СоответствиеВозврата.Вставить(ЭлеменСтруктуры.Ключ, ЭлеменСтруктуры.Значение);
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Возврат СоответствиеВозврата;
	
КонецФункции

Функция ПолучитьСтруктуруИзСпискаЗначений(СписокЗначений, СтруктураВозврата = Неопределено) Экспорт
	
	Если Структуравозврата = Неопределено Тогда
		СтруктураВозврата = Новый Структура;
	КонецЕсли;
	Для каждого ЭлеменСпискаЗначений Из СписокЗначений Цикл
		Ключ = Лев(ЭлеменСпискаЗначений.Значение, Найти(ЭлеменСпискаЗначений.Значение, "=") - 1);
		Значение = Прав(ЭлеменСпискаЗначений.Значение, СтрДлина(ЭлеменСпискаЗначений.Значение) - Найти(ЭлеменСпискаЗначений.Значение, "="));
		Попытка
			СтруктураВозврата.Вставить(Ключ, Значение);
		Исключение
		КонецПопытки
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция преобразует строковый список вида "а,бб,ввв" в список значений
//
// Параметры:
//   Список      - Строка - Список, который надо преобразовать
//   Разделитель - Строка - Разделитель значений списка
//
// Возвращаемое значение:
//   СписокЗначений - полученный из Списка значений строка
//
Функция ПреобразоватьСписокВСписокЗначений(Знач Список="",Разделитель=",", Знач СписокПредставлений = "") Экспорт

	Спис = Новый СписокЗначений;
	Если НЕ ПустаяСтрока(Список) Тогда
		ГдеРазделитель = Найти(Список,Разделитель);
		ГдеРазделительПредставления = Найти(СписокПредставлений,Разделитель);
		Пока ГдеРазделитель>0 Цикл
			Элем = Лев(Список,ГдеРазделитель-1);
			Представление = Элем;
			Если ГдеРазделительПредставления > 0 Тогда
				Представление = Лев(СписокПредставлений,ГдеРазделительПредставления-1);
				СписокПредставлений = Прав(СписокПредставлений,СтрДлина(СписокПредставлений)-ГдеРазделительПредставления-СтрДлина(Разделитель)+1);
				ГдеРазделительПредставления = Найти(СписокПредставлений,Разделитель);
			КонецЕсли;
			Спис.Добавить(Элем, Представление);
			Список = Прав(Список,СтрДлина(Список)-ГдеРазделитель-СтрДлина(Разделитель)+1);
			ГдеРазделитель = Найти(Список,Разделитель);
		КонецЦикла;
		Спис.Добавить(Список, СписокПредставлений);
	КонецЕсли;

	Возврат Спис;

КонецФункции // ПреобразоватьСписокВСписокЗначений()

Процедура ДополнитьМассив(МассивПервый, МассивВторой) Экспорт
	
	Для каждого Элемент Из МассивВторой Цикл
		
		МассивПервый.Добавить(Элемент);
		
	КонецЦикла;
	
КонецПроцедуры
