
// Добавляет команду создания документа "Ввод кодов маркировки".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	//Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукции") 
	//	И ПравоДоступа("Добавление", Метаданные.Документы.ВводКодовМаркировки) Тогда
	//	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	//	КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВводКодовМаркировки.ПолноеИмя();
	//	КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Ввод кодов маркировки'");
	//	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	//
	//	Возврат КомандаСоздатьНаОсновании;
	//	
	//КонецЕсли;
	//
	//Возврат Неопределено;
	
КонецФункции
