
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Заполнение списка Регионы из ОКБР.
	ЗакрыватьПриВыборе = Ложь;
	ЗаполнитьТаблицуБизнесРегион();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокБизнесРегион

&НаКлиенте
Процедура СписокБизнесРегионВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборВСпискеБизнесРегион(СтандартнаяОбработка);
	
КонецПроцедуры                  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВыполнить()
	
	ОбработатьВыборВСпискеБизнесРегион();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуБизнесРегион()
	
	// Заполняет список Регионы из макета ОКБР.
	
	КлассификаторXML = Справочники.БизнесРегионы.ПолучитьМакет("ОбщийКлассификаторБизнесРегион").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого ЗаписьОКБР Из КлассификаторТаблица Цикл
		//НоваяСтрока = БизнесРегион.Добавить();
		//НоваяСтрока.КодЦифровой         = ЗаписьОКВ.Code;
		//НоваяСтрока.КодБуквенный        = ЗаписьОКВ.CodeSymbol;
		//НоваяСтрока.Наименование              = ЗаписьОКВ.Name;
		//НоваяСтрока.СтраныИТерритории         = ЗаписьОКВ.Description;
		//НоваяСтрока.Загружается               = ЗаписьОКВ.RBCLoading;
		//НоваяСтрока.ПараметрыПрописиНаРусском = ЗаписьОКВ.NumerationItemOptions;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьВыбранныеСтроки(Знач ВыбранныеСтроки, ЕстьРегионы)
//	
//	ЕстьРегион = Ложь;
//	ТекущаяСсылка = Неопределено;
//	
//	Для каждого НомерСтроки Из ВыбранныеСтроки Цикл
//		ТекущиеДанные = Регион[НомерСтроки];
//		
//		СтрокаВБазе = Справочники.НайтиПоКоду(ТекущиеДанные.КодЦифровой);
//		Если ЗначениеЗаполнено(СтрокаВБазе) Тогда
//			Если НомерСтроки = Элементы.Список.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
//				ТекущаяСсылка = СтрокаВБазе;
//			КонецЕсли;
//			Продолжить;
//		КонецЕсли;
//		
//		НоваяСтрока = Справочники.СоздатьЭлемент();
//		НоваяСтрока.Код                       = ТекущиеДанные.КодЦифровой;
//		НоваяСтрока.Наименование              = ТекущиеДанные.КодБуквенный;
//		НоваяСтрока.НаименованиеПолное        = ТекущиеДанные.Наименование;
//		Если ТекущиеДанные.Загружается Тогда
//			НоваяСтрока.СпособУстановкиРегиона = Перечисления.СпособыУстановкиРегиона.ЗагрузкаИзИнтернета;
//		Иначе
//			НоваяСтрока.СпособУстановкиРегиона = Перечисления.СпособыУстановкиРегиона.РучнойВвод;
//		КонецЕсли;
//		НоваяСтрока.ПараметрыПрописиНаРусском = ТекущиеДанные.ПараметрыПрописиНаРусском;
//		НоваяСтрока.Записать();
//		
//		Если НомерСтроки = Элементы.Список.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
//			ТекущаяСсылка = НоваяСтрока.Ссылка;
//		КонецЕсли;
//		
//		Если ТекущиеДанные.Загружается Тогда 
//			ЕстьРегионы = Истина;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат ТекущаяСсылка;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыборВСпискеБизнесРегион(СтандартнаяОбработка = Неопределено)
//	Перем ЕстьРегиоы;
//	
//	// Добавление элемента справочника и вывод результата пользователю.
//	СтандартнаяОбработка = Ложь;
//	
//	ТекущаяСсылка = СохранитьВыбранныеСтроки(Элементы.Список.ВыделенныеСтроки, ЕстьРегионы);
//	
//	ОповеститьОВыборе(ТекущаяСсылка);
//	
//	ПоказатьОповещениеПользователя(
//		НСтр("ru = 'Регионы добавлены.'"), ,
//		?(СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().РазделениеВключено И ЕстьРегионы, 
//			НСтр("ru = 'Регионы будут загружены автоматически через непродолжительное время.'"), ""),
//		БиблиотекаКартинок.Информация32);
//	Закрыть();
//	
КонецПроцедуры

#КонецОбласти
