
Перем мРезультатЗапроса;

Функция СведенияОВнешнейОбработке() Экспорт
    
    ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета);         
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Вид","ДополнительныйОтчет"); //может быть – ПечатнаяФорма, ЗаполнениеОбъекта (для вн.обработки), ДополнительныйОтчет, СозданиеСвязанныхОбъектов… 
	РегистрационныеДанные.Вставить("Наименование", Синоним); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Отчет "+Синоним); //так будет выглядеть описание вн.отчета для пользователя
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет" , "ОткрытиеФормы", Истина, );
	
	// Сохраним таблицу команд в параметры регистрации обработки
	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	
	Возврат РегистрационныеДанные;
                                       
КонецФункции

Функция ПолучитьТаблицуКоманд()
    
    // Создадим пустую таблицу команд и колонки в ней
    Команды = Новый ТаблицаЗначений;

    // Как будет выглядеть описание печатной формы для пользователя
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 

    // Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

    // Тут задается, как должна вызваться команда обработки
    // Возможные варианты:
    // - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
    // - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
    // - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));

    // Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));

    // Для печатной формы должен содержать строку ПечатьMXL 
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
 	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Процедура ПодготовитьДанныеОтчета(СтруктураПараметров) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода",);
	СтруктураПараметров.Вставить("КонецПериода",); 
	СтруктураПараметров.Вставить("Регион",);
	СтруктураПараметров.Вставить("Менеджер",);
	СтруктураПараметров.Вставить("ОтборРегион",);
	СтруктураПараметров.Вставить("ОтборМенджер",);
	
КонецПроцедуры

Процедура Сформировать(РеквизитыФормы, ТабДок) Экспорт
	ТабДок.Очистить();
	
	ТабДок.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Отчет_По_Дебиторской_Задолжности";
	
	Макет = ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОблПодразделение = Макет.ПолучитьОбласть("Подразделение");
	ОблКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", РеквизитыФормы.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", РеквизитыФормы.КонецПериода);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a")); 
	Запрос.УстановитьПараметр("БизнесРегион", РеквизитыФормы.Регион);
	Запрос.УстановитьПараметр("Менеджер", РеквизитыФормы.Менеджер);	
	УдалитьНенужныеОтборы(РеквизитыФормы.ОтборРегион, РеквизитыФормы.ОтборМенджер, Запрос.Текст); 
	
	РазницаВДнях = (НачалоДня(РеквизитыФормы.КонецПериода) - НачалоДня(РеквизитыФормы.НачалоПериода)) / (60 * 60 * 24) + 1;
	
	РезультатЗапроса = Запрос.Выполнить();
	Cрдеб = 0; 
	Оборачиваемость = 0;
	СкоростьВозврата = 0;
	ВыборкаЗначение1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	 
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = ВернутьТекстЗапроса();
	
	Запрос1.УстановитьПараметр("ДатаНачала", РеквизитыФормы.НачалоПериода);
	Запрос1.УстановитьПараметр("ДатаОкончания", РеквизитыФормы.КонецПериода);
	Запрос1.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a")); 
	Запрос1.УстановитьПараметр("БизнесРегион", РеквизитыФормы.Регион);
	Запрос1.УстановитьПараметр("Менеджер", РеквизитыФормы.Менеджер);
	УдалитьНенужныеОтборы(РеквизитыФормы.ОтборРегион, РеквизитыФормы.ОтборМенджер, Запрос1.Текст);
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	ВыборкаЗначение = РезультатЗапроса1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаЗначение1.Следующий() Цикл
		ВыборкаДетальныеЗаписи1 = ВыборкаЗначение1.Выбрать(); 
		Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
			СрДз = Возраттекст(РеквизитыФормы.НачалоПериода,РеквизитыФормы.КонецПериода,ВыборкаДетальныеЗаписи1.Контрагент,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"),ВыборкаДетальныеЗаписи1.Значение,ВыборкаДетальныеЗаписи1.Регион,ВыборкаДетальныеЗаписи1.Менеджер,РеквизитыФормы.ОтборРегион, РеквизитыФормы.ОтборМенджер);	
			Если СрДз <> 0 Тогда
				СрДз = Окр(СрДз,2);
				Cрдеб = Cрдеб + СрДз; 
				
				Оборачиваемость = Оборачиваемость + ?(ВыборкаДетальныеЗаписи1.СуммаВыручкиСНДСРеглОборот = 0,0,ВыборкаДетальныеЗаписи1.СуммаВыручкиСНДСРеглОборот / СрДз);
				СкоростьВозврата = СкоростьВозврата + ?(ВыборкаДетальныеЗаписи1.СуммаВыручкиСНДСРеглОборот = 0,0,РазницаВДнях /  (ВыборкаДетальныеЗаписи1.СуммаВыручкиСНДСРеглОборот / СрДз)); 
			КонецЕсли; 	
		КонецЦикла;
		Пока ВыборкаЗначение.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаЗначение.Выбрать(); 
			
			ОблПодразделение.Параметры.Подразделение = ВыборкаЗначение.Значение;
			ОблПодразделение.Параметры.ДЗ = ВыборкаЗначение.ДолгОстаток;
			ОблПодразделение.Параметры.СрДеб = Cрдеб;
			ОблПодразделение.Параметры.Продажи = ВыборкаЗначение.СуммаВыручкиСНДСРеглОборот;
			ОблПодразделение.Параметры.Оборачиваемость = ?(ВыборкаЗначение.СуммаВыручкиСНДСРеглОборот = 0,0,ВыборкаЗначение.СуммаВыручкиСНДСРеглОборот / Cрдеб);
			ОблПодразделение.Параметры.СкоростьВозврата = ?(ВыборкаЗначение.СуммаВыручкиСНДСРеглОборот = 0,0,РазницаВДнях /  (ВыборкаЗначение.СуммаВыручкиСНДСРеглОборот / Cрдеб));
			ОблПодразделение.Параметры.Регион = ВыборкаЗначение.Регион;
			ОблПодразделение.Параметры.Менеджер = ВыборкаЗначение.Менеджер;
			ТабДок.Вывести(ОблПодразделение); 
			ТабДок.НачатьГруппуСтрок();
			
			Оборачиваемость = 0;
			СкоростьВозврата = 0; 
			Тз = Новый ТаблицаЗначений; 
			Тз.Колонки.Добавить("Контрагент"); 
			Тз.Колонки.Добавить("ДЗ"); 
			Тз.Колонки.Добавить("Продажи"); 
			Тз.Колонки.Добавить("Регион"); 
			Тз.Колонки.Добавить("Менеджер"); 
			Тз.Колонки.Добавить("СрДеб"); 
			Тз.Колонки.Добавить("Оборачиваемость"); 
			Тз.Колонки.Добавить("СкоростьВозврата");
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				НСтр = Тз.Добавить();
				НСтр.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				НСтр.ДЗ = ВыборкаДетальныеЗаписи.ДолгОстаток;
				НСтр.Продажи = ВыборкаДетальныеЗаписи.СуммаВыручкиСНДСРеглОборот;
				НСтр.Регион =  ВыборкаДетальныеЗаписи.Регион;
				НСтр.Менеджер = ВыборкаДетальныеЗаписи.Менеджер;
				срдеб = Возраттекст(РеквизитыФормы.НачалоПериода,РеквизитыФормы.КонецПериода,ВыборкаДетальныеЗаписи.Контрагент,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"),ВыборкаДетальныеЗаписи.Значение,ВыборкаДетальныеЗаписи.Регион,ВыборкаДетальныеЗаписи.Менеджер,РеквизитыФормы.ОтборРегион, РеквизитыФормы.ОтборМенджер);	
				Если срдеб <> 0 Тогда
					срдеб = Окр(срдеб,2);
					НСтр.СрДеб = срдеб;
					НСтр.Оборачиваемость = ?(ВыборкаДетальныеЗаписи.СуммаВыручкиСНДСРеглОборот = 0,0,ВыборкаДетальныеЗаписи.СуммаВыручкиСНДСРеглОборот / срдеб);
					НСтр.СкоростьВозврата = ?(ВыборкаДетальныеЗаписи.СуммаВыручкиСНДСРеглОборот = 0,0,РазницаВДнях /  (ВыборкаДетальныеЗаписи.СуммаВыручкиСНДСРеглОборот / срдеб));
				Иначе
					НСтр.СрДеб = 0;
					НСтр.Оборачиваемость = 0;
					НСтр.СкоростьВозврата = 0; 
				КонецЕсли;		
			КонецЦикла;
			Тз.Сортировать("Оборачиваемость Возр");	
			Для Каждого Строка Из Тз Цикл 
				ЗаполнитьЗначенияСвойств(ОблКонтрагент.Параметры,Строка);  
				ТабДок.Вывести(ОблКонтрагент);
			КонецЦикла;
			ТабДок.ЗакончитьГруппуСтрок(); 
			Прервать;
		КонецЦикла;
		Cрдеб = 0;
		
	КонецЦикла;
	
	
	
	ТабДок.ФиксацияСверху = 4;
	
КонецПроцедуры 

Функция ВернутьТекстЗапроса()
	ТекстЗапроса =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор КАК АналитикаУчетаПоПартнерамДоговор1,
	|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиСНДСРеглОборот) КАК СуммаВыручкиСНДСРеглОборот
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВыручкаИСебестоимостьПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК Значение,
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ВТ.СуммаВыручкиСНДСРеглОборот, 0)) КАК СуммаВыручкиСНДСРеглОборот,
	|	СУММА(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток) КАК ДолгОстаток,
	|	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер.БизнесРегион, ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)) КАК Регион,
	|	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Менеджер
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОкончания, ) КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	|		ПО РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Договор = ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Договор = ВТ.АналитикаУчетаПоПартнерамДоговор1
	|ГДЕ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
	|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Менеджер = &Менеджер
	|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер.БизнесРегион = &БизнесРегион
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение,
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер,
	|	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)),
	|	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер.БизнесРегион, ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение
	|ИТОГИ
	|	СУММА(СуммаВыручкиСНДСРеглОборот),
	|	СУММА(ДолгОстаток)
	|ПО
	|	Значение";
	Возврат ТекстЗапроса;  
	
	
КонецФункции 

Функция Возраттекст(ДатаНачала,ДатаОкончания,Партнер,Свойство,Значения,БизнесРегион,Менеджер,ОтборРегион, ОтборМенеджер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК Значение,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Период КАК Период,
	|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДолгКонечныйОстаток КАК ДолгКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, День, Движения, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК РасчетыСКлиентамиПоСрокамОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	|		ПО РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Договор = ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
	|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер.БизнесРегион = &БизнесРегион
	|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Менеджер = &Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение,
	|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Свойство", Свойство); 
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("БизнесРегион", БизнесРегион);
	УдалитьНенужныеОтборы(ОтборРегион, ОтборМенеджер, Запрос.Текст);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда 
		
		Возврат 0;
		
	КонецЕсли; 
	
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РазницаВДнях = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24) + 1;
	ОбщийДолг = 0; 
	СтарыйПериод = Неопределено;
	СтаряСумма = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Значения = ВыборкаДетальныеЗаписи.Значение Тогда 
			Если ВыборкаДетальныеЗаписи.Период < ДатаОкончания Тогда
				Если СтарыйПериод <> Неопределено И СтаряСумма <> Неопределено Тогда
					//ОбщийДолг = ОбщийДолг +  (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24) + 1; 
					Если ДатаОкончания < ВыборкаДетальныеЗаписи.Период Тогда 
						Продолжить;		
					КонецЕсли;
					Если СтарыйПериод < ДатаНачала Тогда 
						ДатаОтсчета = ДатаНачала;  
					Иначе 
						ДатаОтсчета = СтарыйПериод;	
					КонецЕсли;
					Пока ДатаОтсчета < ВыборкаДетальныеЗаписи.Период Цикл
						
						ОбщийДолг = ОбщийДолг + СтаряСумма;
						ДатаОтсчета = ДатаОтсчета + 86400;
						
					КонецЦикла;
					
					
				КонецЕсли; 
				
				СтарыйПериод = ВыборкаДетальныеЗаписи.Период;
				СтаряСумма = ВыборкаДетальныеЗаписи.ДолгКонечныйОстаток;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если СтарыйПериод  = Неопределено И СтаряСумма = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Если ДатаОкончания < СтарыйПериод Тогда 
		Возврат 0;		
	КонецЕсли;
	Если СтарыйПериод < ДатаНачала ТОгда 
		СтарыйПериод = ДатаНачала;	
	КонецЕсли;
	//Если ОбщийДолг = 0  Тогда 
		
	ОбщийДолг = ОбщийДолг + (СтаряСумма * ((НачалоДня(ДатаОкончания) - НачалоДня(СтарыйПериод)) / (60 * 60 * 24) + 1));
		
	//КонецЕсли;

	
	Возврат ОбщийДолг / РазницаВДнях;  
	
КонецФункции

Процедура УдалитьНенужныеОтборы(Регион, Менеджер, ТекстЗапроса)
	Если Не Менеджер Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Менеджер = &Менеджер", "");
	КонецЕсли;
	
	Если Не Регион Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Партнер.БизнесРегион = &БизнесРегион", "");
	КонецЕсли;
КонецПроцедуры







