///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("*");
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	//Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает полные данные классификатора видов меха.
//
// Возвращаемое значение:
//     ТаблицаЗначений - данные классификатора с колонками:
//         * Код          - Строка - Код элемента классификатора
//         * Наименование - Строка - Наименование банка
//
// Таблица значений проиндексирована по полям "Код", "Наименование".
//
Функция ТаблицаКлассификатора(КодРодителя) Экспорт

	ТаблицаПоказателей = Новый ТаблицаЗначений;
	
	Макет = Справочники.КлассификаторБанков.ПолучитьМакет("КлассификаторБанков");
	
	// В полученном макете содержатся значения всех списков используемых в отчете, ищем переданный.
	Список = Макет.Области.Найти("Строки");
	
	Если Список.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
		
		// Заполнение дерева данными списка.
		ВерхОбласти	= Список.Верх;
		НизОбласти	= Список.Низ;
		
		НомерКолонки	= 1;
		Область			= Макет.Область(ВерхОбласти - 1, НомерКолонки);
		ИмяКолонки		= Область.Текст;
		
		Пока ЗначениеЗаполнено(ИмяКолонки) Цикл
			
			Если ИмяКолонки = "Код" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(17)));
			ИначеЕсли ИмяКолонки = "Наименование" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
			ИначеЕсли ИмяКолонки = "КоррСчет" Тогда
				ТаблицаПоказателей.Колонки.Добавить("КоррСчет",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(43)));
			ИначеЕсли ИмяКолонки = "Город" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Город",Новый ОписаниеТипов("Булево"));
			ИначеЕсли ИмяКолонки = "Адрес" Тогда
				ТаблицаПоказателей.Колонки.Добавить("Адрес",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
			КонецЕсли;
			
			НомерКолонки	= НомерКолонки + 1;
			Область			= Макет.Область(ВерхОбласти - 1, НомерКолонки);
			ИмяКолонки		= Область.Текст;
			
		КонецЦикла;
		
		ФлагВхода = 0;
		
		Для НомерСтроки = ВерхОбласти По НизОбласти Цикл
			
			// Отображаем только элементы выбранной области			
			Код = СокрП(Макет.Область(НомерСтроки, 2).Текст);
			//Если СтрДлина(Код) = 2 Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Если Лев(Код, 2) = "УТ" Тогда 
				Если ФлагВхода = 0 Тогда  
					
					Если Код = КодРодителя Тогда 
						ФлагВхода = 1; 
					Иначе
						Продолжить;
					КонецЕсли;
					
				Иначе 
					Прервать;
				КонецЕсли;  
				
			ИначеЕсли ФлагВхода = 0 Тогда 
				Продолжить;
			КонецЕсли;
				
			СтрокаСписка = ТаблицаПоказателей.Добавить();
			
			Для Каждого Колонка Из ТаблицаПоказателей.Колонки Цикл
				ЗначениеКолонки = СокрП(Макет.Область(НомерСтроки, ТаблицаПоказателей.Колонки.Индекс(Колонка) + 1).Текст);
				СтрокаСписка[ТаблицаПоказателей.Колонки.Индекс(Колонка)] = ЗначениеКолонки;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//КолонкаТаблицыЗначений = ТаблицаПоказателей.Колонки[0];
	//ТаблицаПоказателей.Сортировать(КолонкаТаблицыЗначений.Имя + " Возр");
	
	Возврат ТаблицаПоказателей;

КонецФункции

Процедура ЗаполнитьКодБанкаВКоллекции(Коллекция, ПолеБанка, КодБанка, СоответствиеКодов, Отказ) Экспорт
	
	Для Каждого СтрокаТЧ Из Коллекция Цикл
		
		СтрокаКода = КодБанка.Найти(СтрокаТЧ[ПолеБанка],"ПолеБанка");
		
		
		Если СтрокаКода = Неопределено Тогда
			СтрокаКода = КодБанка.Найти(СтрокаТЧ[ПолеБанка].КлассификаторБанков,"ПолеБанка");
			Если СтрокаКода = Неопределено Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаКода.КодБанка = ПустаяСсылка() Тогда
			СтрокаТЧ.КодБанка = СтрокаКода.КодБанка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция ищет по коду элементы в справочнике Классификатор .
// Если их нет, то создает элементы справочника в соответствии с классификатором .
//
// Параметры:
//	Код - Строка - Строка с кодом классификатора ,
//	РежимОбновления - Булево - Истина, если признак записи объекта через метод ОбновлениеИнформационнойБазы.ЗаписатьОбъект().
//
// Возвращаемое значение:
//	СправочникСсылка.Классификатор - ссылка на элемент классификатора или Неопределено, если такого кода нет в .
//
Функция НайтиСоздатьЭлементКлассификатораБанка(Код, РежимОбновления = Ложь) Экспорт
	
	СуществующийЭлемент = Справочники.КлассификаторБанков.НайтиПоКоду(Код);
	
	Если Не ЗначениеЗаполнено(СуществующийЭлемент) Тогда 
		
		КодРодителя="";
		ТаблицаКлассификатора = ТаблицаКлассификатора(КодРодителя);
		ТаблицаКлассификатора.Индексы.Добавить("Код");
		
		СтруктураПоиска = Новый Структура("Код",Код);
		НайденныеСтроки = ТаблицаКлассификатора.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			СвойстваЭлемента = НайденныеСтроки[0];
			
			СправочникОбъект = Справочники.КлассификаторБанков.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СвойстваЭлемента);
			
			СправочникОбъект.ИНН = СвойстваЭлемента.ИНН;
			
			//Соответствие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора(СвойстваЭлемента.ЕдиницаИзмеренияКод,
			//																								РежимОбновления);
			//Если Соответствие <> Неопределено Тогда
			//	СправочникОбъект.ЕдиницаИзмерения = Соответствие[СвойстваЭлемента.ЕдиницаИзмеренияКод];
			//КонецЕсли;
			//
			//Если РежимОбновления Тогда
			//	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			//Иначе
			//	СправочникОбъект.Записать();
			//КонецЕсли;
			//
			//Возврат СправочникОбъект.Ссылка;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат СуществующийЭлемент;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли