///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ЧП "Плюс Софт"
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область ОписаниеПеременных

&НаКлиенте
Перем Wsh,Блокировка; 

&НаКлиенте
Перем JS_ДокументБраузера;

&НаКлиенте
Перем СтруктураКлюча;

&НаКлиенте
Перем СтрокаНаПодпись;

&НаКлиенте
Перем Идентификатор;

&НаКлиенте
Перем ПодписанныйТекст;

&НаКлиенте
Перем ПослеАвторизации;

#КонецОбласти

 #Область СлужебныеФункцииПриВводеДанных

 &НаСервереБезКонтекста
 Функция ПолучитьНоменклатуруНаСервере(pGTIN)
	 Если pGTIN="" тогда
		 Возврат Справочники.Номенклатура.ПустаяСсылка();
	 Иначе
		 Возврат Справочники.Номенклатура.НайтиПоРеквизиту("GTIN",pGTIN);
	 КонецЕсли;
 КонецФункции 

&НаКлиенте
Функция ПолучитьНомерСерииюИзДокумента(GTIN)
	
	НомерСерии="";
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		Если СтрокаДок.ВыборСтроки и СтрокаДок.GTIN=GTIN  тогда
			НомерСерии=СтрокаДок.НомерСерии;
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерСерии;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьЗаписьИзРеестра(КодМаркировки)
	
		ВозвратСтруктура=Новый Структура; 
	
		Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
		Запись.КодМаркировки=Кодмаркировки; 
		Запись.Прочитать();
		
		Если Запись.Выбран() тогда
			ВозвратСтруктура.Вставить("Выбран",Истина);
			ВозвратСтруктура.Вставить("КодМаркировки",Запись.КодМаркировки);
			ВозвратСтруктура.Вставить("КодSSCC1",Запись.КодSSCC1);
			ВозвратСтруктура.Вставить("Номенклатура",Запись.Номенклатура);
			ВозвратСтруктура.Вставить("НомерСерии",Запись.НомерСерии);
			ВозвратСтруктура.Вставить("ЕмкостьУпаковки",Запись.ЕмкостьУпаковки);
			ВозвратСтруктура.Вставить("Статус",Запись.Статус);
			ВозвратСтруктура.Вставить("ДокументПрихода",Запись.ДокументПрихода);
			ВозвратСтруктура.Вставить("ДокументРасхода",Запись.ДокументРасхода);
		Иначе
			ВозвратСтруктура.Вставить("Выбран",Ложь);
	    КонецЕсли;
		
		Возврат ВозвратСтруктура; 

КонецФункции

&НаКлиенте
Функция ПолучитьДанныеСтрокиДокумента()
	
	СтруктураВозврат=Новый Структура;
	Если Объект.ДокументОснование<>Неопределено тогда
		Для Каждого СтрокаДок из Объект.Контроль Цикл
	 		Если СтрокаДок.ВыборСтроки   тогда
				СтруктураВозврат.Вставить("GTIN",СтрокаДок.GTIN);
				СтруктураВозврат.Вставить("Номенклатура",СтрокаДок.Номенклатура);
				СтруктураВозврат.Вставить("НомерСерии",СтрокаДок.НомерСерии);
				прервать;
			КонецЕсли;
		КонецЦикла;     
	КонецЕсли;
	
	Если СтруктураВозврат.Количество()=0 тогда
		СтруктураВозврат.Вставить("GTIN","");
		СтруктураВозврат.Вставить("Номенклатура",ПолучитьНоменклатуруНаСервере("")); // пустая ссылка
		СтруктураВозврат.Вставить("НомерСерии","");
		Если Объект.ДокументОснование<>Неопределено тогда
			Сообщить("Не выбрана строка документа");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврат;
	
КонецФункции 
	

&НаКлиенте
Функция ПолучитьСериюНоменклатурыИзДокумента(GTIN)   // полное наименование
	
	НомерСерии="";
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		Если СтрокаДок.ВыборСтроки и СтрокаДок.GTIN=GTIN  тогда
			НомерСерии=СокрЛП(СтрокаДок.НомерСерии);  
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерСерии;
	
КонецФункции

#КонецОбласти	
	

#Область ИмпортИзCSV

&НаКлиенте 
Функция ПроверкаВыбораСтрок() 
	
	// проверка выбора строк  - оставляем выбор только для одинаковых строк GTIN+НомерСерии

	КоличВыбранныхСтрок=0;
	Для каждого КонтрольСтр Из Объект.Контроль Цикл  
		Если КонтрольСтр.ВыборСтроки  и КоличВыбранныхСтрок=0 тогда
			GTIN0=КонтрольСтр.GTIN;
			НомерСерии0=КонтрольСтр.НомерСерии;
			КоличВыбранныхСтрок=КоличВыбранныхСтрок+1;
		иначе	
			Если КонтрольСтр.GTIN<>GTIN0 или КонтрольСтр.НомерСерии<>НомерСерии0 тогда
				КонтрольСтр.ВыборСтроки=Ложь;
			иначе
				КоличВыбранныхСтрок=КоличВыбранныхСтрок+1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличВыбранныхСтрок; 
	
КонецФункции

&НаКлиенте 
Процедура ЗагрузкаИзCSV(Команда) 
	
	КоличВыбранныхСтрок=ПроверкаВыбораСтрок(); 
		
	Если КоличВыбранныхСтрок=0  тогда
		Если  Объект.ДокументОснование=Неопределено Тогда
			  КоличВыбранныхСтрок=1;
		иначе
			Сообщить("Выберите строки документа для загрузки");
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	Если КоличВыбранныхСтрок>0 Тогда
		ОчиститьСписокКМ();	// очистка с вопросом
	КонецЕсли;
	
	НачСпискаКМ=Объект.КодыСписок.Количество()+1;            // начало загруженных кодов
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите CSV файл'")+ "(*.CSV)|*.CSV";
	//+" |"+	НСтр("ru = 'Выберите CSV файл'")+ "(*.CSV)|*.CSV"   ; // если нужно несколько типов
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите CSV файл";
	
	ФлОшиб=0;
	Если Объект.ДокументОснование=Неопределено тогда     // загружаем один файл
		Если ДиалогОткрытияФайла.Выбрать() Тогда 
			ЗагрузитьИзФайла(ДиалогОткрытияФайла.ПолноеИмяФайла,1,ФлОшиб); 
		КонецЕсли;	
	иначе
		Для каждого КонтрольСтр Из Объект.Контроль Цикл 
			Если КонтрольСтр.ВыборСтроки=Ложь тогда
				продолжить;
			КонецЕсли;
			
			НомСтр=КонтрольСтр.НомерСтроки;
			//Емкость=КонтрольСтр.Емкость;      // для проверки полноты коробки
			
			Если ДиалогОткрытияФайла.Выбрать() Тогда 
				
				ЗагрузитьИзФайла(ДиалогОткрытияФайла.ПолноеИмяФайла,НомСтр,ФлОшиб); 
				
				Если ФлОшиб=1 тогда 
					возврат;
				Иначе
					Если НомСтр<КоличВыбранныхСтрок тогда 
						Режим = РежимДиалогаВопрос.ДаНет;
						Ответ = Вопрос("Файл загружен! Продолжить?" , Режим, 0);
						Если Ответ = КодВозвратаДиалога.Нет Тогда
							Прервать;
						КонецЕсли;
					конецЕсли;
				конецЕсли;
			Иначе
				продолжить;;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
	// если кода коробки  в файле нет - можно ввести
	Если ВведеноУпаковок>0 и СокрЛП(КодАгрегации)<>"" тогда
		Сообщить("Коды агрегации загружены из файла! Ввод нового кода агрегации не возможен!");
		КодАгрегации="";
		Элементы.КодАгрегации.Доступность=Ложь; 
	иначеЕсли СокрЛП(КодАгрегации)<>"" тогда
		Для каждого ТабСтрока Из Объект.КодыСписок Цикл  // запись кода агрегации 
			ТабСтрока.КодSSCC1=КодАгрегации;	
		КонецЦикла;
		ВведеноУпаковок=1;
		Элементы.КодАгрегации.Доступность=Ложь; 
	КонецЕсли;	


	Если  Объект.ДокументОснование<>Неопределено тогда   // контроль и подсчет количества по документу
		
		Для каждого ТабСтрока Из Объект.КодыСписок Цикл 
			Если ТабСтрока.НомерСтроки<НачСпискаКМ тогда Продолжить;  
			КонецЕсли;
			
			//Если Не ЗначениеЗаполнено(ТабСтрока.Товар) тогда продолжить; // если только коробки - не проверять
			//КонецЕсли;
			
			ТабСтрока.Проверка=Истина; 
			СтрокаДокумента=Неопределено;
			Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
				ТабСтрока.Проверка=Ложь; 
			иначе
				ТабСтрока.Проверка=Истина; 
				ТабСтрока.Номенклатура=СтрокаДокумента.Номенклатура;
				ТабСтрока.НомерСерии=СтрокаДокумента.НомерСерии; 
				//ТабСтрока.ЕмкостьУпаковки=СтрокаДокумента.Емкость;
			КонецЕсли;
		 КонецЦикла;
		
	КонецЕсли;	
 КонецПроцедуры  


&НаКлиенте
Процедура ЗагрузитьИзФайла(ПутьКФайлу,НомерСтрокиДокумента,ФлОшиб) 
		
	Документ= Новый ТекстовыйДокумент;
	Документ.Прочитать(ПутьКФайлу); 

	
	КодSSCC1Нач="0";
	НомерСтроки=1; 
	мВведеноУпаковок=0;
	мВведено=0;
	КоличКмВУпаковке=0;
	
	КолСтрок=Документ.КоличествоСтрок();

	КоличКмВУпаковке=Емкость;
 	ВложенныеУпаковки=Новый Структура;
	
	СтрокаКонтроль=ПолучитьДанныеСтрокиДокумента();

	ФлОшиб=0;

	Для Инд=НомерСтроки По КолСтрок Цикл
		СтрокаДокумента=Документ.ПолучитьСтроку(Инд);
		
		Если Прав(СтрокаДокумента,1)=";"  тогда
			ФлУпак=1;
		ИначеЕсли Лев(СтрокаДокумента,1)=";" Тогда
			ФлУпак=0;
		ИначеЕсли УпаковкаУровень>1 тогда	
			ФлУпак=1;
		//ИначеЕсли Лев(СтрокаДокумента,2)="01" и Сред(СтрокаДокумента,17,2)="21" Тогда
		//     ФлУпак=0;
        Иначе
            ФлУпак=0;
		КонецЕсли;	
			
		Если ФлУпак=1 тогда                                                    
			КодSSCC1=СокрЛП(СтрЗаменить(СтрокаДокумента,";",""));
			Если КодSSCC1=""  тогда продолжить;   // пропуск пустых строк
			КонецЕсли;
			
	 		Если Лев(КодSSCC1,2)="01" и Сред(КодSSCC1,17,2)="21"  тогда 
				Если ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда 
					Сообщить("Несоответствие структуры КМ выбраннму типу упаковки! Импорт прекращен!") ; 
					ТабСтрока=Объект.КодыСписок.Добавить();
					ТабСтрока.Товар=КодSSCC1; 
					ФлОшиб=1;
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если КодSSCC1Нач="0" тогда    // первый вход
				Если Инд>1 тогда
					Сообщить("Файл импорта содержит коды упаковок. Строки 1-"+Строка(Инд-1)+" не имеют кода упаковки! Импорт прекращен!");
					ФлОшиб=1;
					Возврат;
				Иначе
					Если УпаковкаУровень<=1  тогда
						Сообщить("Файл импорта содержит коды упаковок. Выберите транспортную упаковку! ");
						ФлОшиб=1;
					иначе
						ВложенныеУпаковки=ПолучитьПараметрыВложеннойУпаковки(УпаковкаЕдИзм,УпаковкаУровень);
					КонецЕсли;	
					Если ФлОшиб=1 тогда
						Возврат;
					иначе
						Элементы.Контроль.ПодчиненныеЭлементы.КонтрольСертификация.Видимость=Ложь;
						КодSSCC1Нач=КодSSCC1;
						мВведено=мВведено+КоличКмВУпаковке;
						КоличКмВУпаковке=0;
					Конецесли;
					
				Конецесли;
				
			ИначеЕсли КодSSCC1<>КодSSCC1Нач тогда 
				Если КоличКмВУпаковке <> Емкость  тогда
					//Если Объект.ДокументОснование=Неопределено тогда
						Если КоличКмВУпаковке > 0  тогда
							Сообщить("Отклонение! Код упаковки -"+КодSSCC1Нач+" - количество КМ "+Строка(КоличКмВУпаковке)); 
						КонецЕсли;	
					//КонецЕсли;
				КонецЕсли;;
				мВведеноУпаковок=мВведеноУпаковок+1;
				Если КоличКмВУпаковке=0 тогда      // только упаковка
					ТабСтрока=Объект.КодыСписок.Добавить();
					//ТабСтрока.КодSSCC1=КодSSCC1Нач; 
					ТабСтрока.Товар=КодSSCC1Нач; 
					ТабСтрока.Статус=0;
					ТабСтрока.ЕмкостьУпаковки=Емкость;
					ТабСтрока.Количество=УпаковкаКоличество;
					ТабСтрока.УровеньУпаковки=УпаковкаУровень;
					ТабСтрока.ТипУпаковки=ТипУпаковки;
					
					мВведено=мВведено+Емкость;
					Если Объект.ДокументОснование=Неопределено тогда
						ТабСтрока.Проверка=Истина;
						//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
					Иначе
						ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
						ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	
					Конецесли;
				КонецЕсли;
				КодSSCC1Нач=КодSSCC1; 
				мВведено=мВведено+КоличКмВУпаковке;
				КоличКмВУпаковке=0;
			КонецЕсли;	
			
			Продолжить;
		КонецЕсли;
		
		// вложенный код
		КоличКмВУпаковке=КоличКмВУпаковке+1;
		КодМаркировки=СокрЛП(СтрЗаменить(СтрокаДокумента,";",""));   
		
		ТабСтрока=Объект.КодыСписок.Добавить();
		ТабСтрока.Товар=КодМаркировки; 
		ТабСтрока.КодSSCC1=КодSSCC1; 
		ТабСтрока.Статус=0;

		Если ВложенныеУпаковки.Количество()>0 Тогда 
			ТабСтрока.ЕмкостьУпаковки=ВложенныеУпаковки.Емкость;
			ТабСтрока.Количество=ВложенныеУпаковки.Количество;
			ТабСтрока.УровеньУпаковки=ВложенныеУпаковки.УровеньУпаковки;
			ТабСтрока.ТипУпаковки=ВложенныеУпаковки.ТипУпаковки;
		иначе	
			ТабСтрока.ЕмкостьУпаковки=Емкость;
			ТабСтрока.Количество=УпаковкаКоличество;
			ТабСтрока.УровеньУпаковки=УпаковкаУровень;
			ТабСтрока.ТипУпаковки=ТипУпаковки; 
		КонецЕсли;  
		
		Если ТабСтрока.УровеньУпаковки<2 тогда         // потребительская или групповая
			ТабСтрока.Товар=УбратьКодПроверкиИКриптохвост(ТабСтрока.Товар,ТабСтрока.УровеньУпаковки,ТипТовара);
			ТабСтрока.GTIN=ПолучитьGTINПоКодуМаркировки(ТабСтрока.Товар,ТабСтрока.УровеньУпаковки,ТипТовара); 
			Если ТабСтрока.GTIN=Неопределено тогда
				Сообщить("Строка "+СтрЗаменить(Строка(ТабСтрока.НомерСтроки),Символ(160),"")+" КМ "+ТабСтрока.Товар+" не содержит GTIN! ");
			КонецЕсли;	
		иначе  // GTIN по документу
			ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
		КонецЕсли;
		
		ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	

			
		Если Объект.ДокументОснование=Неопределено тогда
			ТабСтрока.Проверка=Истина;
			//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
		Конецесли;
	КонецЦикла;  
	

	// последняя упаковка
	Если КодSSCC1<>Неопределено тогда
		Если КоличКмВУпаковке<>Емкость  тогда
			Если КоличКмВУпаковке > 0  тогда
				//Сообщить("Отклонение! Код коробки -"+КодSSCC1+" - количество КМ "+Строка(КоличКмВУпаковке)); 
				Сообщить("Отклонение! Код коробки -"+КодSSCC1+" - количество КМ "+Формат(КоличКмВУпаковке,"Ч10")); 
			КонецЕсли;	
			Если КоличКмВУпаковке=0 тогда      // только упаковка
				ТабСтрока=Объект.КодыСписок.Добавить();
				//ТабСтрока.КодSSCC1=КодSSCC1Нач; 
				ТабСтрока.Товар=КодSSCC1Нач; 
				ТабСтрока.Статус=0;
				ТабСтрока.ЕмкостьУпаковки=Емкость;
				ТабСтрока.Количество=УпаковкаКоличество;
				ТабСтрока.УровеньУпаковки=УпаковкаУровень;
				ТабСтрока.ТипУпаковки=ТипУпаковки;

				мВведено=мВведено+Емкость;
				Если Объект.ДокументОснование=Неопределено тогда
					ТабСтрока.Проверка=Истина;
					//ТабСтрока.Номенклатура=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);  
				Иначе
					ТабСтрока.GTIN=СтрокаКонтроль.GTIN;
					ТабСтрока.НомерСерии=СтрокаКонтроль.НомерСерии;	
				Конецесли;
			КонецЕсли;
		КонецЕсли;
		мВведеноУпаковок=мВведеноУпаковок+1
	КонецЕсли;
	
	Если Объект.ДокументОснование=Неопределено тогда
		//Введено=Объект.КодыСписок.Количество(); 
		Введено=мВведено;
		ВведеноУпаковок=мВведеноУпаковок;
	иначе
		//Емкость=0;       // по документу используется для построчного контроля
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти


&НаСервере
Процедура ЗаписатьКомплектациюНаСервере() 
	
	КоличПовторКМ=0;
	// проверка и запись кодов
		//МассивАгрегации=Новый Массив();
		МассивРазагрегации=Новый Массив();
	
		МассивКодов=Новый Массив();
		МассивУпаковок=Новый Массив();
		Для каждого ТабСтрока Из Объект.КодыСписок Цикл 
			Если ТабСтрока.Проверка=ложь тогда 
				продолжить;
			КонецЕсли;
			//Если ТабСтрока.Товар<>"" тогда
				Если МассивКодов.Найти(ТабСтрока.Товар)=Неопределено тогда
					МассивКодов.Добавить();
					МассивКодов[МассивКодов.ВГраница()]=ТабСтрока.Товар; 
					Если ТабСтрока.УровеньУпаковки>0 тогда
						МассивУпаковок.Добавить();
						МассивУпаковок[МассивУпаковок.ВГраница()]=ТабСтрока.Товар; 
					КонецЕсли;
				Иначе
					Сообщить("Строка "+СтрЗаменить(Строка(ТабСтрока.НомерСтроки),Символ(160),"")+" "+Табстрока.КодSSCC1+" "+ТабСтрока.Товар+"  Повтор КМ! ");
					КоличПовторКМ=КоличПовторКМ+1;
					ФлОшиб=1;
				КонецЕсли; 
			//ИначеЕсли ТабСтрока.КодSSCC1<>"" тогда
			//	Если МассивУпаковок.Найти(ТабСтрока.КодSSCC1)=Неопределено тогда
			//		МассивУпаковок.Добавить();
			//		МассивУпаковок[МассивУпаковок.ВГраница()]=ТабСтрока.КодSSCC1; 
			//		МассивКодов.Добавить();                                  // добавим коды коробок
			//		МассивКодов[МассивКодов.ВГраница()]=ТабСтрока.КодSSCC1;
			//	иначе	
			//		Сообщить("Строка "+СтрЗаменить(Строка(ТабСтрока.НомерСтроки),Символ(160),"")+" "+Табстрока.КодSSCC1+"  Повтор кода упаковки! ");
			//		КоличПовторКМ=КоличПовторКМ+1;
			//		ФлОшиб=1;
			//	КонецЕсли;
			//КонецЕсли;
		КонецЦикла;  
		
		Если ФлОшиб=1 Тогда
			Сообщить("Количество повторных кодов -"+Строка(КоличПовторКМ)+". Запись списка КМ не произведена! ");
			Возврат;
		КонецЕсли;	

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
			|	КодыМаркировки.ДокументПрихода.Ссылка КАК ДокументПрихода,
			|	КодыМаркировки.ДокументРасхода.Ссылка КАК ДокументРасхода,
			|	КодыМаркировки.Статус КАК Статус,
			|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
			|	КодыМаркировки.Номенклатура КАК Номенклатура,
			|	КодыМаркировки.КодSSCC1 КАК КодSSCC1
			|ИЗ
			|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
			|ГДЕ
			|	(КодыМаркировки.КодМаркировки В (&МассивКодов)
			|			ИЛИ КодыМаркировки.КодSSCC1 В (&МассивУпаковок))
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодМаркировки";
		
		Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
		Запрос.УстановитьПараметр("МассивУпаковок", МассивУпаковок);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Выборка = РезультатЗапроса.Выбрать();    

		Если Выборка.Количество()>0 тогда     // проверка найденных кодов  

			Пока Выборка.Следующий() Цикл
				//Если Лев(Выборка.КодМаркировки,2)="01" тогда   // нужно определить тип упаковки
					
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Товар", Выборка.КодМаркировки);
					НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
					ТабСтрока=Неопределено;
					Если НайденныеСтроки.Количество()>0  тогда 
						Если НайденныеСтроки[0].Проверка тогда 
							ТабСтрока=НайденныеСтроки[0];
						КонецЕсли;
					КонецЕсли;	 
					Если ТабСтрока<>Неопределено тогда 
						ФлОшибЗап=ПроверитьЗапись(Выборка,НайденныеСтроки[0]);
						Если ФлОшибЗап=1 тогда
							 ФлОшиб=1;
						КонецЕсли;
					иначе	//  поиск упаковки - в выборку КМ попал по агрегатному коду	
						ПараметрыОтбора = Новый Структура;
						//ПараметрыОтбора.Вставить("КодSSCC1", Выборка.КодSSCC1);
						ПараметрыОтбора.Вставить("Товар", Выборка.КодSSCC1);
						НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора); 
						Если НайденныеСтроки.Количество()>0 тогда   // разогрегация ошибка
							 //ФлОшиб=1;
							Если МассивРазагрегации.Найти(Выборка.КодSSCC1)=Неопределено тогда
								МассивРазагрегации.Добавить();
								МассивРазагрегации[МассивРазагрегации.ВГраница()]=Выборка.КодSSCC1; 
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли;	
				//Иначе	// агрегатный код	
				//	МассивАгрегации.Добавить();
				//	МассивАгрегации[МассивАгрегации.ВГраница()]=Выборка.КодМаркировки; 
				//	
				//	Если МассивРазагрегации.Найти(Выборка.КодSSCC1)=Неопределено тогда
				//		ПараметрыОтбора = Новый Структура;
				//		ПараметрыОтбора.Вставить("КодSSCC1", Выборка.КодМаркировки);
				//		НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
				//		Если НайденныеСтроки.Количество()>0 тогда
				//			ФлОшибЗап=ПроверитьЗапись(Выборка,НайденныеСтроки[0]);
				//			Если ФлОшибЗап=1 тогда
				//				 ФлОшиб=1;
				//			КонецЕсли;
				//		КонецЕсли;     
				//	КонецЕсли; 	
				//КонецЕсли;

				//Если НайденныеСтроки.Количество()>0 тогда 
				//	ФлОшибЗап=ПроверитьЗапись(Выборка,НайденныеСтроки[0].НомерСтроки);
				//	Если ФлОшибЗап=1 тогда
				//		 ФлОшиб=1;
				//	КонецЕсли;
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если МассивРазагрегации.Количество()>0 тогда    // вывод сообщений об ошибках разагрегации
			Для инд=0 по МассивРазагрегации.Количество()-1 Цикл
				
				//Если МассивАгрегации.Найти(МассивРазагрегации[инд])=Неопределено тогда   // агрегатного кода не было
				//	Продолжить;
				//КонецЕсли; 
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Товар", МассивРазагрегации[инд]);
				НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора); 
				Если НайденныеСтроки.Количество()>0 тогда   // разогрегация ошибка
					Сообщить("строка "+Строка(НайденныеСтроки[0].НомерСтроки)+" Код коробки "+НайденныеСтроки[0].Товар+" разагрегирован!") ; 
					ФлОшиб=1;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
			
		
		Если ФлОшиб=1 Тогда
			Сообщить("Есть ошибки. Запись списка КМ не произведена! ");
			Возврат;
		КонецЕсли;	
		
		// определим статус по документу основания
		Если Объект.ДокументОснование=Неопределено тогда
			мСтатус=0;
		Иначе
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")  тогда //приход 
				мСтатус=1;				
			ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
				мСтатус=3;
			КонецЕсли;
			Если Объект.ДокументОснование.Проведен тогда
				мСтатус=мСтатус+1;
			КонецЕсли;
		КонецЕсли;

		//запись статуса и связей с документами найденных кодов  
		Если Выборка.Количество()>0  Тогда         
			Выборка.Сбросить() ;
			Пока Выборка.Следующий() Цикл 
				Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
				Запись.КодМаркировки=Выборка.КодМаркировки; 
				Запись.Прочитать();
				Если Запись.Выбран() тогда
					Если (мСтатус=1 или мСтатус=2) и Запись.Статус=0 тогда
						Запись.ДокументПрихода=Объект.ДокументОснование; 
						Запись.Статус=мСтатус; 
						
						//обновить Номенклатуру и НомерСерии ,Емкость для уже введенных кодов
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Товар", Выборка.КодМаркировки);
						НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
						Если НайденныеСтроки.Количество()>0 тогда   
							Запись.КодSSCC1=НайденныеСтроки[0].КодSSCC1;
							Запись.Номенклатура=НайденныеСтроки[0].Номенклатура;
							Запись.НомерСерии=НайденныеСтроки[0].НомерСерии;
							Запись.КоличествоЕдиницТовара=НайденныеСтроки[0].Количество;
							Запись.ТипУпаковки=НайденныеСтроки[0].ТипУпаковки;
							Запись.ЕмкостьУпаковки=НайденныеСтроки[0].ЕмкостьУпаковки;
						КонецЕсли;
						
						Запись.Записать(); 
						
					ИначеЕсли (мСтатус=3 или мСтатус=4) и Запись.Статус=2 тогда
						Запись.ДокументРасхода=Объект.ДокументОснование;
						Запись.Статус=мСтатус;
						Запись.Записать(); 
					КонецЕсли;	 
				КонецЕсли;
				
				Инд=МассивКодов.Найти(Выборка.КодМаркировки);
				Если Не Инд=Неопределено тогда
					МассивКодов.Удалить(инд);
				КонецЕсли;	
			КонецЦикла; 
		конецЕсли;
		
		// запись оставшихся новых кодов 
		//Если ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Для Каждого ТабСтр из Объект.КодыСписок Цикл
				//Если ТабСтр.Товар<>"" тогда
					ЗначениеКода=ТабСтр.Товар;
				//Иначе
				//	//ЗначениеКода=ТабСтр.КодSSCC1;
				//КонецЕсли;	
				
				Инд=МассивКодов.Найти(ЗначениеКода);
				Если Инд=Неопределено тогда
					продолжить;
				КонецЕсли;	
				
				Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
				Запись.КодМаркировки=ТабСтр.Товар; 
				Запись.Прочитать();
				Если Не Запись.Выбран() тогда
					Запись.КодSSCC1=ТабСтр.КодSSCC1;
					Запись.КодМаркировки=ЗначениеКода;;
					Запись.КоличествоЕдиницТовара=ТабСтр.Количество;
					Запись.Номенклатура=ТабСтр.Номенклатура;
					Запись.НомерСерии=ТабСтр.НомерСерии; 
					Запись.ТипУпаковки=ТабСтр.ТипУпаковки;
					Запись.ЕмкостьУпаковки=ТабСтр.ЕмкостьУпаковки;
					Запись.Статус=мСтатус;
					Если мСтатус=1 или мСтатус=2 тогда
						Запись.ДокументПрихода=Объект.ДокументОснование;
					ИначеЕсли мСтатус=3 или мСтатус=4 тогда         // только если разагрегация
						Запись.ДокументПрихода=ТабСтр.ДокументПрихода; 
						Запись.ДокументРасхода=Объект.ДокументОснование; 	
					КонецЕсли;
					Запись.Записать();
					// корректировка количества записи-коробки 
					Если мСтатус=3 или мСтатус=4 тогда   // только если разагрегация
						Запись.КодМаркировки=ТабСтр.КодSSCC1; 
						Запись.Прочитать();
						Если Запись.Выбран() тогда
							Запись.КоличествоЕдиницТовара=Запись.КоличествоЕдиницТовара-1;	
							Запись.Записать();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		//КонецЕсли;
		Если Объект.ДокументОснование=Неопределено тогда 
			Сообщить("Выполнена запись кодов маркировки в реестр "); 
		Иначе
			// обновить таблицу импорта 
			Для Каждого ТабСтр из Объект.КодыСписок Цикл
				Если ТабСтр.Проверка=Ложь тогда
					Продолжить;
				КонецЕсли;
				
				ТабСтр.Статус=мСтатус;
				Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда //приход
					ТабСтр.ДокументПрихода=Объект.ДокументОснование;
				Иначе	
					ТабСтр.ДокументРасхода=Объект.ДокументОснование; 
				КонецЕсли;	
			КонецЦикла;
			
			//ДокОбъект=Объект.ДокументОснование.ПолучитьОбъект();
			//ДокОбъект.ИмпортКодовМаркировки=Истина; 
			//ДокОбъект.Записать();
			
			Сообщить("Записаны коды маркировки для документа "+Объект.ДокументОснование); 
		КонецЕсли;	

		            
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомплектацию(Команда) 
	
	//ДокОбъект=Объект.ДокументОснование.ПолучитьОбъект();
	//Если ДокОбъект.ИмпортКодовМаркировки=Истина тогда 
	//	Сообщить(" Запись кодов маркировки по документу "+Объект.ДокументОснование+" уже производилась!" );
	//	Возврат;
	//КонецЕсли;
	
	Если Объект.КодыСписок.Количество()=0 Тогда
		Сообщить("Заполните таблицу Комплектация товара!");
		Возврат;
	КонецЕсли;
	
	// проверка 
	
	НомерСтроки=0;
	ФлЗаписи=Истина;
	ФлОшиб=0;
	Для Каждого ТабСтрока из Объект.Контроль Цикл  
		НомерСтроки=НомерСтроки+1;
		Если ТабСтрока.Количество-Табстрока.Сертификация<>ТабСтрока.КоличествоКМ тогда
				Сообщить("Строка "+Строка(ТабСтрока.НомерСтроки)+" (Контроль по документу) - Количество товаров в документе основания не совпадает с количеством КМ");
				ФлОшиб=1;
			Возврат;
		КонецЕсли;	
	КонецЦикла;	  

	Если ФлОшиб=1 тогда возврат;
	КонецЕсли;	
	
	ЗаписатьКомплектациюНаСервере();
КонецПроцедуры

#Область  ОткрытьОбработку 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ДокументОснование") тогда

		Объект.ДокументОснование=Параметры.ДокументОснование; 
		
		Для каждого ТабСтрока из Параметры.ДокументОснование.Товары Цикл 
			ДокСтрока=Объект.Контроль.Добавить();                                
			Если Не ТабСтрока.Серия.Пустая() тогда
				ДокСтрока.НомерСерии=ТабСтрока.Серия.Наименование; 
			КонецЕсли;	
			//ДокСтрока.Емкость=ТабСтрока.Серия.ЕмкостьУпаковки;
			ДокСтрока.Номенклатура=ТабСтрока.Номенклатура;
			ДокСтрока.GTIN=ТабСтрока.Номенклатура.GTIN;
			ДокСтрока.Количество=ТабСтрока.Количество;
			ДокСтрока.ТипТовара=ТабСтрока.Номенклатура.ВидНоменклатуры.ОсобенностьУчета;
			
			Если ТипЗнч(Объект.ДокументОснование)<>Неопределено  и 	ДокСтрока.НомерСтроки=1 тогда
				ДокСтрока.ВыборСтроки=Истина;
				GTIN1=ДокСтрока.GTIN;
				НомерСерии1=ДокСтрока.НомерСерии;
			ИначеЕсли ТипЗнч(Объект.ДокументОснование)<>Неопределено  и ДокСтрока.НомерСтроки>1 тогда
				Если ДокСтрока.GTIN=GTIN1 и ДокСтрока.НомерСерии=НомерСерии1 тогда
					ДокСтрока.ВыборСтроки=Истина;
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПроверитьРаботуСДокументами(Отказ)
	ВыборкаСправочника = Справочники.Блокировки.Выбрать();
	Пока ВыборкаСправочника.Следующий() Цикл  
		Если ВыборкаСправочника.Ссылка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ тогда
			продолжить;
		КонецЕсли;
		
		Если   НЕ ВыборкаСправочника.ДокументОснование.Пустая() тогда
			Сообщить("Пользователь " + ВыборкаСправочника.Наименование+" работает с документом "+ВыборкаСправочника.ДокументОснование);
			Отказ=Истина;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры 

&НаСервере
Функция ЗаблокироватьОбработку()
	
	Блокировка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ.ПолучитьОбъект();  
	Попытка
		Блокировка.Заблокировать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции 

&НаСервере
Функция ЗаполнитьРеквизиты(ДокументОснованиеСсылка)
	ДокументОснованиеОбъект=ДокументОснованиеСсылка.ПолучитьОбъект(); 
	ТекстДекорации = Формат(
	" Склад: " + ДокументОснованиеОбъект.Склад.Наименование +
	" Контрагент: "+ ДокументОснованиеОбъект.Контрагент.Наименование +
	" Договор: " + ДокументОснованиеОбъект.Договор.Наименование, ""); 
	
	
	СоответствиеВозврат=Новый Соответствие;
	СоответствиеВозврат.Вставить("Организация",ДокументОснованиеОбъект.Организация); 
	СоответствиеВозврат.Вставить("ТекстДекорации",ТекстДекорации); 
	
	Возврат СоответствиеВозврат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Если  Объект.ДокументОснование=Неопределено тогда
		// проверим работают ли с документами пользователи 
		ПроверитьРаботуСДокументами(Отказ);
		
		
		Если Отказ тогда
			Сообщить("Работа в режиме 'без привязки к документам' заблокирована. Попробуйте позже!");
		иначе
			Если НЕ ЗаблокироватьОбработку() Тогда
				Сообщить("С обработкой уже работают в режиме 'без привязки к документам'. Попробуйте позже!");
				Отказ=истина;
			КонецЕсли;
		КонецЕсли;

	Иначе
		
		РеквизитыСоответствие=ЗаполнитьРеквизиты(Объект.ДокументОснование);
		
		Организация=РеквизитыСоответствие.Получить("Организация");
		ТекстДекорации=РеквизитыСоответствие.Получить("ТекстДекорации");

		
		Элементы.Организация.Доступность=Ложь;
		
		Элементы.ДекорацияИнформация.Заголовок=ТекстДекорации;
		
		
		Элементы.ГруппаАгрегацииРазагрегации.Видимость=Ложь;
		//Элементы.Разагрегация.Видимость=Ложь;
		//Элементы.КодАгрегации.Видимость=Ложь;
		//Элементы.Емкость.Видимость=Ложь;
		//Элементы.Введено.Видимость=Ложь;
		//Элементы.ВведеноУпаковок.Видимость=Ложь;
		
		Элементы.ДекорацияПредупреждение.Видимость=Ложь;
	
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Элементы.НеПолныйКод.Видимость=Истина;
			Элементы.КонтрольСертификация.Видимость=Ложь; 
			Элементы.Разагрегация.Видимость=Истина;
		КонецЕсли;
	КонецЕсли; 
	

	// заполним списокивыбора упаковки
	УпаковкаКоличествоЗаполнитьСписокВыбора();
	
	//Упаковка=1;
	СтрКонтроль=Объект.Контроль.Получить(0);
	ТипТовара=СтрКонтроль.ТипТовара;
	
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета");
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеСредства");
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.СоковаяПродукция");
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция");
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.УпакованнаяВода"); 
	//ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка");
	
	ОшибкаВвода=Ложь; 
	wsh=Новый COMОбъект("WScript.Shell"); 
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормыИКонтрольВведенныхДанных 

&НаКлиенте
Процедура ТоварыСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
  	Если  Разагрегация   тогда       // по документу расхода
		Если СокрЛП(КодАгрегации)="" тогда
			Сообщить("Введите код коробки для разагрегации!");
			Отказ=Истина;
			возврат;
		КонецЕсли;
	Иначе
        // агрегация без документа
		Если СокрЛП(КодАгрегации)<>"" и Емкость=0   тогда
			Сообщить("Введите емкость упаковки!");
			Отказ=Истина;
			возврат;
		ИначеЕсли СокрЛП(КодАгрегации)<>"" и Емкость=Введено  тогда
			Сообщить("Введите новый код агрегации!"); 
			Элементы.КодАгрегации.Доступность=истина;
			Элементы.Емкость.Доступность=истина;
			КодАгрегации="";
			Введено=0;
			Отказ=Истина;
			возврат;
		КонецЕсли;	
	КонецЕсли;	

	Если ОшибкаВвода тогда
		Отказ=Истина;
		ОшибкаВвода=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписокПередУдалением(Элемент, Отказ)
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	//Остаток= ТабСтрока.Количество;
	
	Если ТабСтрока.Проверка и  Объект.ДокументОснование<>неопределено тогда   // есть документ
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Вы действительно хотате удалить строку "+ТабСтрока.НомерСтроки+"?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли;
		ПересчетКоличестваКМДокументаОснования(ТабСтрока);
	КонецЕсли;	
	
	Если ТабСтрока.Проверка и  Объект.ДокументОснование=неопределено тогда   // нет документа
		Введено=Введено-1;
		Если  Емкость<>0 Тогда
			ВведеноУпаковок=Цел(Введено/Емкость);
		КонецЕсли;
	иначеЕсли Разагрегация и СокрЛП(КодАгрегации)=ТабСтрока.КодSSCC1 и ТабСтрока.НовыйКод тогда	
		Введено=Введено-1;		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПересчетКоличестваКМДокументаОснования(ТабСтрока)
	
	Остаток= ТабСтрока.Количество;
	Для Каждого СтрокаДок из Объект.Контроль Цикл
			Если СтрокаДок.GTIN=ТабСтрока.GTIN и СтрокаДок.НомерСерии=ТабСтрока.НомерСерии Тогда
				Если СтрокаДок.КоличествоКМ >= Остаток Тогда
					//Если ТабСтрока.Количество=1 и  СтрокаДок.КоличествоКоробок>0 тогда
					//Если ТабСтрока.Количество=1 и  СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоУпаковок*СтрокаДок.Емкость тогда
					//	Продолжить;    // должны быть еще строки
					//КонецЕсли;	
					СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ-Остаток;
					Остаток=0;
				иначе
					Остаток=Остаток-СтрокаДок.КоличествоКМ;
					СтрокаДок.КоличествоКМ=0;
				КонецЕсли;	
					//Если  СтрокаДок.Емкость<>0 Тогда
					//	СтрокаДок.КоличествоУпаковок=Цел(СтрокаДок.КоличествоКМ/СтрокаДок.Емкость);
					//КонецЕсли;
				Если Остаток=0 тогда прервать;	
				КонецЕсли;	
			КонецЕсли;	 
		КонецЦикла	 
 КонецПроцедуры   




&НаКлиенте
Процедура ТоварыСписокТоварОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОшибкаВвода=Ложь;
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	КМ=Элемент.ТекстРедактирования; 
	
	//// убираем коды 29
	//Если Сред(КМ,32,1)=Символ(29) и Сред(КМ,39,1)=Символ(29) тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,33,6);      
	//	КМ3=Сред(КМ,40);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//
	//// убираем символы 029
	//иначеЕсли Сред(КМ,32,3)="029" и Сред(КМ,41,3)="029" тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,35,6);      
	//	КМ3=Сред(КМ,44);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//КонецЕсли; 
	//
	//Если НеПолныйКод и СтрДлина(КМ)>31 Тогда
	//	КМ=Лев(КМ,31);
	//КонецЕсли;
	
	//проверка структуры КМ
	//Если Лев(КМ,2)<>"01" и Сред(КМ,17,2)<>"21"  тогда
	//	ОшибкаВвода=Истина;
	//	Сообщить("Ошибка в структуре КМ! "+КМ) ; 
	//иначе
		// проверка на повтор ввода  
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Товар", КМ);
		МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество()>0 тогда
			Сообщить("Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ;
			Текст="";
			Ошибкаввода=Истина;
		КонецЕсли;	
	//КонецЕсли;
	
	Если ОшибкаВвода тогда
		СтандартнаяОбработка=ложь;   
		wsh=Новый COMОбъект("WScript.Shell"); 
		wsh.SendKeys("{Esc}"); 
	конецесли;	
	
	Если ОшибкаВвода=Ложь Тогда
		ОкончаниеВводаТекста=Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РазагрегацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Разагрегация тогда
		Элементы.КодАгрегации.Видимость=Истина;
		Элементы.Емкость.Видимость=Истина;
		Элементы.Емкость.ТолькоПросмотр=Истина;
		Элементы.Введено.Видимость=Истина;
		Упаковка=1;
		Элементы.Упаковка.Доступность=Ложь;
	    Элементы.ГруппаТоварыСписок.ПодчиненныеЭлементы.ТоварыСписокТовар.Доступность=Истина;	
		Элементы.ГруппаТоварыСписок.ПодчиненныеЭлементы.ТоварыСписокКодSSCC1.Доступность=Ложь;	
	иначе
		Элементы.КодАгрегации.Видимость=Ложь;
		Элементы.Емкость.Видимость=Ложь;
		Элементы.Введено.Видимость=Ложь;
		Элементы.Упаковка.Доступность=Истина;
		КодАгрегации="";
		Емкость=0;
		Введено=0;
	конецесли;
	
КонецПроцедуры



&НаСервере	
Функция ПроверитьЗапись(Запись,НомерСтроки) 
	SGTIN=СокрЛП(Запись.КодSSCC1)+" "+Лев(Запись.КодМаркировки,31); 
	ФлОшибПров=0;
	Если Объект.ДокументОснование=неопределено тогда
		Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!"); 
		ФлОшибПров=1;
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда //расход  
		Если Запись.Статус<2 тогда
			Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" не оприходован!") ; 
			ФлОшибПров=1;
		ИначеЕсли Запись.Статус>2 Тогда
			Если  Объект.ДокументОснование.Ссылка<>Запись.ДокументРасхода.Ссылка тогда
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже связан с другим документом реализации!");
			иначе
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!");
			КонецЕсли;	
			ФлОшибПров=1;
		КонецЕсли;
	иначе
		Если Запись.Статус>2 тогда
			Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже в обороте - есть связь с документом реализации!"); 
			ФлОшибПров=1;
		ИначеЕсли Запись.Статус<>0 Тогда
			Если Объект.ДокументОснование.Ссылка<>Запись.ДокументПрихода.Ссылка тогда
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже связан с "+Запись.ДокументПрихода.Ссылка);
			иначе	
				Сообщить("строка "+Строка(НомерСтроки)+" КМ "+SGTIN+" уже записан!");
			КонецЕсли;	
			ФлОшибПров=1;
		КонецЕсли;	
	КонецЕсли; 

	Возврат ФлОшибПров;
КонецФункции

&НаКлиенте
Функция КонтрольПоДокументу(GTIN,КоличКодов,НомерСтроки,СтрокаДокументаВыбор);
	
	ФлGTIN=0;
	ФлВыборСтроки=0;
	СтрокаДокументаВыбор=Новый Структура;
	
	Остаток=КоличКодов;
	Откат=Новый Массив(Объект.Контроль.Количество()+1);
	
	Для Каждого СтрокаДок из Объект.Контроль Цикл
		
		Если СтрокаДок.ВыборСтроки=Ложь тогда продолжить;
		КонецЕсли;
		
		ФлВыборСтроки=1;
		НомерСерии=""; 
		
		
		Откат[СтрокаДок.НомерСтроки]=СтрокаДок.КоличествоКМ; // сохраним старое значение
		
		Если СтрокаДок.GTIN<>GTIN  тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДок.GTIN=GTIN Тогда 
			
			Если ФлGTIN=0 тогда 
				СтрокаДокументаВыбор.Вставить("GTIN",GTIN);
				СтрокаДокументаВыбор.Вставить("Номенклатура",СтрокаДок.Номенклатура); 
				СтрокаДокументаВыбор.Вставить("НомерСерии",СтрокаДок.НомерСерии);
				//СтрокаДокументаВыбор.Вставить("Емкость",СтрокаДок.Емкость); 
				ФлGTIN=1;
			КонецЕсли;
			
			Разность=СтрокаДок.Количество-СтрокаДок.Сертификация-СтрокаДок.КоличествоКМ;
			Если Разность>=Остаток тогда
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Остаток;
				Остаток=0;
			иначе
				СтрокаДок.КоличествоКМ=СтрокаДок.КоличествоКМ+Разность;
				Остаток=Остаток-Разность;
			КонецЕсли;
			
			//Если СтрокаДок.Емкость<>0 Тогда
			//	СтрокаДок.КоличествоУпаковок=Цел(СтрокаДок.КоличествоКМ/СтрокаДок.Емкость);
			//КонецЕсли;	
			
			Если Остаток=0 тогда прервать;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Если ФлВыборСтроки=0 и Не Объект.ДокументОснование=Неопределено тогда 
		Сообщить("Выберите строку(строки при совпадении серий) для подсчета введеных кодов "); 
		Возврат Ложь;
		
	ИначеЕсли ФлGTIN=0 и Не Объект.ДокументОснование=Неопределено тогда 
		Сообщить("строка "+Строка(НомерСтроки)+"GTIN в документе не найден!"); 
		Возврат Ложь;
	КонецЕсли;
	
	Если Остаток>0  тогда 
		Сообщить("строка "+Строка(НомерСтроки)+" количество единиц  товара в КМ превышает количество в документе!");
		// восстановим старые значения
		Для Каждого СтрокаДок из Объект.Контроль Цикл
			Если Откат[СтрокаДок.НомерСтроки]= Неопределено тогда продолжить;
			КонецЕсли;
			СтрокаДок.КоличествоКМ=Откат[СтрокаДок.НомерСтроки] // восстановим старое значение
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
		
&НаКлиенте
Процедура ТоварыСписокТоварПриИзменении(Элемент)
	
	Если  Не ОкончаниеВводаТекста тогда  Возврат;
	КонецЕсли;
	
	ОкончаниеВводаТекста=Ложь;
	
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	//КМ=ТабСтрока.Товар;  
	УбратьКодПроверкиИКриптохвост(ТабСтрока.Товар,УпаковкаУровень,ТипТовара);

	//Если Сред(КМ,32,1)=Символ(29) и Сред(КМ,39,1)=Символ(29) тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,33,6);      
	//	КМ3=Сред(КМ,40);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//	
	//	// убираем символы 029
	//иначеЕсли Сред(КМ,32,3)="029" и Сред(КМ,41,3)="029" тогда
	//	КМ1=Сред(КМ,1,31); 
	//	КМ2=Сред(КМ,35,6);      
	//	КМ3=Сред(КМ,44);      
	//	
	//	КМ=КМ1+КМ2+КМ3;
	//КонецЕсли; 
	
	//Если НеПолныйКод и СтрДлина(КМ)>31 Тогда
	//	КМ=Лев(КМ,31);
	//КонецЕсли;
	
	//ТабСтрока.Товар=КМ;
	
	// проверка на повтор ввода  
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Товар", ТабСтрока.Товар);
	МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>1 тогда
		//Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
		Сообщить("Повтор КМ при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
		ТабСтрока.Проверка=Ложь;
		ОшибкаВвода=Истина;
		ТабСтрока.Товар="";
		Возврат;
	КонецЕсли;	
	
	СтрокаДокументаВыбор=ПолучитьДанныеСтрокиДокумента(); 
	
	Если Лев(ТабСтрока.Товар,2)="01" и Сред(ТабСтрока.Товар,17,2)="21"  тогда 
		Если ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда 
			Сообщить("Несоответствие структуры КМ выбраннму типу упаковки! (строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
			ТабСтрока.Проверка=Ложь;
			ОшибкаВвода=Истина;
			//ТабСтрока.Товар="";
			возврат;
		КонецЕсли;
		
		ТабСтрока.GTIN=Сред(ТабСтрока.Товар,3,14);
		// поищем в справочнике 
		НоменклатураСсылка=ПолучитьНоменклатуруНаСервере(ТабСтрока.GTIN);
		Если НоменклатураСсылка.Пустая() тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Номенклатура по GTIN не найдена!") ; 
			ТабСтрока.Проверка=Ложь;
			ОшибкаВвода=Истина;
			Возврат;
		КонецЕсли;
		
		ТабСтрока.Номенклатура=НоменклатураСсылка;
	Иначе 
		Если ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка") или 
			ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка") тогда 
			Сообщить("Несоответствие структуры КМ выбранному типу упаковки! (строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
			ТабСтрока.Проверка=Ложь;
			ОшибкаВвода=Истина;
			//ТабСтрока.Товар="";
			возврат;
		КонецЕсли;
		
		//для транспортных кодов - по документу;
		ТабСтрока.GTIN=СтрокаДокументаВыбор.GTIN;
		ТабСтрока.Номенклатура=СтрокаДокументаВыбор.Номенклатура;
	КонецЕсли;	
	
	ТабСтрока.Количество=УпаковкаКоличество;      // зависит от выбраной упаковки 
	ТабСтрока.ЕмкостьУпаковки=Емкость;      
	ТабСтрока.УровеньУпаковки=УпаковкаУровень; 
	ТабСтрока.ТипУпаковки=ТипУпаковки; 
	ТабСтрока.НомерСерии=СтрокаДокументаВыбор.НомерСерии;   // предварительная запись

	ФлОшиб=0;
	
	Запись=ПрочитатьЗаписьИзРеестра(Табстрока.Товар);
	
	Если Запись.Выбран тогда 
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")и Разагрегация=Истина тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Разагрегация: код КМ "+ ТабСтрока.Товар+" в реестре уже есть! Код коробки "+Запись.КодSSCC1) ; 
			ФлОшиб=1;
		иначе
			ТабСтрока.КодSSCC1=Запись.КодSSCC1;
			ТабСтрока.Статус=Запись.Статус;
			ТабСтрока.ДокументПрихода=Запись.ДокументПрихода;
			ТабСтрока.ДокументРасхода=Запись.ДокументРасхода; 
			ТабСтрока.НомерСерии=Запись.НомерСерии;
			
			Если ТабСтрока.ЕмкостьУпаковки<>Запись.ЕмкостьУпаковки и Запись.Статус >0 тогда
				Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Емкость упаковки не совпадает с емкостью  в реестре уже записанного КМ ") ; 
				ФлОшиб=1;
			КонецЕсли;	 
			
			// проверка серии
			
			
			Если СокрЛП(Запись.НомерСерии)="" и Запись.Статус=0 тогда
			     ТабСтрока.НомерСерии=СтрокаДокументаВыбор.НомерСерии;   // код введен без документа или был очищен
			ИначеЕсли СокрЛП(ТабСтрока.НомерСерии)<>СокрЛП(СтрокаДокументаВыбор.НомерСерии)  тогда
				Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Серия КМ не совпадает с серией выбраной строки документа!") ; 
				ФлОшиб=1;
			иначе	
				ФлОшибЗап=ПроверитьЗапись(Запись,ТабСтрока.Номерстроки);  /////////....\\
				Если ФлОшибЗап=1 тогда
					ФлОшиб=1;
				КонецЕсли;
			КонецЕсли;	 
		КонецЕсли;	 
			
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		
		Если Разагрегация тогда   // ищем агрегатный код 
			
			Запись=ПрочитатьЗаписьИзРеестра(КодАгрегации);

			Если Запись.Выбран тогда
				ТабСтрока.КодSSCC1=КодАгрегации;
				ТабСтрока.Статус=Запись.Статус;
				ТабСтрока.Номенклатура=Запись.Номенклатура;
				ТабСтрока.ДокументПрихода=Запись.ДокументПрихода;
				ТабСтрока.ДокументРасхода=Запись.ДокументРасхода; 
				ТабСтрока.НомерСерии=Запись.НомерСерии;
				ТабСтрока.ЕмкостьУпаковки=Запись.ЕмкостьУпаковки;
				ТабСтрока.Количество=Запись.Количество;
				ТабСтрока.НовыйКод=Истина;
				Введено=Введено+1;
				Если Введено>Запись.ЕмкостьУпаковки тогда
					Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Количество введенных КМ превышает емкость упаковки! ") ; 
					ФлОшиб=1;
				КонецЕсли;
			Иначе
				Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Код Разагрегации в реестре не найден! Разагрегация не возможна!") ; 
				ФлОшиб=1;
			КонецЕсли;
		Иначе	
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" КМ нет в реестре! Реализация не возможна!") ; 
			ФлОшиб=1;
		КонецЕсли;
		
	КонецЕсли;

	Если ФлОшиб=1 тогда 
		ТабСтрока.Проверка=Ложь; 
		ОшибкаВвода=Истина;
		Возврат;
		// проверка соответствия документу 
	иначеЕсли объект.ДокументОснование <> неопределено тогда
		СтрокаДокумента=Неопределено;
		Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
			ТабСтрока.Проверка=Ложь; 
			ОшибкаВвода=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	ТабСтрока.Проверка=Истина;
	//Если СтрокаДокумента.Количество()>0 тогда // структура заполнена 
	//	ТабСтрока.НомерСерии=СтрокаДокумента.НомерСерии;
	//	ТабСтрока.ЕмкостьУпаковки=СтрокаДокумента.Емкость;
	//КонецЕсли;
		
	Если Объект.ДокументОснование=Неопределено и СокрЛП(ТабСтрока.КодSSCC1)="" тогда
		ТабСтрока.КодSSCC1=КодАгрегации; 
		Введено=Введено+1; 
		Если Емкость<>0 Тогда
			ВведеноУпаковок=Цел(введено/емкость);
		КонецЕсли;
		
		Если Введено=1 тогда
			Элементы.КодАгрегации.Доступность=Ложь;
			Элементы.Емкость.Доступность=Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписокКодSSCC1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ОшибкаВвода=Ложь;
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	КодSSCC1=Элемент.ТекстРедактирования;   
	
	// проверка на повтор ввода  
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КодSSCC1", КодSSCC1);
	МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>0 тогда
		Сообщить("Повтор Кода коробки при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ;
		Текст="";
		Ошибкаввода=Истина;
		СтандартнаяОбработка=ложь; 
		
		//wsh1=Новый COMОбъект("WScript.Shell"); 
		//wsh1.SendKeys("{Esc}"); 
		wsh.SendKeys("{Esc}"); 
	КонецЕсли;
	
	Если ОшибкаВвода=Ложь Тогда
		ОкончаниеВводаТекста=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКодSSCC1ВРеестре(НомерСтроки,КодSSCC,СтрокаДокумента)
	
	Результат=Новый Соответствие;
	
	// поиск в реестре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировки.Номенклатура КАК Номенклатура,
		|	КодыМаркировки.Статус КАК Статус,
		|	КодыМаркировки.ДокументПрихода КАК ДокументПрихода,
		|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
		|	КодыМаркировки.Номенклатура.GTIN КАК GTIN,
		|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
		|	КодыМаркировки.КодSSCC1 КАК КодSSCC1,
		|	КодыМаркировки.НомерСерии КАК НомерСерии,
		|	КодыМаркировки.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ИЗ
		|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
		|ГДЕ
		|	КодыМаркировки.КодSSCC1 = &КодSSCC
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("КодSSCC", КодSSCC);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ФлОшиб=0; 
	КоличКм=0;

	Если ВыборкаДетальныеЗаписи.Количество()=0 тогда  
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда	
			Сообщить("строка "+Строка(НомерСтроки)+" Код упаковки в реестре КМ не найден!") ;   
			ФлОшиб=1;
		иначе // по документу
			//СтрокаДокумента=ПолучитьДанныеСтрокиДокумента();
			GTIN0=СтрокаДокумента.GTIN;
			Номенклатура0=СтрокаДокумента.Номенклатура;	
			НомерСерии0=СтрокаДокумента.НомерСерии;
			//ЕмкостьУпаковки0=СтрокаДокумента.Емкость;
			//КоличКМ=ЕмкостьУпаковки0;
		КонецЕсли;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество()=1 и 
		ВыборкаДетальныеЗаписи.КодSSCC1=ВыборкаДетальныеЗаписи.КодМаркировки тогда  // целая коробка 	
		
		ВыборкаДетальныеЗаписи.Следующий();		
		КоличКм=ВыборкаДетальныеЗаписи.КоличествоЕдиницТовара;
		GTIN0=ВыборкаДетальныеЗаписи.GTIN;
		Номенклатура0=ВыборкаДетальныеЗаписи.Номенклатура;	
		Статус0=ВыборкаДетальныеЗаписи.Статус;
		ДокПрихода0=ВыборкаДетальныеЗаписи.ДокументПрихода;
		ДокРасхода0=ВыборкаДетальныеЗаписи.ДокументРасхода;
		НомерСерии0=ВыборкаДетальныеЗаписи.НомерСерии;
		ЕмкостьУпаковки0=ВыборкаДетальныеЗаписи.ЕмкостьУпаковки;
		ФлОшибЗап=ПроверитьЗапись(ВыборкаДетальныеЗаписи,НомерСтроки);
		Если ФлОшибЗап=1 тогда
			ФлОшиб=1;
		КонецЕсли;

	иначе
		// проверка комплектности и подсчет количества кодов
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Если ВыборкаДетальныеЗаписи.КодSSCC1=ВыборкаДетальныеЗаписи.КодМаркировки тогда
				продолжить; //разагрегированный код
			КонецЕсли;
			Если КоличКМ=0 тогда // первый вход
				GTIN0=ВыборкаДетальныеЗаписи.GTIN;
				Номенклатура0=ВыборкаДетальныеЗаписи.Номенклатура;	
				Статус0=ВыборкаДетальныеЗаписи.Статус;
				ДокПрихода0=ВыборкаДетальныеЗаписи.ДокументПрихода;
				ДокРасхода0=ВыборкаДетальныеЗаписи.ДокументРасхода; 
				НомерСерии0=ВыборкаДетальныеЗаписи.НомерСерии;
				ЕмкостьУпаковки0=ВыборкаДетальныеЗаписи.ЕмкостьУпаковки;
			КонецЕсли;	
			Запись=Регистрысведений.КодыМаркировки.СоздатьМенеджерЗаписи(); 
			Запись.КодМаркировки=ВыборкаДетальныеЗаписи.КодМаркировки; 
			Запись.Прочитать();
			Если Запись.Выбран() тогда 
				Если  Запись.Номенклатура.GTIN=GTIN0 и Запись.Статус=Статус0
					и Запись.ДокументПрихода=ДокПрихода0 и Запись.ДокументРасхода=ДокРасхода0 тогда 
					КоличКм=КоличКм+1; 
				КонецЕсли;
				ФлОшибЗап=ПроверитьЗапись(Запись,НомерСтроки);
				Если ФлОшибЗап=1 тогда
					 ФлОшиб=1;
                КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличКМ<>ВыборкаДетальныеЗаписи.Количество() тогда
			Сообщить("строка "+Строка(НомерСтроки)+" Нарушение комплектности КМ в упаковке!(разные характеристики)") ;
			ФлОшиб=1;
		КонецЕсли;	
	КонецЕсли;

	Результат.Вставить("ФлОшиб",ФлОшиб);
	Результат.Вставить("КоличКМ",КоличКМ);

	Если ФлОшиб=0 тогда 
		Результат.Вставить("GTIN",GTIN0);
		Результат.Вставить("Номенклатура",Номенклатура0);
		Результат.Вставить("Статус",Статус0);
		Результат.Вставить("ДокПрихода",ДокПрихода0);
		Результат.Вставить("ДокРасхода",ДокРасхода0);
		Результат.Вставить("НомерСерии",НомерСерии0);
		//Результат.Вставить("ЕмкостьУпаковки",ЕмкостьУпаковки0);
	КонецЕсли;

	Возврат Результат;

КонецФункции	
	
	
&НаКлиенте
//Процедура ТоварыСписокКодSSCC1ПриИзменении(Элемент)  
Процедура ТоварыСписокКодSSCC1ПриИзменении()  
	
	//Если  Не ОкончаниеВводаТекста тогда  Возврат;
	//КонецЕсли;
	
	//ОкончаниеВводаТекста=Ложь;
	
	ВведеноУпаковок=ВведеноУпаковок+1; 
	
	ТабСтрока=Элементы.ТоварыСписок.ТекущиеДанные;
	
	//Если СтрДлина(ТабСтрока.КодSSCC1)>18 тогда
	//	ТабСтрока.КодSSCC1=Прав(СокрЛП(ТабСтрока.КодSSCC1),18); // возможно два лишних символа впереди
	//КонецЕсли;
	
	//КодSSCC=ТабСтрока.КодSSCC1;        		
	//
	//// проверка на повтор ввода  (еще раз) 
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("КодSSCC1", КодSSCC);
	//МассивСтрок = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	//Если МассивСтрок.Количество()>1 тогда
	//	Сообщить("Повтор кода упаковки при вводе!(строка "+Строка(МассивСтрок[0].номерстроки)+")") ; 
	//	ТабСтрока.Проверка=Ложь;
	//	ОшибкаВвода=Истина;
	//	ТабСтрока.КодSSCC1="";
	//	Возврат;
	//КонецЕсли;

	//GTIN устанавливается по докумнту 
	СтрокаДокументаВыбор=ПолучитьДанныеСтрокиДокумента();
	//РасшифровкаАгрегации=ПроверитьКодSSCC1ВРеестре(ТабСтрока.НомерСтроки,ТабСтрока.КодSSCC1,СтрокаДокументаВыбор); 
	РасшифровкаАгрегации=ПроверитьКодSSCC1ВРеестре(ТабСтрока.НомерСтроки,ТабСтрока.Товар,СтрокаДокументаВыбор); 
	ФлОшиб=РасшифровкаАгрегации.Получить("ФлОшиб");
	
	Если ФлОшиб=1 тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Код упаковки в реестре КМ не найден!") ;   
		КонецЕсли;
		ТабСтрока.Проверка=Ложь;
		ОшибкаВвода=Истина; 
		Возврат;
	иначе
		ТабСтрока.GTIN=РасшифровкаАгрегации.Получить("GTIN");
		ТабСтрока.Номенклатура=РасшифровкаАгрегации.Получить("Номенклатура");
		ТабСтрока.Количество=РасшифровкаАгрегации.Получить("КоличКМ");
		ТабСтрока.Статус=РасшифровкаАгрегации.Получить("Статус");		
		ТабСтрока.ДокументПрихода=РасшифровкаАгрегации.Получить("ДокПрихода");
		ТабСтрока.ДокументРасхода=РасшифровкаАгрегации.Получить("ДокРасхода");
		ТабСтрока.НомерСерии=РасшифровкаАгрегации.Получить("НомерСерии");
		//ТабСтрока.ЕмкостьУпаковки=РасшифровкаАгрегации.Получить("ЕмкостьУпаковки");
		// проверка серии
	
		//НомерСерииДокСтарый=ПолучитьНомерСерииИзДокумента(ТабСтрока.GTIN); // только номер
		НомерСерииДок=ПолучитьСериюНоменклатурыИзДокумента(ТабСтрока.GTIN);      // полное наименование
		
		Если ТабСтрока.НомерСерии="" тогда
			ТабСтрока.НомерСерии=НомерСерииДок;
		ИначеЕсли СокрЛП(НомерСерииДок)<>СокрЛП(ТабСтрока.НомерСерии) тогда
			Сообщить("строка "+Строка(ТабСтрока.НомерСтроки)+" Серия упаковки не совпадает с серией выбраной строки документа!") ; 
			ФлОшиб=1;
		КонецЕсли;
		
		Если ФлОшиб=0 тогда
			// проверка соответствия документу
			Если объект.ДокументОснование <> неопределено тогда
				СтрокаДокумента=Неопределено;
			    Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
					ТабСтрока.Проверка=Ложь; 
					ОшибкаВвода=Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТабСтрока.Проверка=Истина;
	ОшибкаВвода=Ложь;  
	
	Введено=введено+РасшифровкаАгрегации.Получить("КоличКМ");;
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция	ПроверитьНаличиеКодSSCC1ВРеестре(КодАгрегации,ДокументОснованиеСсылка);
	// поиск в реестре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировки.Номенклатура КАК Номенклатура,
		|	КодыМаркировки.Статус КАК Статус,
		|	КодыМаркировки.ДокументПрихода КАК ДокументПрихода,
		|	КодыМаркировки.ДокументРасхода КАК ДокументРасхода,
		|	КодыМаркировки.Номенклатура.GTIN КАК GTIN,
		|	КодыМаркировки.КодSSCC1 КАК КодSSCC1,
		|	КодыМаркировки.ЕмкостьУпаковки КАК ЕмкостьУпаковки,
		|	КодыМаркировки.КоличествоЕдиницТовара КАК КоличествоЕдиницТовара,
		|	КодыМаркировки.НомерСерии КАК НомерСерии
		|ИЗ
		|	РегистрСведений.КодыМаркировки КАК КодыМаркировки
		|ГДЕ
		|	КодыМаркировки.КодSSCC1 = &КодSSCC
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодМаркировки";
	
	Запрос.УстановитьПараметр("КодSSCC", КодАгрегации);
	
	ФлагВозврата=Истина;

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	//Если Выборка.Количество()>0 и Объект.ДокументОснование=Неопределено тогда
	Если Выборка.Количество()>0 и ДокументОснованиеСсылка=Неопределено тогда
		Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ уже есть!") ;
		Кодагрегации="";
		ФлагВозврата=Ложь;
	//ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
	ИначеЕсли ТипЗнч(ДокументОснованиеСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
		Если Выборка.Количество()=0 тогда
			Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ не найден!") ;
			ФлагВозврата=Ложь;	
		иначе
			КоличКМ=0; 
			ФлАгрКод=0;
			Пока Выборка.Следующий() Цикл 
				Если Лев(Выборка.КодМаркировки,2)="01" тогда
					КоличКМ=КоличКМ+1;
				ИначеЕсли СокрЛП(Выборка.КодSSCC1)=СокрЛП(Выборка.КодМаркировки) тогда  // агрегатный код
					ФлАгрКод=1;
					Если Выборка.Статус>2 тогда
						Сообщить(" Агрегатный код упаковки "+КодАгрегации+"уже реализован "+Выборка.ДокументРасхода) ; 
						КодАгрегации="";
						ФлагВозврата=Ложь;
					Иначе
						Емкость=Выборка.ЕмкостьУпаковки;
						Введено=КоличКМ;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ФлАгрКод=0 тогда 
				Сообщить(" Агрегатный код упаковки "+КодАгрегации+" в реестре КМ не найден!") ; 
				КодАгрегации=""; 
				ФлагВозврата=Ложь;
			КонецЕсли;	
		КонецЕсли		
	КонецЕсли;
    Возврат ФлагВозврата;
КонецФункции

&НаКлиенте
Процедура КодАгрегацииПриИзменении(Элемент)
	
	Если СтрДлина(КодАгрегации)>18 тогда
			КодАгрегации=Прав(СокрЛП(КодАгрегации),18); // возможно два лишних символа впереди
	КонецЕсли;
	
	Если СтрДлина(КодАгрегации)<>18  тогда
		Сообщить(" Ошибка в коде упаковки "+КодАгрегации) ;   
	    Кодагрегации="";
		Возврат;
	КонецЕсли;

	Если ПроверитьНаличиеКодSSCC1ВРеестре(КодАгрегации,Объект.ДокументОснование) тогда
		Сообщить(" Код упаковки "+КодАгрегации+" в реестре КМ уже есть!") ;   
	    Кодагрегации="";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСписокПередНачаломИзменения(Элемент, Отказ) 
	Если Элементы.ТоварыСписок.ТекущиеДанные.Проверка=Истина тогда
		Отказ=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольВыборстрокиПриИзменении(Элемент)
	ТекСтрока=Элементы.Контроль.ТекущиеДанные;
	
	Если ТекСтрока.ВыборСтроки=Ложь тогда 
		 ТекСтрока.ВыборСтроки=Истина;
	     Возврат;
	КонецЕсли;
	
	Для каждого КонтрольСтр Из Объект.Контроль Цикл 
		
		Если КонтрольСтр.Номерстроки=ТекСтрока.НомерСтроки тогда
			Продолжить;
		КонецЕсли;
		
		Если КонтрольСтр.GTIN=ТекСтрока.GTIN и КонтрольСтр.НомерСерии=ТекСтрока.НомерСерии тогда
			КонтрольСтр.ВыборСтроки=Истина;
		Иначе
			КонтрольСтр.ВыборСтроки=Ложь;
		КонецЕсли;
		
	КонецЦикла; 
	УпаковкаКоличествоЗаполнитьСписокВыбора();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьСписокКМ();	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокКМ() 
	Если Объект.КодыСписок.Количество()>0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Очистить табличную часть?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
		Объект.КодыСписок.Очистить(); 
		КодАгрегации="";
		Введено=0;
		ВведеноУпаковок=0;
		Если Объект.Контроль.Количество()>0  тогда 
			Для каждого СтрКонтроль из Объект.Контроль цикл
				Если  СтрКонтроль.НомерСтроки=1 тогда
					СтрКонтроль.ВыборСтроки=Истина; 
					GTIN1=СтрКонтроль.GTIN;
					НомерСерии1=СтрКонтроль.НомерСерии;
				Иначе
					Если СтрКонтроль.GTIN=GTIN1 и СтрКонтроль.НомерСерии=НомерСерии1 тогда
						СтрКонтроль.ВыборСтроки=Истина;
					иначе
						СтрКонтроль.ВыборСтроки=Ложь;
					КонецЕсли;
				КонецЕсли;
				
				СтрКонтроль.КоличествоКМ=0;
				СтрКонтроль.Сертификация=0;
			КонецЦикла;	
		КонецЕсли;	
		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Контроль);
	КонецЕсли;   
	
КонецПроцедуры 
	
#Область ОбработкаЗакрытияФормы 
	
&НаСервереБезКонтекста	
Процедура РазблокироватьПоДокументу(ИмяПользователя,ДокументСсылка); 
	НайденнаяСсылка= Справочники.Блокировки.НайтиПоРеквизиту("ДокументОснование",ДокументСсылка);
	Если Не НайденнаяСсылка.Пустая() тогда
		СпрОбъект=НайденнаяСсылка.ПолучитьОбъект();
		СпрОбъект.ДокументОснование=Справочники.Блокировки.ПустаяСсылка();
		СпрОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

 &НаСервереБезКонтекста	
Процедура РазблокироватьБезДокумента(); 
 	Блокировка=Справочники.Блокировки.КомплектацияДвиженияТоваровКМ.ПолучитьОбъект(); 
	Блокировка.Разблокировать();  // общая для обработки
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Прервать обработку (Qayta ishlashni to'xtatish)?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Отказ=Истина;
		КонецЕсли;
		
		Если не отказ тогда      // закрытие
			
			Если Объект.ДокументОснование=Неопределено тогда
				РазблокироватьБезДокумента();  // общая для обработки
				
			Иначе // по документу      РазблокироватьБезДокумента
				ИмяПользователя=ИмяПользователя(); 
				РазблокироватьПоДокументу(ИмяПользователя,Объект.ДокументОснование); 
				
				//НайденнаяСсылка= Справочники.Блокировки.НайтиПоРеквизиту("ДокументОснование",Объект.ДокументОснование);
				//Если Не НайденнаяСсылка.Пустая() тогда
				//	СпрОбъект=НайденнаяСсылка.ПолучитьОбъект();
				//	СпрОбъект.ДокументОснование=Справочники.Блокировки.ПустаяСсылка();
				//	СпрОбъект.Записать();
				//КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецПроцедуры 
	
#КонецОбласти 


#Область РаботаСAslBelgisi 
&НаСервере
Функция ПолучитьИННОрганизации()

	Возврат Организация.ИНН;	
	
КонецФункции

&НаСервере
Функция ПолучитьПИНФЛОрганизации()

	Возврат Организация.ПИНФЛ;	
	
КонецФункции  

&НаСервере
Процедура МассивВТаблицуЗначенийПоКоду(Массив)   
	
	Для каждого Элемент Из Массив Цикл
	
		НесуществующиеКоды.Добавить().КодМаркировки = Элемент;	
	
	КонецЦикла; 
	
КонецПроцедуры

#Область ПодключитьЭЦП 
&НаКлиенте
Процедура Подключиться(Команда)
	ПриОткрытии = Ложь;
	ПодключитьсяККомпонентеНачало(ПриОткрытии);	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяККомпонентеНачало( ПриОткрытии )
	
	ДопПараметры = Новый Структура;	
	ДопПараметры.Вставить("ПриОткрытии", ПриОткрытии);
	
	Оповещение_ПодключитьсяККомпонентеЗавершение = Новый ОписаниеОповещения("ПодключитьсяККомпонентеЗавершение", ЭтаФорма, ДопПараметры);
	Оповещение_ПодключитьсяНачало = Новый ОписаниеОповещения("ПодключитьсяНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"));
	ВыполнитьОбработкуОповещения(Оповещение_ПодключитьсяНачало, Оповещение_ПодключитьсяККомпонентеЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяККомпонентеЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	КомпонентаКриптографии_ПодключениеУстановлено = Результат;
	
	//УстановитьВидимостьИДоступность();
	
	Если НЕ Результат Тогда
		//ТекстВопроса = "Не обнаружена установленная компонента криптографии. Установить?"; 
		ТекстСообщения = "Не обнаружена установленная компонента криптографии!";
		Сообщить(ТекстСообщения);
		//ЗадатьВопросОбУстановкеКомпоненты(ТекстВопроса);
	ИначеЕсли НЕ ДопПараметры["ПриОткрытии"] Тогда
		ТекстСообщения = "Компонента криптографии успешно подключена!";
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти 


&НаКлиенте
Процедура ПроверитьКодыМаркировки(Команда)
	
	//Если Не РазрешеноПодключаться() Тогда 
	//	Возврат;
	//КонецЕсли; 
	
	Если Организация.Пустая() тогда
		Сообщить("Выберите организацию !");
		возврат;
	КонецЕсли;
	
	ЕстьНесуществующиеКоды = Истина;
	ПослеАвторизации = Ложь;
	
	//УдаляетПустоеЗначениеИзСписок();
	КодыРазныхТиповТоваров.Очистить();
	СтатусыСОшибками.Очистить(); 
	KoдыРазныхGTIN.Очистить();
	КодыРазныхЕмкостей.Очистить();
	КодыРазныхУпаковокТоваров.Очистить();
	НесуществующиеКоды.Очистить();
	
	КодыМаркировки = ПолучитьВсеКодыМаркировки();
	Если КодыМаркировки.Количество() > 100 Тогда 
		//ПоказатьПредупреждение(, НСтр("ru = 'Обработка запросов требует времени потому, что у вас более 100 кодов. Пожалуйста, отметьте кнопку ""Запомнить на 6 часов"", чтобы срок действия токена не истек!'"));
	КонецЕсли;	
	
	СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, Истина);
	
	ТекстСообщения = НСтр("ru = 'Синхронизация завершена!'");
	//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Сообщить(ТекстСообщения);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьВсеКодыМаркировки()
	
	КодыМаркировки = Новый Массив;
	
	//ПотребительскиеКодыМаркировки = ПотребительскихСписокКодовМаркировки.ВыгрузитьЗначения();
	//ГрупповыеКодыМаркировки       = ГрупповыхСписокКодовМаркировки.ВыгрузитьЗначения();
	//ТранспортныеКодыМаркировки	  = ТранспортныхСписокКодовМаркировки.ВыгрузитьЗначения();   
	
	ПотребительскиеКодыМаркировки = Новый Массив;
	ГрупповыеКодыМаркировки = Новый Массив;
	ТранспортныеКодыМаркировки = Новый Массив;

	
	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		Если ТабСтр.УровеньУпаковки=0 тогда
			ПотребительскиеКодыМаркировки.Добавить(ТабСтр.Товар);
		ИначеЕсли ТабСтр.УровеньУпаковки=1 тогда
			ГрупповыеКодыМаркировки.Добавить(ТабСтр.Товар);
		иначе
			ТранспортныеКодыМаркировки.Добавить(ТабСтр.Товар);
		Конецесли;	
	КонецЦикла;
	
	//ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(КодыМаркировки, ПотребительскиеКодыМаркировки);
	//ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(КодыМаркировки, ГрупповыеКодыМаркировки);
	//ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(КодыМаркировки, ТранспортныеКодыМаркировки);
	
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПриемник, МассивИсточник, Истина);
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ПотребительскиеКодыМаркировки, Истина);
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ГрупповыеКодыМаркировки, Истина);
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КодыМаркировки, ТранспортныеКодыМаркировки, Истина);
	ДополнитьМассив(КодыМаркировки, ПотребительскиеКодыМаркировки, Истина);
	ДополнитьМассив(КодыМаркировки, ГрупповыеКодыМаркировки, Истина);
	ДополнитьМассив(КодыМаркировки, ТранспортныеКодыМаркировки, Истина);
	
	Возврат КодыМаркировки;
	
КонецФункции

Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДляМаркировки()
	
	Таблица = Новый ТаблицаЗначений;
	
	//Таблица.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("Код", ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("GTIN", Метаданные.ОпределяемыеТипы.GTIN.Тип);
	Таблица.Колонки.Добавить("НаименованиеТовара", ОписаниеТипаСтрока(250));
	Таблица.Колонки.Добавить("ТипТовара", Новый ОписаниеТипов("ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры"));     
	Таблица.Колонки.Добавить("ТипУпаковки", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыИспользованияЕдиницыХраненияИСМП"));
	Таблица.Колонки.Добавить("УровеньУпаковки", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	Таблица.Колонки.Добавить("ЕмкостьУпаковки", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	Таблица.Колонки.Добавить("СтатусКода", Новый ОписаниеТипов("ПеречислениеСсылка.aslbelgisi_СтатусКодовМаркировки"));
	Таблица.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции

&НаСервере
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));

	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);

	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);

КонецФункции

&НаКлиенте
Процедура СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, ТолькоПроверить)
	
	ТаблицаКодов = Новый Массив;
	Токен = ПолучитьТокен(Организация);
	
	ДанныеИзСайта = ПолучитьДанныеДляКодовМаркировки(Токен, КодыМаркировки, ТаблицаКодов);	
	
	Если ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.ОшибкаАутентификации") Тогда 
		
		Если ПослеАвторизации = Истина Тогда 
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;

		ПодписанныйТекст = "";
		СтруктураОтвета = АвторизацияНачало();
		
		Если СтруктураОтвета = Неопределено Тогда 
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: Не удалось подключиться к сервису!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокаНаПодпись = СтруктураОтвета.Получить("data");
		Идентификатор = СтруктураОтвета.Получить("uuid");
		
		ПолучениеКлючаОрганизацииНачало();
		ОтправитьПодписатьСтроку(КодыМаркировки, ТолькоПроверить);
		Возврат;
		
	ИначеЕсли ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.НекорректныйЗапрос") Тогда 
		
		//ТекстСообщения = СтрШаблон(ДанныеИзСайта.ТекстОшибки);
		ТекстСообщения = ДанныеИзСайта.ТекстОшибки;
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		
		МассивВТаблицуЗначенийПоКоду(ПолучитьВсеКодыМаркировки());		
		РаботаСНеправильнымиКодамиНачало();    
		
	ИначеЕсли ДанныеИзСайта.ТипОшибки = ПредопределенноеЗначение("Перечисление.aslbelgisi_ВидыОшибок.ВнутренняяОшибкаСервиса") Тогда 
		
		//ТекстСообщения = СтрШаблон(ДанныеИзСайта.ТекстОшибки);
		ТекстСообщения = ДанныеИзСайта.ТекстОшибки;
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		
	Иначе

		Если ТаблицаКодов.Количество()=0 тогда 
			Сообщить("Все указанные коды в AslBelgisi не найдены!");  
			Возврат;

		иначеЕсли ТолькоПроверить=Ложь и ТаблицаКодов.Количество()>0 тогда     // Запись распакованных кодов   
			ЗаписатьРаспакованныеКоды(ТаблицаКодов);
			
		Иначе  
			
			
			АгрегационныеКоды = ПроверитьЗаписатьКодыМаркировки(ТаблицаКодов, СобратьСтруктуруМаркировки(), ТолькоПроверить);
			
						
			//Если АгрегационныеКоды.Количество() Тогда 
			//	СинхронизоватьКодыМаркировкиССайтом(АгрегационныеКоды, ТолькоПроверить);	
			//	Возврат;
			//КонецЕсли;
			
		КонецЕсли;
		
		РаботаСНеправильнымиКодамиНачало();
	КонецЕсли;	
	
КонецПроцедуры

#Область ПолучениеКлючаОрганизации

&НаКлиенте
Процедура ПолучениеКлючаОрганизацииНачало()

	#Если ВебКлиент Тогда
		
		ЗаполнитьСтруктуруКлючаЭЦП();
		ПолучениеКлючаОрганизацииЗавершение(СтруктураКлюча);
		
	#Иначе
		
		Оповещение_Возврат = Новый ОписаниеОповещения("ПолучениеКлючаОрганизацииЗавершение", ЭтаФорма);
		
		ДопПараметры_Оповещение = Новый Структура;
		ДопПараметры_Оповещение.Вставить("ОписаниеОповещения", Оповещение_Возврат);
		ДопПараметры_Оповещение.Вставить("ПИНФЛ", ПолучитьПИНФЛОрганизации());
		Оповещение = Новый ОписаниеОповещения("ПолучениеКлючаОрганизацииНачало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ДопПараметры_Оповещение);
		ВыполнитьОбработкуОповещения(Оповещение, ПолучитьИННОрганизации());
									
	#КонецЕсли	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеКлючаОрганизацииЗавершение(Результат, ДопПараметр = Неопределено) Экспорт

	Если НЕ Результат.Свойство("serialnumber") Тогда		
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю("Не найден ключ ЭЦП организации!");
		Сообщить("Не найден ключ ЭЦП организации!");
		Возврат;	
	КонецЕсли;
	
	СтруктураКлюча = Результат;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияПолейКриптографии()
	
	JS_Браузер = Обработки.РаботаСКриптографией.ПолучитьМакет("HTML_JS_PostReport").ПолучитьТекст();

КонецПроцедуры

&НаКлиенте
Процедура СбросЗначенийПолейКриптографии()
	
	// Сброс значений полей
	JS_ДокументБраузера.testform.data.value = "";
	JS_ДокументБраузера.testform.pkcs7.value = "";
	JS_ДокументБраузера.testform.signature_hex.value = "";
	JS_ДокументБраузера.testform.timestamp.value = "";
	JS_ДокументБраузера.testform.pkcs7tst.value = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруКлючаЭЦП()
	
	СтруктураКлюча = Новый Структура;
	
	ЗаполнитьСписокКлючейЭЦП();
	СбросЗначенийПолейКриптографии();
	
	ИндексКлюча = ПолучитьИндексКлючаВТаблице();	
	Если ИндексКлюча = -1 Тогда
		
		Сообщить("Не найден ключ ЭЦП организации!");
		Возврат;
			
	КонецЕсли;

	// выбор сертификата
	JS_ДокументБраузера.testform.key.options[ИндексКлюча].selected = Истина;
	
	СтруктураКлючаСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(КлючиЭЦП[ИндексКлюча].Значение, Истина);
	СтруктураКлюча = uzbled_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруИзСоответствия(СтруктураКлючаСоответствие);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКлючейЭЦП()
	
	КлючиЭЦП.Очистить();
	
	// Получение списка клюючей в таблицу формы
	КоличествоКлючей = JS_ДокументБраузера.testform.key.length;
	Для Индекс = 0 По КоличествоКлючей - 1 Цикл
		
		Стр = КлючиЭЦП.Добавить();
		Стр["Текст"] = JS_ДокументБраузера.testform.key.options[Индекс].text; 
		Стр["Значение"] = JS_ДокументБраузера.testform.key.options[Индекс].value; 
		
		СоответствиеКлюча = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Стр["Значение"], Истина);		
		
		Стр["ИНН"] = СоответствиеКлюча.Получить("TIN");
		Стр["ПИНФЛ"] = СоответствиеКлюча.Получить("PINFL");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексКлючаВТаблице()
	
	ИНН = ПолучитьИННОрганизации();	
	ПИНФЛ = ПолучитьПИНФЛОрганизации();
	
	ТЗКлючи = КлючиЭЦП.Выгрузить();
	
	Если ЗначениеЗаполнено(ИНН) Тогда
	
		Стр = ТЗКлючи.Найти(ИНН, "ИНН");	
		Если Стр <> Неопределено Тогда
			
			Возврат ТЗКлючи.Индекс(Стр);
			
		КонецЕсли;	
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПИНФЛ) Тогда
	
		Стр = ТЗКлючи.Найти(ПИНФЛ, "ПИНФЛ");	
		Если Стр <> Неопределено Тогда
			
			Возврат ТЗКлючи.Индекс(Стр);
			
		КонецЕсли;	
	
	КонецЕсли;	
	
	Возврат -1;
	
КонецФункции

#КонецОбласти

#Область ОтправитьПодписатьСтроку 

&НаКлиенте
Процедура ОтправитьПодписатьСтроку(КодыМаркировки, ТолькоПроверить)
	
	Если СтруктураКлюча = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'Не найден ключ ЭЦП организации!'");
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;	
		
	ДопПараметры = Новый Структура("КодыМаркировки, ТолькоПроверить", КодыМаркировки, ТолькоПроверить);

	ПодписатьСтрокуЗавершение = Новый ОписаниеОповещения("ПодписатьСтрокуЗавершение", ЭтаФорма, ДопПараметры);
	
	ПодписатьCreatePKCS7Начало = Новый Структура;
	ПодписатьCreatePKCS7Начало.Вставить("СоответствиеКлюча", СтруктураКлюча);
	ПодписатьCreatePKCS7Начало.Вставить("СтрокаНаПодпись", СтрокаНаПодпись);
	Оповещение_ПодписатьCreatePKCS7Начало = Новый ОписаниеОповещения("ПодписатьCreatePKCS7Начало", uzbled_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("uzbled_EImzo"), ПодписатьCreatePKCS7Начало);
	
	ВыполнитьОбработкуОповещения(Оповещение_ПодписатьCreatePKCS7Начало, ПодписатьСтрокуЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьСтрокуЗавершение(Результат, ДопПараметры = Неопределено) Экспорт 
	
	Если ПустаяСтрока(Результат) Тогда
		ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
		//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
		Сообщить(ТекстСообщения);
	Иначе
		
		РезультатСоответствие = uzbled_EImzoСлужебный.ПрочитатьСтрокуJSON(Результат, Истина);
		
		Если РезультатСоответствие.Получить("success") <> Неопределено
			И РезультатСоответствие.Получить("success") Тогда
			
			ПодписанныйТекст = РезультатСоответствие.Получить("pkcs7_64");
			ХэшПодписи = РезультатСоответствие.Получить("signature_hex");
			
			Если ПодписанныйТекст <> Неопределено Тогда
				Токен = АвторизацияЗавершение(Идентификатор, ПодписанныйТекст);
				ЗаписатьНовыйТокен(Организация, Токен);
				ПослеАвторизации = Истина;
				
				Если ЗначениеЗаполнено(Токен) Тогда 
					Если ДопПараметры <> Неопределено Тогда 
						СинхронизоватьКодыМаркировкиССайтом(ДопПараметры.КодыМаркировки, ДопПараметры.ТолькоПроверить);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
				//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
				Сообщить(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: не удалось подписать данные авторизации ключом ЭЦП!'");
			//ОбщегоНазначенияКлиент_ненужен.СообщитьПользователю(ТекстСообщения);
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область РаботаСНеправильнымиКодами

&НаКлиенте
Процедура РаботаСНеправильнымиКодамиНачало()
		
	Если КодыРазныхТиповТоваров.Количество() 
		ИЛИ СтатусыСОшибками.Количество() 
		ИЛИ НесуществующиеКоды.Количество() 
		ИЛИ KoдыРазныхGTIN.Количество()
		ИЛИ КодыРазныхЕмкостей.Количество()
		ИЛИ КодыРазныхУпаковокТоваров.Количество() Тогда 
		
		
		КорректировкаСпискаКМ();         // корректировка признака Проверка списка КМ
		
		ТекстВопроса = "Обнаружены не соответствия кодов маркировки с Асл белгиси. Сформировать отчёт?";
		Оповещение = Новый ОписаниеОповещения("РаботаСНеправильнымиКодамиЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);					
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаботаСНеправильнымиКодамиЗавершение(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		// Очистить таблицы
		КодыРазныхТиповТоваров.Очистить();
		СтатусыСОшибками.Очистить();
		НесуществующиеКоды.Очистить();
		КодыРазныхУпаковокТоваров.Очистить(); 
		KoдыРазныхGTIN.Очистить();
		КодыРазныхЕмкостей.Очистить();
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТабличныйДокумент = СформироватьОтчетОбОшибке();
				
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		ИдентификаторПечатнойФормы = "ПечатьДокумент";
		
		КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Отчет об ошибке маркировки (asl belgisi)'");
		ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;  //указываем подготовленный табличный документ
		ПечатнаяФорма.ТабличныйДокумент.АвтоМасштаб = Ложь;  //по ширине страницы
		
		МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция СформироватьОтчетОбОшибке()
	
	ТабличныйДокумент = СформироватьОтчетОбОшибкеТаблица(ЭтаФорма);
	
	// Очистить таблиц
	КодыРазныхТиповТоваров.Очистить();
	СтатусыСОшибками.Очистить();
	НесуществующиеКоды.Очистить();
	КодыРазныхУпаковокТоваров.Очистить();
	KoдыРазныхGTIN.Очистить();
	Возврат ТабличныйДокумент;
	
КонецФункции  


&НаСервере
Функция ПроверитьЗаписатьКодыМаркировки(ДанныеДляКодовМаркировки, ДоступныКодыМаркировки, ТолькоПроверить) 
	// Получить таблицу из массива маркировки из сайта
	ТаблицаДляМаркировкиИзСайта = ПолучитьТаблицуДляМаркировки();	
	ДополнитьТаблицу(ДанныеДляКодовМаркировки, ТаблицаДляМаркировкиИзСайта, "Код");

	// Получить таблицу из массива маркировки из список формы
	ТекущиеКодыМаркировки = ПолучитьТаблицуДляМаркировки();
	ДополнитьТаблицу(ДоступныКодыМаркировки.ПотребительскиеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
	ДополнитьТаблицу(ДоступныКодыМаркировки.ГрупповыеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
	ДополнитьТаблицу(ДоступныКодыМаркировки.ТранспортныеКодыМаркировки, ТекущиеКодыМаркировки, "Код");
		
	Результат = ПолучитьРезультатнуюСтруктуруИзСайтаДляМаркировки(ТекущиеКодыМаркировки, ТаблицаДляМаркировкиИзСайта, ТипТовара); 
	
	// Перезаполнить списки
	//ПотребительскихСписокКодовМаркировки.Очистить();
	//ГрупповыхСписокКодовМаркировки.Очистить();
	//ТранспортныхСписокКодовМаркировки.Очистить(); 
	
	ПотребительскихСписокКодовМаркировки=Новый СписокЗначений;
	ГрупповыхСписокКодовМаркировки=Новый СписокЗначений;
	ТранспортныхСписокКодовМаркировки=Новый СписокЗначений;

	
	Для каждого СтрокаМассива Из Результат.ПотребительскиеКоды Цикл
		ПотребительскихСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
	
	Для каждого СтрокаМассива Из Результат.ГрупповыеКоды Цикл
		ГрупповыхСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
	
	Для каждого СтрокаМассива Из Результат.ТранспортныеКоды Цикл
		ТранспортныхСписокКодовМаркировки.Добавить(СтрокаМассива.КодМаркировки,, СтрокаМассива.Пометка);
	КонецЦикла; 
		
	ДополнитьТаблицу(Результат.КодыРазныхТиповТоваров, КодыРазныхТиповТоваров, "КодМаркировки");
	ДополнитьТаблицу(Результат.СтатусыСОшибками, СтатусыСОшибками, "КодМаркировки");
	
	// Один раз проверить
	Если ЕстьНесуществующиеКоды Тогда  
		ДополнитьТаблицу(Результат.КодыРазныхУпаковокТоваров, КодыРазныхУпаковокТоваров, "КодМаркировки");
		
		ДополнитьТаблицу(Результат.НесуществующиеКоды, НесуществующиеКоды, "КодМаркировки");
		ЕстьНесуществующиеКоды = Ложь;
	КонецЕсли;

	ДополнитьТаблицу(Результат.КодыРазныхGTIN, KoдыРазныхGTIN, "КодМаркировки");
	ДополнитьТаблицу(Результат.КодыРазныхЕмкостей, КодыРазныхЕмкостей, "КодМаркировки");
														 
	// Получит агрегационные коды 
	АгрегационныеКоды = Новый Массив;
	
	Если ТолькоПроверить Тогда 
		
		Для каждого СтрокаМассива Из ДанныеДляКодовМаркировки Цикл
			Если СтрокаМассива.Агрегации <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АгрегационныеКоды, СтрокаМассива.Агрегации);
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат АгрегационныеКоды; 
КонецФункции 

&НаКлиенте
Функция СобратьСтруктуруМаркировки() 

	//ТипТовара=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ЛекарственныеСредства");
	//ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка");

	Структура = Новый Структура;
	Структура.Вставить("ТипТовара", ТипТовара);
	//Структура.Вставить("ТипУпаковки", ТипУпаковки);

	ПотребительскиеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ПотребительскихСписокКодовМаркировки Цикл
	//	ПотребительскиеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	ГрупповыеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ГрупповыхСписокКодовМаркировки Цикл
	//	ГрупповыеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	ТранспортныеКодыМаркировки = Новый Массив;
	//Для Каждого СтрокаМаркировки Из ТранспортныхСписокКодовМаркировки Цикл
	//	ТранспортныеКодыМаркировки.Добавить(Новый Структура("Код, Пометка, ТипУпаковки, ТипТовара", 
	//		СтрокаМаркировки.Значение, СтрокаМаркировки.Пометка, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"), ТипТовара));
	//КонецЦикла;
	//
	Для Каждого ТабСтр из Объект.КодыСписок Цикл
		Если ТабСтр.Проверка тогда

			Если ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка") тогда
				ПотребительскиеКодыМаркировки.Добавить(Новый Структура("Код, GTIN,Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN,ТабСтр.Проверка,ТабСтр.УровеньУпаковки,ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"),ТабСтр.Количество, ТипТовара));

			ИначеЕсли ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка") тогда  
				ГрупповыеКодыМаркировки.Добавить(Новый Структура("Код, GTIN,Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN,ТабСтр.Проверка,ТабСтр.УровеньУпаковки,ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка"),ТабСтр.Количество, ТипТовара));

			ИначеЕсли ТабСтр.ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка") тогда
				ТранспортныеКодыМаркировки.Добавить(Новый Структура("Код,GTIN, Пометка,УровеньУпаковки, ТипУпаковки,ЕмкостьУпаковки, ТипТовара", 
					ТабСтр.Товар,ТабСтр.GTIN ,ТабСтр.Проверка,ТабСтр.УровеньУпаковки, ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"),ТабСтр.Количество, ТипТовара));
			Конецесли;	
		Конецесли;	
	КонецЦикла;
	
	Структура.Вставить("ПотребительскиеКодыМаркировки", ПотребительскиеКодыМаркировки);
	Структура.Вставить("ГрупповыеКодыМаркировки", ГрупповыеКодыМаркировки);
	Структура.Вставить("ТранспортныеКодыМаркировки", ТранспортныеКодыМаркировки);
	
	Возврат Структура;
	
КонецФункции
#КонецОбласти   

&НаКлиенте
Процедура КорректировкаСпискаКМ()
	
	Для каждого СтрокаТЧ Из НесуществующиеКоды Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из СтатусыСОшибками Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из KoдыРазныхGTIN Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;

	Для каждого СтрокаТЧ Из КодыРазныхЕмкостей Цикл
		КорректировкаСтрокиСписка(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура КорректировкаСтрокиСписка(СтрокаТЧ) 
	
	Код=СтрокаТЧ.КодМаркировки;

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Товар", Код);
	
	НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 тогда
		ТабСтрока=НайденныеСтроки[0];
		//Если ТабСтрока.Проверка тогда
			ТабСтрока.Проверка=Ложь;  
			Если СтрокаТЧ.Свойство("GTINСайт")  тогда              
				Если ТабСтрока.GTIN<>СтрокаТЧ.GTINСайт тогда
					 ТабСтрока.GTIN=СтрокаТЧ.GTINСайт;
			         ТабСтрока.Номенклатура=ПолучитьНоменклатурунаСервере(ТабСтрока.GTIN);
				Конецесли;
			КонецЕсли;
			Если СтрокаТЧ.Свойство("ЕмкостьУпаковкиСайт")  тогда
			         ТабСтрока.ЕмкостьУпаковки=СтрокаТЧ.ЕмкостьУпаковкиСайт;
			         ТабСтрока.Количество=СтрокаТЧ.ЕмкостьУпаковкиСайт;
			КонецЕсли;
			
			// корретировка КМ в документе  
			ПересчетКоличестваКМДокументаОснования(ТабСтрока);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

 
&НаКлиенте
Процедура РаспаковатьКодыМаркировки(Команда)
	//Если Не РазрешеноПодключаться() Тогда 
	//	Возврат;
	//КонецЕсли;
	
	Если Организация.Пустая() тогда
		Сообщить("Выберите организацию !");
		возврат;
	КонецЕсли;

	ЕстьНесуществующиеКоды = Истина;
	ПослеАвторизации = Ложь;
	
	//УдаляетПустоеЗначениеИзСписок();
	КодыРазныхТиповТоваров.Очистить();
	СтатусыСОшибками.Очистить();

	КодыМаркировки = ПолучитьВсеКодыМаркировки();
	Если КодыМаркировки.Количество() > 100 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Обработка запросов требует времени потому, что у вас более 100 кодов. Пожалуйста, отметьте кнопку ""Запомнить на 6 часов"", чтобы срок действия токена не истек!'"));
	КонецЕсли;	
	
	СинхронизоватьКодыМаркировкиССайтом(КодыМаркировки, Ложь);

	ТекстСообщения = НСтр("ru = 'Синхронизация завершена!'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРаспакованныеКоды(ТаблицаКодов);
	
	АгрегационныеКоды = Новый Массив;
	
	Для каждого СтрокаМассива Из ТаблицаКодов Цикл
		Если СтрокаМассива.Агрегации <> Неопределено Тогда 
			АгрегационныеКоды.Очистить();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АгрегационныеКоды, СтрокаМассива.Агрегации); 
			
			Для Инд=0 по АгрегационныеКоды.Количество()-1 Цикл

				Если Инд=0 тогда                         // первая строка
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("КодSSCC1", СтрокаМассива.Код);
					НайденныеСтроки = Объект.КодыСписок.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 тогда
						ТабСтрока=НайденныеСтроки[0];
						ЕмкостьУпаковки=ТабСтрока.ЕмкостьУпаковки;
					иначе
						ТабСтрока=Объект.КодыСписок.Добавить();
					КонецЕсли;
				иначе
					ТабСтрока=Объект.КодыСписок.Добавить();
                КонецЕсли;

				ТабСтрока.КодSSCC1=СтрокаМассива.Код; 
				ТабСтрока.Товар=АгрегационныеКоды[Инд];
				ТабСтрока.GTIN=Сред(ТабСтрока.Товар,3,14); 
				ТабСтрока.ЕмкостьУпаковки=ЕмкостьУпаковки;
				ТабСтрока.Количество=1; 
				ТабСтрока.Проверка=Истина; 
				
				Если  Объект.ДокументОснование<>Неопределено тогда   // контроль и подсчет количества по документу
					СтрокаДокумента=Неопределено;
					Если Не КонтрольПоДокументу(ТабСтрока.GTIN,ТабСтрока.Количество,ТабСтрока.НомерСтроки,СтрокаДокумента) тогда
						ТабСтрока.Проверка=Ложь; 
					иначе
						ТабСтрока.Проверка=Истина; 
						ТабСтрока.Номенклатура=СтрокаДокумента.Номенклатура;
						ТабСтрока.НомерСерии=СтрокаДокумента.НомерСерии;
						//ТабСтрока.ЕмкостьУпаковки=СтрокаДокумента.Емкость;
					КонецЕсли;
				КонецЕсли;                                    
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	
	Объект.КодыСписок.Сортировать("КодSSCC1");
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиРаботыССайтом

#Область ОбщиеМетоды  
Функция АвторизацияНачало() Экспорт
	
	ОтветСоответствие = aslbelgisi_МетодыДляИнтеграцииССайтом.authKey();
	
	Если Не ЗначениеЗаполнено(ОтветСоответствие.Получить("data")) 
		ИЛИ	Не ЗначениеЗаполнено(ОтветСоответствие.Получить("uuid")) Тогда 
			Возврат Неопределено;		
	КонецЕсли;

	Возврат ОтветСоответствие;
	
КонецФункции

Функция АвторизацияЗавершение(Идентификатор, ПодписаннаяСтрока) Экспорт
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("uuid", Идентификатор);
	СтруктураЗапроса.Вставить("data", ПодписаннаяСтрока);
	
	ТелоЗапроса = uzbled_EImzoСлужебный.ЗаписатьВСтрокуJSON(СтруктураЗапроса);
	Токен = aslbelgisi_МетодыДляИнтеграцииССайтом.authSimpleSignIn(ТелоЗапроса);
	
	Если Не ЗначениеЗаполнено(Токен) Тогда 
		ТекстСообщения = НСтр("ru = 'Произошли ошибки при авторизации: получил пустой токен!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция ПолучитьДанныеДляКодовМаркировки(Токен, КодыМаркировки, ТаблицаКодов) Экспорт 
	
	// Это структура для ошибки
	ДанныеИзСайта = Новый Структура("ТипОшибки, ТекстОшибки");
		
	ТелоЗапроса = uzbled_EImzoСлужебный.ЗаписатьВСтрокуJSON(КодыМаркировки);
	ОтветСоответствие = aslbelgisi_МетодыДляИнтеграцииССайтом.cisesInfo(Токен, ТелоЗапроса);
	
	ТипОшибки = ОтветСоответствие.Получить("ТипОшибки");
	ИнформацииОКодахМаркировки = ОтветСоответствие.Получить("ИнформацииОКодахМаркировки");
 
	Если ТипОшибки = Неопределено Тогда 
		
		Для Каждого СтрокаМассива Из ИнформацииОКодахМаркировки Цикл
			
			Если СтрокаМассива.Получить("errorCode") = Неопределено Тогда 
				ИнформацияОКоде = СтрокаМассива.Получить("cisInfo");
				КодМаркировки = ИнформацияОКоде.Получить("cis"); 
				GTIN = ИнформацияОКоде.Получить("gtin");
				УровеньУпаковки=ПолучитьУровеньУпаковкиИзСайта(ИнформацияОКоде.Получить("packageType"));
				НаименованиеТовара=ИнформацияОКоде.Получить("productName");
				ТипУпаковки = ПолучитьТипУпаковкиИзСайта(ИнформацияОКоде.Получить("packageType"));
				ТипТовара = ПолучитьТипТовараИзСайта(ИнформацияОКоде.Получить("productGroup"));
				СтатусКода = ПолучитьСтатусКодаИзСайта(ИнформацияОКоде.Получить("status"));		
				Агрегации = ИнформацияОКоде.Получить("child");
				Если Агрегации<>Неопределено тогда
					ЕмкостьУпаковки=Агрегации.Количество(); 
				Иначе
					ЕмкостьУпаковки=1;
				КонецЕсли;
				ТаблицаКодов.Добавить(Новый Структура("Код,GTIN,НаименованиеТовара,ТипТовара,УровеньУпаковки, ТипУпаковки, СтатусКода, Агрегации,ЕмкостьУпаковки", 
					КодМаркировки,GTIN,НаименованиеТовара, ТипТовара,УровеньУпаковки, ТипУпаковки, СтатусКода, Агрегации,ЕмкостьУпаковки));
					
			КонецЕсли;

		КонецЦикла;
		
	Иначе
		ДанныеИзСайта.ТипОшибки = ОтветСоответствие.Получить("ТипОшибки");				
		ДанныеИзСайта.ТекстОшибки = ОтветСоответствие.Получить("error_message");
	КонецЕсли;
	
	Возврат ДанныеИзСайта;
	
КонецФункции

#КонецОбласти  

#Область ЭкспортныеПроцедурыИФункции

Процедура ЗаписатьНовыйТокен(Организация, Токен) Экспорт
	
	Запись = РегистрыСведений.aslbelgisi_Токены.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Токен = Токен;
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьРезультатнуюСтруктуруИзСайтаДляМаркировки(ТекущаяТаблица, ТаблицаИзСайта, ТипТовара) Экспорт
	
	Результат = Новый Структура;
	
	// Несуществующие коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара
		|ПОМЕСТИТЬ ВТ_НесуществующиеКоды
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|ГДЕ
		|	ТекущаяТаблица.Код НЕ В(&Код)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НесуществующиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_НесуществующиеКоды.Пометка КАК Пометка,
		|	ВТ_НесуществующиеКоды.ТипУпаковки КАК ТипУпаковки,
		|	ВТ_НесуществующиеКоды.ТипТовара КАК ТипТовара
		|ИЗ
		|	ВТ_НесуществующиеКоды КАК ВТ_НесуществующиеКоды";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("Код", ТаблицаИзСайта.ВыгрузитьКолонку("Код"));
	
	НесуществующиеКоды1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("НесуществующиеКоды", НесуществующиеКоды1);
	
	// Проверить статус кодов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|ГДЕ
		|	НЕ ТаблицаИзСайта.СтатусКода В (&СтатусКода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта";
	
	СтатусКода = Новый Массив;
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.ПустаяСсылка());
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.Нанесён);
	СтатусКода.Добавить(Перечисления.aslbelgisi_СтатусКодовМаркировки.ВведенВОборот);
	
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	Запрос.УстановитьПараметр("СтатусКода", СтатусКода);
	
	СтатусыСОшибками1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("СтатусыСОшибками", СтатусыСОшибками1);

	// Проверить по типу упаковки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ТаблицаИзСайта.GTIN КАК GTIN,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода,
		|	ТекущаяТаблица.GTIN КАК GTIN
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ЕСТЬNULL(ВТ_ТекущаяТаблица.Пометка, ЛОЖЬ) КАК Пометка,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ВТ_ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ВТ_ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ВТ_ТаблицаИзСайта.GTIN КАК GTIN,
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	ИсправленнаяТаблица = Запрос.Выполнить().Выгрузить();

	
	
	// Получить общие коды
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НесуществующиеКоды, ИсправленнаяТаблица);
	
	// Получить измененную упаковку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ТипТовара КАК ТипТовара,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ТипУпаковки КАК ТипУпаковки,
		|	ТекущаяТаблица.ТипТовара КАК ТипТовара,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТекущаяТаблица.ТипУпаковки КАК ПредыдущаяУпаковка,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ПеремещеннаяУпаковка
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|ГДЕ
		|	ВТ_ТаблицаИзСайта.ТипУпаковки <> ВТ_ТекущаяТаблица.ТипУпаковки";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ИсправленнаяТаблица);
	КодыРазныхУпаковокТоваров1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхУпаковокТоваров", КодыРазныхУпаковокТоваров1);  
	
	
	// Проерить GTIN для транспортных упаковок. Для потребительских GTIN берется из кода маркировки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.СтатусКода КАК СтатусКода,
		|	ТаблицаИзСайта.GTIN КАК GTIN,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара,
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.СтатусКода КАК СтатусКода,
		|	ТекущаяТаблица.GTIN КАК GTIN,
		|	ТекущаяТаблица.НаименованиеТовара КАК НаименованиеТовара
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.GTIN КАК GTINСайт,
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовараСайт,
		|	ВТ_ТекущаяТаблица.GTIN КАК GTIN,
		|	ВТ_ТекущаяТаблица.НаименованиеТовара КАК НаименованиеТовара,
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.GTIN <> ВТ_ТекущаяТаблица.GTIN КАК НеРавны,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковкиСайт
		|ПОМЕСТИТЬ ВТ_Общая
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Общая.GTINСайт КАК GTINСайт,
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт,
		|	ВТ_Общая.GTIN КАК GTIN,
		|	ВТ_Общая.НаименованиеТовара КАК НаименованиеТовара,
		|	ВТ_Общая.КодМаркировки КАК КодМаркировки,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Общая.ТипУпаковкиСайт) КАК ТипУпаковкиСайт
		|ИЗ
		|	ВТ_Общая КАК ВТ_Общая
		|ГДЕ
		|	ВТ_Общая.НеРавны";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	КодыРазныхGTIN1 = Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхGTIN", КодыРазныхGTIN1);
	
	// Провверить значение ЕмкостьУпаковки

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзСайта.Пометка КАК Пометка,
		|	ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовара,
		|	ТаблицаИзСайта.Код КАК КодМаркировки,
		|	ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковки,
		|	ТаблицаИзСайта.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ПОМЕСТИТЬ ВТ_ТаблицаИзСайта
		|ИЗ
		|	&ТаблицаИзСайта КАК ТаблицаИзСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяТаблица.Код КАК КодМаркировки,
		|	ТекущаяТаблица.Пометка КАК Пометка,
		|	ТекущаяТаблица.ЕмкостьУпаковки КАК ЕмкостьУпаковки
		|ПОМЕСТИТЬ ВТ_ТекущаяТаблица
		|ИЗ
		|	&ТекущаяТаблица КАК ТекущаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаИзСайта.НаименованиеТовара КАК НаименованиеТовараСайт,
		|	ВТ_ТаблицаИзСайта.КодМаркировки КАК КодМаркировки,
		|	ВТ_ТаблицаИзСайта.ЕмкостьУпаковки <> ВТ_ТекущаяТаблица.ЕмкостьУпаковки КАК НеРавны,
		|	ВТ_ТаблицаИзСайта.ТипУпаковки КАК ТипУпаковкиСайт,
		|	ВТ_ТаблицаИзСайта.ЕмкостьУпаковки КАК ЕмкостьУпаковкиСайт
		|ПОМЕСТИТЬ ВТ_Общая
		|ИЗ
		|	ВТ_ТаблицаИзСайта КАК ВТ_ТаблицаИзСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяТаблица КАК ВТ_ТекущаяТаблица
		|		ПО ВТ_ТаблицаИзСайта.КодМаркировки = ВТ_ТекущаяТаблица.КодМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт,
		|	ВТ_Общая.КодМаркировки КАК КодМаркировки,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Общая.ТипУпаковкиСайт) КАК ТипУпаковкиСайт,
		|	ВТ_Общая.ЕмкостьУпаковкиСайт КАК ЕмкостьУпаковкиСайт,
		|	ВТ_Общая.НаименованиеТовараСайт КАК НаименованиеТовараСайт1
		|ИЗ
		|	ВТ_Общая КАК ВТ_Общая
		|ГДЕ
		|	ВТ_Общая.НеРавны";
	
	Запрос.УстановитьПараметр("ТекущаяТаблица", ТекущаяТаблица);
	Запрос.УстановитьПараметр("ТаблицаИзСайта", ТаблицаИзСайта);
	КодыРазныхЕмкостей1= Запрос.Выполнить().Выгрузить();
	Результат.Вставить("КодыРазныхЕмкостей", КодыРазныхЕмкостей1);
	
	// Проверить по типу товара
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.ТипТовара КАК ТипТовара
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипТовара <> &ТипТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.ТипТовара КАК ТипТовара
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица); 
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	КодыРазныхТиповТоваров1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("КодыРазныхТиповТоваров", КодыРазныхТиповТоваров1);

		
	// Потребительские коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка);
	ПотребительскиеКоды = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());	
	Результат.Вставить("ПотребительскиеКоды", ПотребительскиеКоды);
	
	// Групповые коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка);
	ГрупповыеКоды1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("ГрупповыеКоды", ГрупповыеКоды1);
	
	// Транспортные коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ОбщиеКоды.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТ_ОбщиеКоды
		|ИЗ
		|	&ОбщиеКоды КАК ОбщиеКоды
		|ГДЕ
		|	ОбщиеКоды.ТипУпаковки = &ТипУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщиеКоды.КодМаркировки КАК КодМаркировки,
		|	ВТ_ОбщиеКоды.Пометка КАК Пометка
		|ИЗ
		|	ВТ_ОбщиеКоды КАК ВТ_ОбщиеКоды";
	
	Запрос.УстановитьПараметр("ОбщиеКоды", ИсправленнаяТаблица);
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка);
	
	ТранспортныеКоды1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	Результат.Вставить("ТранспортныеКоды", ТранспортныеКоды1);
						
	Возврат Результат;

КонецФункции

Функция ПолучитьТокен(Организация) Экспорт
	
	Токен = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	aslbelgisi_Токены.Токен КАК Токен
		|ИЗ
		|	РегистрСведений.aslbelgisi_Токены КАК aslbelgisi_Токены
		|ГДЕ
		|	aslbelgisi_Токены.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Токен = ВыборкаДетальныеЗаписи.Токен;	
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция ПолучитьТипУпаковкиИзСайта(ТипУпаковки) Экспорт
	
	Если ТипУпаковки = "АТК" ИЛИ ТипУпаковки = "BUNDLE"  
		ИЛИ ТипУпаковки = "LEVEL5" ИЛИ ТипУпаковки = "LEVEL4"  
		ИЛИ ТипУпаковки = "LEVEL3" ИЛИ ТипУпаковки = "LEVEL2" Тогда 
		
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка;

	ИначеЕсли ТипУпаковки = "LEVEL1" Тогда 
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка;
	Иначе
		Возврат Перечисления.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьУровеньУпаковкиИзСайта(ТипУпаковки) Экспорт
	
	Если ТипУпаковки = "АТК" ИЛИ ТипУпаковки = "BUNDLE" тогда
		Возврат 99;
	ИначеЕсли ТипУпаковки="UNIT" тогда
		Возврат 0; 
	ИначеЕсли СтрНайти(ТипУпаковки,"LEVEL")>0 Тогда 
		Возврат Число(СтрЗаменить(ТипУпаковки,"LEVEL",""));
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипТовараИзСайта(ТипТовара) Экспорт
	
	Если ТипТовара = "tobacco" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
	ИначеЕсли ТипТовара = "pharma" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ЛекарственныеСредства;
	ИначеЕсли ТипТовара = "alcohol" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция;
	ИначеЕсли ТипТовара = "water" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ВодаИПрохладительныеНапитки;
	ИначеЕсли ТипТовара = "beer" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ПивоИПивныеНапитки;
	ИначеЕсли ТипТовара = "appliances" Тогда 
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.БытоваяТехника;
	Иначе
		Возврат Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьСтатусКодаИзСайта(Статус) Экспорт
	
	Если Статус = "EMITTED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Эмитирован;
	ИначеЕсли Статус = "APPLIED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Нанесён;
	ИначеЕсли Статус = "INTRODUCED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВведенВОборот;
	ИначеЕсли Статус = "WRITTEN_OFF" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Утилизирован;
	ИначеЕсли Статус = "WITHDRAWN" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВыведенИзОборота;
	ИначеЕсли Статус = "INTRODUCED_RETURNED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ВозвращёнВОборот;
	ИначеЕсли Статус = "DISAGGREGATED" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.Дезагрегирован;
	ИначеЕсли Статус = "APPLIED_NOT_PAID" Тогда 
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.НанесёнНеОплачен;
	Иначе
		Возврат Перечисления.aslbelgisi_СтатусКодовМаркировки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник, Колонка) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить(Колонка, СтрокаТаблицыИсточник[Колонка]);
		НайденныеСтроки = ТаблицаПриемник.НайтиСтроки(ПараметрыОтбора);
				
		Если Не НайденныеСтроки.Количество() Тогда 
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОтчетОбОшибкеТаблица(СтруктураФормы) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	//Макет = ПолучитьОбщийМакет("ОтчетОбОшибкеМаркировки");
	//Макет = Обработки.КомплектацияДвиженияМаркированныхТоваров.ПолучитьМакет("ОтчетОбОшибкеМаркировки");
	Макет = Обработки.КомплектацияДвиженияТоваровКМ.ПолучитьМакет("ОтчетОбОшибкеМаркировки");

	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заполнить(Новый Структура("Дата, Организация", ТекущаяДата(), СтруктураФормы.Организация));
	ТабДок.Вывести(Область);
	
	Если СтруктураФормы.НесуществующиеКоды.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокНесуществующихКодов");
		Область = Макет.ПолучитьОбласть("ЗаголовокНесуществующихКодов");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.НесуществующиеКоды Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧНесуществующиеКоды");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);	
		КонецЦикла; 
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;

	Если СтруктураФормы.КодыРазныхТиповТоваров.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСТипом");
		Область = Макет.ПолучитьОбласть("ЗаголовокСТипом");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхТиповТоваров Цикл
			Область = Макет.ПолучитьОбласть("СтрокиТЧСТипом");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	Если СтруктураФормы.СтатусыСОшибками.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокССтатусом");
		Область = Макет.ПолучитьОбласть("ЗаголовокССтатусом");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.СтатусыСОшибками Цикл
			Область = Макет.ПолучитьОбласть("СтрокиТЧССтатусом");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	Если СтруктураФормы.КодыРазныхУпаковокТоваров.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСУпаковкой");
		Область = Макет.ПолучитьОбласть("ЗаголовокСУпаковкой");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхУпаковокТоваров Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСУпаковкой");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
	
	Если СтруктураФормы.KoдыРазныхGTIN.Количество() Тогда 
		ТабДок.НачатьГруппуСтрок("ЗаголовокСGTIN");
		Область = Макет.ПолучитьОбласть("ЗаголовокСGTIN");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.KoдыРазныхGTIN Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСGTIN");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
	
	Если СтруктураФормы.КодыРазныхЕмкостей.Количество() Тогда
		//СтруктураФормы.КодыРазныхЕмкостей.Количество()
		ТабДок.НачатьГруппуСтрок("ЗаголовокСЕмкость");
		Область = Макет.ПолучитьОбласть("ЗаголовокСЕмкость");
		ТабДок.Вывести(Область);
		Для каждого СтрокаТЧ Из СтруктураФормы.КодыРазныхЕмкостей Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧСЕмкость");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла; 	
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;   
		
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

&НаСервере
Функция СформироватьСписокВыбораНаСервере(НоменклатураСсылка) 
	МассивСЗ=Новый Массив;
	Если НоменклатураСсылка.ИспользоватьУпаковки=Ложь тогда
		МассивСЗ.Вставить(0,НоменклатураСсылка.ЕдиницаИзмерения);  // базовая единица измерния
	иначе
		Если НоменклатураСсылка.наборУпаковок=Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры тогда
			Владелец=НоменклатураСсылка;
		Иначе
			Владелец=НоменклатураСсылка.наборУпаковок;
		КонецЕсли;
		
		Выборка=Справочники.УпаковкиЕдиницыИзмерения.Выбрать(,Владелец,,"Наименование");	

		Пока Выборка.Следующий() Цикл
			Если Выборка.Наименование=НоменклатураСсылка.ЕдиницаИзмерения.Наименование тогда
				МассивСЗ.Вставить(0,Выборка.Ссылка);  // базовая единица измерния
			иначе
				МассивСЗ.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат МассивСЗ;     //НоменклатураСсылка.ЕдиницаИзмерения=Выборка.Ссылка
КонецФункции 

&НаКлиенте
Процедура УпаковкаКоличествоЗаполнитьСписокВыбора()
	Элементы.УпаковкаЕдИзм.СписокВыбора.Очистить();
	СтрокаДок=ПолучитьДанныеСтрокиДокумента();
	МассивДляВыбора=СформироватьСписокВыбораНаСервере(СтрокаДок.Номенклатура);
	Элементы.УпаковкаЕдИзм.СписокВыбора.ЗагрузитьЗначения(МассивДляВыбора);
	УпаковкаЕдИзм=МассивДляВыбора[0]; 
	УпаковкаКоличествоПриИзменении(Неопределено)
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоИЕмкостьУпаковкиНаСервере(УпаковкаСсылка)
	текст="";
    Уровень=0;

	КоличествоУпаковок=УпаковкаСсылка.КоличествоУпаковок; 
	ПредыдущаяУпаковка=УпаковкаСсылка; 

	Пока  КоличествоУпаковок>0 Цикл 
		Текст=Текст+Строка(КоличествоУпаковок)+"X";
		Уровень=Уровень+1;
		ПредыдущаяУпаковка=ПредыдущаяУпаковка.Родитель;
		КоличествоУпаковок=ПредыдущаяУпаковка.КоличествоУпаковок;  // предыдущая упаковка
	КонецЦикла;  
	
	Если КоличествоУпаковок=0 и Уровень>0 тогда  // последняя упаковка 
		Текст=Текст+Строка(ПредыдущаяУпаковка.Числитель)+"X";
		Уровень=Уровень+1;
	КонецЕсли;	
	
	Если Текст<>"" Тогда
		Текст=Сред(Текст,1,СтрДлина(Текст)-1);  
		Если Текст="1" тогда
			Текст="";
		иначе
	    	Текст="("+Текст+")";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыУпаковки=Новый Структура;
	ПараметрыУпаковки.Вставить("текст", текст);
	ПараметрыУпаковки.Вставить("Количество", УпаковкаСсылка.Числитель);
	ПараметрыУпаковки.Вставить("Емкость", УпаковкаСсылка.КоличествоУпаковок); 
	ПараметрыУпаковки.Вставить("Уровень", Уровень); 
		
	Возврат ПараметрыУпаковки;
	
КонецФункции 

&НаКлиенте
Процедура УпаковкаКоличествоПриИзменении(Элемент)
	
	ПараметрыУпаковки=ПолучитьКоличествоИЕмкостьУпаковкиНаСервере(УпаковкаЕдИзм);
	
	УпаковкаКоличество=ПараметрыУпаковки.Количество;
	Емкость=ПараметрыУпаковки.Емкость;
	УпаковкаУровень=ПараметрыУпаковки.Уровень;
	
	Текст=ПараметрыУпаковки.Текст; 
	Элементы.ДекорацияПредупреждение.Заголовок="";
	Элементы.ДекорацияПредупреждение.Видимость=Ложь;
	
	Если (Емкость=0 и УпаковкаКоличество=0) или (Емкость=0 и УпаковкаКоличество=1) или (Емкость=1 и УпаковкаКоличество=1) тогда
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка");
		Текст=Текст+" Потребительская"; 
		УпаковкаУровень=0;
	ИначеЕсли Емкость=0 и УпаковкаКоличество>1 тогда
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка"); 
		Текст=Текст+" Групповая";
		УпаковкаУровень=1;
		Емкость=УпаковкаКоличество;
	иначе
		ТипУпаковки=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка"); 
		Текст=Текст+" Транспортная";
		Элементы.ДекорацияПредупреждение.Заголовок="Для транспортных упаковок GTIN подставляется из документа!";
		Элементы.ДекорацияПредупреждение.Видимость=Истина;
	КонецЕсли;
	Элементы.ДекорацияУпаковка.Заголовок=Текст;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВложеннойУпаковки(УпаковкаСсылка,УровеньУпаковки)
	
	ПараметрыУпаковки=Новый Структура;  
	
	Если УровеньУпаковки>1 Тогда
	
		ВложеннаяУпаковка=УпаковкаСсылка.Родитель;

		ПараметрыУпаковки.Вставить("Количество", ВложеннаяУпаковка.Числитель);
		ПараметрыУпаковки.Вставить("Емкость", ВложеннаяУпаковка.КоличествоУпаковок);

		Если ВложеннаяУпаковка.КоличествоУпаковок=0 и ВложеннаяУпаковка.Числитель>1 Тогда   // групповая
			ПараметрыУпаковки.Вставить("УровеньУпаковки", 1);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ГрупповаяУпаковка")); 

		ИначеЕсли ВложеннаяУпаковка.КоличествоУпаковок=0 и ВложеннаяУпаковка.Числитель=1 Тогда   // потребительская
			ПараметрыУпаковки.Вставить("УровеньУпаковки", 0);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ПотребительскаяУпаковка")); 
		иначе	
			ПараметрыУпаковки.Вставить("УровеньУпаковки",УровеньУпаковки-1);
			ПараметрыУпаковки.Вставить("ТипУпаковки",ПредопределенноеЗначение("Перечисление.ВариантыИспользованияЕдиницыХраненияИСМП.ТранспортнаяУпаковка")); 
		КонецЕсли;

	КонецЕсли;

	Возврат ПараметрыУпаковки;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьGTINПоКодуМаркировки(КодМаркировки,УровеньУпаковки,ТипТовара);
	
	Если УровеньУпаковки>2  Тогда 
	     Возврат Неопределено;
	КонецЕсли;

	Если ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция") и 
		 УровеньУпаковки=0 тогда
		 GTIN=Сред(КодМаркировки,1,14); 
	иначеЕсли Сред(КодМаркировки,1,2)="01" тогда	// признак GTIN	
		GTIN=Сред(КодМаркировки,3,14);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат GTIN;
КонецФункции 

&НаКлиенте
Функция УбратьКодПроверкиИКриптохвост(КодМаркировки,УровеньУпаковки,ТипТовара);
	
	Если УровеньУпаковки>2 Тогда 
	     Возврат КодМаркировки;          // без изменений   транспортная упаковка
	 КонецЕсли;
	 
	
	//Для Поз29=1 по СтрДлина(КодМаркировки) Цикл 
	//	Если КодСимвола(Сред(КодМаркировки,Поз29,1))=29 тогда
	//		Если Сред(КодМаркировки,Поз29+1,2)="91" тогда
	//			КодМаркировки=Сред(КодМаркировки,1,Поз29-1);  // усеченный код GTIN + серия 
	//		КонецЕсли;	
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;

	//Возврат КодМаркировки;
	
	
	Если ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция") тогда
		Если  УровеньУпаковки=0 тогда
	 		КодМаркировки=Сред(КодМаркировки,1,21); 
		иначе		
		 	КодМаркировки=Сред(КодМаркировки,1,25); 
		КонецЕсли;

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция") или
		      ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") или 
	          ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво") тогда 
		
		Если  УровеньУпаковки=0 тогда
	 		КодМаркировки=Сред(КодМаркировки,1,25); 
		иначе		
		 	КодМаркировки=Сред(КодМаркировки,1,31); 
		КонецЕсли;

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеСредства") тогда 
		КодМаркировки=Сред(КодМаркировки,1,31); 

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.УпакованнаяВода") тогда  
		КодМаркировки=Сред(КодМаркировки,1,31); 

	ИначеЕсли ТипТовара=ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.БытоваяТехника") тогда 
 		КодМаркировки=Сред(КодМаркировки,1,38); 
    КонецЕсли;

	Возврат КодМаркировки;
КонецФункции 

#КонецЕсли


