
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПубликацияТоваров(Команда)

	ОчиститьСообщения();

	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Обработка.УправлениеПродажамиНаUzum.Форма.ПубликацияТоваров.ОткрытиеФормы");

	ОткрытьФорму("Обработка.УправлениеПродажамиНаUzum.Форма.ПубликацияТоваров");

	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)

	ОчиститьСообщения();

	ВидыЦенУчетныхЗаписейUzum = ВидыЦенУчетныхЗаписейUzum();
	Если ВидыЦенУчетныхЗаписейUzum.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В настройках синхронизации с маркетплейсом Uzum не указаны выгружаемые виды цен, а также не созданы виды цен для загрузки данных с маркетплейса Uzum.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("ВидыЦен", ВидыЦенУчетныхЗаписейUzum);
	ОткрытьФорму("Обработка.ПрайсЛист.Форма.Форма", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВидыЦенУчетныхЗаписейUzum()

	Возврат Справочники.УчетныеЗаписиМаркетплейсов.ВидыЦенУчетныхЗаписейМаркетплейсаUzum();

КонецФункции

#КонецОбласти