
&НаКлиенте
Процедура Перезаполнить(Команда)
	ЗаполнитьЛимитыКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьЛимитыКонтрагента();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьЛимитыКонтрагента();
	
	Объект.ТекущиеЛимиты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстатокЛимитовОстатки.Проект КАК Проект,
		|	ОстатокЛимитовОстатки.ЛимитОстаток КАК ЛимитОстаток,
		|	ОстатокЛимитовОстатки.ЛимитОстаток КАК ИсходныйЛимит
		|ИЗ
		|	РегистрНакопления.ОстатокЛимитов.Остатки(&Период, Контрагент = &Контрагент) КАК ОстатокЛимитовОстатки";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Объект.Месяц) + 1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.ТекущиеЛимиты.Добавить();
		НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;
		НоваяСтрока.Лимит = ВыборкаДетальныеЗаписи.ЛимитОстаток;
		НоваяСтрока.ИсходныйЛимит = ВыборкаДетальныеЗаписи.ИсходныйЛимит;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	ОчиститьСообщения();
	ПрименитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОстатокЛимитов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстатокЛимитов КАК ОстатокЛимитов
		|ГДЕ
		|	ОстатокЛимитов.Период = &Период
		|	И ОстатокЛимитов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Объект.Месяц));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();

	ЕстьЗаписьПоконтрагенту = Не РезультатЗапроса.Пустой();

	Если Объект.ЭтоНовыйКонтрагент И ЕстьЗаписьПоконтрагенту Тогда
		
		Сообщить("По этому контрагенту уже есть записи!");
		Возврат
		
	КонецЕсли;
	
	Регистратор = ПолучитьРегистратор();
	
	Если Не ЗначениеЗаполнено(Регистратор) Тогда
		Сообщить("На этот месяц не создан документ ""Расчет лимита"", редактирование лимита невозможно.");
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыНакопления.ОстатокЛимитов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.Контрагент = Объект.Контрагент Тогда
			
			Для Каждого СтрокаТЧ Из Объект.ТекущиеЛимиты Цикл
				
				Если Запись.Проект = СтрокаТЧ.Проект И ЕстьЗаписьРегистратора(Объект.Контрагент, СтрокаТЧ.Проект) Тогда
					
					нЛимит = СтрокаТЧ.Лимит - СтрокаТЧ.ИсходныйЛимит; 
					
					Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
						Если нЛимит < 0 тогда
							Запись.Лимит = Запись.Лимит - нЛимит;	
						ИначеЕсли Запись.Лимит > нЛимит Тогда
							Запись.Лимит = Запись.Лимит - нЛимит;
						Иначе
							Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
							Запись.Лимит = нЛимит - Запись.Лимит;
						КонецЕсли;	
					Иначе
						Если нЛимит > 0 тогда	
							Запись.Лимит = Запись.Лимит + нЛимит; 
						ИначеЕсли Запись.Лимит > -нЛимит Тогда
							Запись.Лимит = Запись.Лимит + нЛимит;
						Иначе
							Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
							Запись.Лимит = -нЛимит - Запись.Лимит;							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
			
	Для Каждого СтрокаТЧ Из Объект.ТекущиеЛимиты Цикл
		
		Если Не ЕстьЗаписьРегистратора(Объект.Контрагент, СтрокаТЧ.Проект) Тогда
			
			нЛимит = СтрокаТЧ.Лимит - СтрокаТЧ.ИсходныйЛимит;
			 
			Запись = НаборЗаписей.Добавить();
			Запись.Период = НачалоМесяца(Объект.Месяц);
			//Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Контрагент  = Объект.Контрагент;
			//Запись.Лимит       = нЛимит;
			Запись.Проект      = СтрокаТЧ.Проект;
			
			Если нЛимит>0 тогда
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход; 
				Запись.Лимит = нЛимит;
			Иначе
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				Запись.Лимит = -нЛимит;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьРегистратор()
	
	Регистратор = Документы.РасчетЛимита.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасчетЛимита.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.РасчетЛимита КАК РасчетЛимита
		|ГДЕ
		|	РасчетЛимита.Проведен
		|	И НАЧАЛОПЕРИОДА(РасчетЛимита.Дата, МЕСЯЦ) = &Период";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Объект.Месяц));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
	КонецЕсли; 
	
	Возврат Регистратор;
	
КонецФункции

&НаСервере
Функция ЕстьЗаписьРегистратора(Контрагент, Проект)
	
	ЕстьЗаписьРегистратора = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОстатокЛимитов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстатокЛимитов КАК ОстатокЛимитов
		|ГДЕ
		|	ОстатокЛимитов.Период = &Период
		|	И ОстатокЛимитов.Контрагент = &Контрагент
		|	И ОстатокЛимитов.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Объект.Месяц));
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЕстьЗаписьРегистратора = Истина;
	КонецЕсли;
	
	Возврат ЕстьЗаписьРегистратора; 
	
КонецФункции
