 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетЛимита.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасчетЛимита КАК РасчетЛимита
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(РасчетЛимита.Дата, МЕСЯЦ) = &Дата
		|	И РасчетЛимита.Проведен = ИСТИНА
		|	И РасчетЛимита.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("На даннный месяц уже рассчитан лимит!");
		Возврат;
	КонецЕсли;
	
	Месяц = НачалоМесяца(Дата);
	
	Движения.ОстатокЛимитов.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.РасчитыватьЛимит = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Проект
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПроект = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаПроект.Следующий() Цикл
			
			Лимит = ПолучитьЛимит(Месяц, ВыборкаКонтрагент.Контрагент, ВыборкаПроект.Проект);
			ИсходныйЛимит = ПолучитьТекущийЛимит(ВыборкаКонтрагент.Контрагент, ВыборкаПроект.Проект, Месяц-1);
			
			Если ЗначениеЗаполнено(Лимит) 
				ИЛИ ЗначениеЗаполнено(ИсходныйЛимит) Тогда 
				
				Движение = Движения.ОстатокЛимитов.Добавить();
				Движение.Период 	= Месяц;
				Движение.Контрагент = ВыборкаКонтрагент.Контрагент;
				Движение.Проект 	= ВыборкаПроект.Проект;
				
				нЛимит = Лимит - ИсходныйЛимит; 
				
				Если нЛимит > 0 тогда
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Лимит = нЛимит; 
				Иначе
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Лимит = -нЛимит;							
				КонецЕсли;				
				
				//Движение = Движения.ОстатокЛимитов.Добавить();
				//Движение.Период = Месяц;
				//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				//Движение.Контрагент = ВыборкаКонтрагент.Контрагент;
				//Движение.Проект = ВыборкаПроект.Проект;
				//Движение.Лимит = Лимит;
				
			КонецЕсли;

			
		КонецЦикла;
		
	КонецЦикла;
	
	//Движение = Движения.ОстатокЛимитов.Добавить();
	//Движение.Период = Месяц;
	//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//Движение.Контрагент = Контрагент;
	//Движение.Проект = Проект;
	//Движение.Лимит = ПолучитьЛимит(Месяц, Контрагент, Проект);
		
КонецПроцедуры
 
Функция ПолучитьЛимит(Месяц, Контрагент, Проект)
	
	Лимит = 0;
	
	СуммаПродажЗаПериод = ПолучитьСуммуПродажЗаПериод(Месяц, Контрагент, Проект);
	
	МаксСуммаЗадолженности = ПолучитьМаксСуммуЗадолженности(Месяц, Контрагент, Проект);
	
	СредневзвешеннаяЗадолженность = ПолучитьСредневзвешенннуюЗадолженность(Месяц, Контрагент, Проект);
	
	ОборачиваемостьЗадолженностиЖелаемое = Проект.ОборачиваемостьЗадолженностиЖелаемое; 
	
	Если ОборачиваемостьЗадолженностиЖелаемое <> 0 И СредневзвешеннаяЗадолженность <> 0 И СредневзвешеннаяЗадолженность <> Неопределено И ОборачиваемостьЗадолженностиЖелаемое <> Неопределено Тогда
		
		Лимит = (МаксСуммаЗадолженности * (СуммаПродажЗаПериод / СредневзвешеннаяЗадолженность)/ОборачиваемостьЗадолженностиЖелаемое);
		
		Если Лимит > МаксСуммаЗадолженности * 1.10 Тогда
			
			Лимит = МаксСуммаЗадолженности * ПоказательРасчета; 	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Лимит;
	
КонецФункции 

Функция ПолучитьСредневзвешенннуюЗадолженность(Месяц, Контрагент, Проект)
	
	СредневзвешеннаяЗадолженность = 0;
	КолчиествоДней = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДолгКонечныйОстаток, 0)) КАК Сумма,
		|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, День, Движения, АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК РасчетыСКлиентамиПоСрокамОстаткиИОбороты
		|		ПО ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка = РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Договор
		|			И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Контрагент = РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Контрагент
		|ГДЕ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Значение = &Значение
		|	И РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Период, ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(Месяц, -3));
	Запрос.УстановитьПараметр("ДатаОкончания", Месяц);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"));
	Запрос.УстановитьПараметр("Значение", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДатаОкончания = Месяц;
	ДатаНачала = ДобавитьМесяц(Месяц, -3);
	СтарыйПериод = Неопределено; 
	СтаряСумма = 0;
	ДатаОтсчета = ДобавитьМесяц(Месяц, -3);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Период) Тогда
			Продолжить;
		КонецЕсли;
				
		Если ВыборкаДетальныеЗаписи.Период < ДатаОкончания Тогда
			Если СтарыйПериод <> Неопределено И СтаряСумма <> 0 Тогда
				Если ДатаОкончания < ВыборкаДетальныеЗаписи.Период Тогда 
					Продолжить;		
				КонецЕсли;    
				
				ДатаОтсчета = СтарыйПериод;
				
				Пока ДатаОтсчета < ВыборкаДетальныеЗаписи.Период Цикл
					
					СредневзвешеннаяЗадолженность = СредневзвешеннаяЗадолженность + СтаряСумма;
					ДатаОтсчета = ДатаОтсчета + 86400;
					
				КонецЦикла;
			КонецЕсли; 
			
			СтарыйПериод = ВыборкаДетальныеЗаписи.Период;
			СтаряСумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтарыйПериод  = Неопределено И СтаряСумма = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Если ДатаОкончания < СтарыйПериод Тогда 
		Возврат 0;		
	КонецЕсли;
	Если СтарыйПериод < ДатаНачала Тогда 
		СтарыйПериод = ДатаНачала;	
	КонецЕсли;
	
	//Если СредневзвешеннаяЗадолженность = 0 И СтарыйПериод <> Неопределено И СтаряСумма <> 0 Тогда
	СредневзвешеннаяЗадолженность = СредневзвешеннаяЗадолженность + (СтаряСумма * ((НачалоДня(ДатаОкончания) - НачалоДня(СтарыйПериод)) / (60 * 60 * 24)));
	//КонецЕсли;
	
	РазницаВДнях = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24);
	
	Возврат ?(РазницаВДнях = 0, 0, СредневзвешеннаяЗадолженность / РазницаВДнях);
		
КонецФункции

Функция ПолучитьСуммуПродажЗаПериод(Месяц, Контрагент, Проект)
	
	СуммаПродажЗаПериод = 0;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиСНДСРеглОборот), 0) КАК Сумма
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, , АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ПО ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Договор
		|ГДЕ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Значение = &Значение
		|	И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент";
	
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"));
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(Месяц, - 3));
	Запрос.УстановитьПараметр("ДатаОкончания", Месяц);
	Запрос.УстановитьПараметр("ПериодОстаток",  Месяц);
	Запрос.УстановитьПараметр("Значение", Проект);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) Тогда
			Возврат 0;
		КонецЕсли;
		СуммаПродажЗаПериод = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЕсли;
	
	Возврат СуммаПродажЗаПериод;
	
КонецФункции

Функция ПолучитьМаксСуммуЗадолженности(Месяц, Контрагент, Проект)
	
	МаксСуммаЗадолженности = 0;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение КАК Значение
		|ПОМЕСТИТЬ втПроектТекущегоДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Значение = &Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстаткиИОбороты.ДолгОборот, 0)) КАК Сумма,
		|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Период КАК Период
		|ИЗ
		|	втПроектТекущегоДоговора КАК втПроектТекущегоДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.ОстаткиИОбороты(
		|					&ДатаНачала,
		|					&ДатаОкончания,
		|					День,
		|					Движения,
		|					РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		|						И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК РасчетыСКлиентамиПоСрокамОстаткиИОбороты
		|			ПО ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка = РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Договор
		|				И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Контрагент = РасчетыСКлиентамиПоСрокамОстаткиИОбороты.АналитикаУчетаПоПартнерам.Контрагент
		|		ПО втПроектТекущегоДоговора.Значение = ДоговорыКонтрагентовДополнительныеРеквизиты.Значение
		|ГДЕ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиПоСрокамОстаткиИОбороты.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ";
	
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"));
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(Месяц, - 3));
	Запрос.УстановитьПараметр("ДатаОкончания", Месяц);
	Запрос.УстановитьПараметр("ПериодОстаток",  Месяц);
	Запрос.УстановитьПараметр("Значение", Проект);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) Тогда
			Возврат 0;
		КонецЕсли;
		
		МаксСуммаЗадолженности = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЕсли;
	
	Возврат МаксСуммаЗадолженности;
	
КонецФункции

Функция ПолучитьСуммуЗадоженностиПоКонтрагенту(Месяц, Контрагент, Проект)
	
	СуммаЗадоженностиПоКонтрагенту = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток, 0)) КАК ДолгОстаток
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|				&ПериодОстаток,
		|				РасчетныйДокумент ССЫЛКА Документ.РеализацияТоваровУслуг
		|					И АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК РасчетыСКлиентамиПоСрокамОстатки
		|		ПО ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка = РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Договор
		|			И ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка.Контрагент = РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Контрагент
		|ГДЕ
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Свойство
		|	И ДоговорыКонтрагентовДополнительныеРеквизиты.Значение = &Значение
		|	И РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент";
		
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Проект_f2b5133a590f44d0a8579f3a969ae46a"));
	Запрос.УстановитьПараметр("ПериодОстаток",  Месяц);
	Запрос.УстановитьПараметр("Значение", Проект);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммаЗадоженностиПоКонтрагенту = ВыборкаДетальныеЗаписи.ДолгОстаток;
	КонецЕсли; 
	
	Возврат СуммаЗадоженностиПоКонтрагенту;
	
КонецФункции

Функция ПолучитьТекущийЛимит(Контрагент, Проект, Месяц)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОстатокЛимитовОстатки.ЛимитОстаток КАК ЛимитОстаток
		|ИЗ
		|	РегистрНакопления.ОстатокЛимитов.Остатки(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И Проект = &Проект) КАК ОстатокЛимитовОстатки";
	
	Запрос.УстановитьПараметр("Период", Месяц);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ЛимитОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	
КонецФункции
