///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "РаботаВМоделиСервиса".
// ОбщийМодуль.СервисЗаполненияДаннымиПоИННСервер.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Определяет возможность использования сервиса в соответствии с текущим
//  режимом работы и правами пользователя.
//
// Возвращаемое значение:
//	Булево - Истина - использование разрешено, Ложь - в противном случае.
//
Функция ИспользованиеРазрешено() Экспорт

	Возврат СервисЗаполненияДаннымиПоИННСервер.ИспользованиеРазрешено();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет загрузку даных с веб-сервиса
//
// Параметры:
//  СтруктураЗапроса - Структура
//			Необходимые ключи стурктуры:
//				ЗапрашиваемыеДанные - Строка, содержит наименование данных для загрузки. Принимает значения:
//					"INN" - загруза по ИНН реквизитов контрагента. При выполнении загрузки в СтруктураЗапроса записывается
//						ключ - "РеквизитыЮрЛица", со значением - структура, содержащая реквизиты контрагента.
// 						Ключи структуры "РеквизитыЮрЛица": "ИНН", "ОКОНХ", "ОКПО", "Наименование", "НаименованиеПолное", "СОАТО", "ОКВЭД",
// 							"ПравоваяФорма", "ЮридическийАдрес", "Телефон", "Руководитель", "ДатаРегистрации".
//					"INNPHYSICALPERSON" - загрузка ИНН физического лица, по данным паспорта. При выполнении загрузки необходимо,
//						чтобы в СтруктураЗапроса были ключи:
//							"SerialNumber" - строка, серия паспорта;
//							"Number" - строка, номер паспорта.
//						После выполнении загрузки в СтруктураЗапроса записывается ключи: 
//							"ОписаниеОшибки" - строка, описание ошибки;
//							"ИННФизЛица" - строка, ИНН физического лица;
//							"СправкаДвоичныеДанные" - Двоичные данные, справка ИНН в формате pdf.
//					"EXCHANGERATES" - загрузка курсов валют. При выполнении загрузки необходимо,
//						чтобы в СтруктураЗапроса были ключи:
//							"ПериодНачало" - Дата, дата начала периода загрузки курсов;
//							"ПериодКонец" - Дата, дата конца периода загрузки курсов;
//							"МассивВалют" - Массив, содержащий коды валют с типом строка (например "840" - код Доллара США).
//						После загрузки вызывается процедура РаботаССервисамиСервер.ЗагрузитьКурсыВалютНаСервере.
//					"TREASURYACCOUNT" - загрузка казначейского лицевого счета. При выполнении загрузки необходимо,
//						чтобы в СтруктураЗапроса были ключи:
//							"BankAccountNumber" - строка, номер счета налогового органа;
//							"BankMFO" - строка, МФО банка налогового органа.
//						После выполнения загрузки в СтруктураЗапроса записывается ключи: 
//							"ОписаниеОшибки" - строка, описание ошибки;
//							"КазначейскийЛицевойСчет" - строка, номер казначейского лицевого счета;
//					"REVALUATIONRATIOSFA" - загрузка файлов коэффициентов перецонки. При выполнении загрузки необходимо,
//						чтобы в СтруктураЗапроса были ключи:
//							"КонецПереоценки" - число, год переоценки;
//							"ПереоценкаЗаТриГода" - булево, флаг обозначающий, нужно ли переценивать за год или за 3 года.
//						После выполнения загрузки в СтруктураЗапроса записывается ключи: 
//							"ФайлыИндексов" - Соответствие, Ключ - год переоценки, Значение - путь к файлу переоценки.
//					"BANKSLIST" - загрузка классификатора банков. 
//						После выполнения загрузки в СтруктураЗапроса записывается ключи:
//							"ТекстФайлаРег" - ТекстовыйДокумент, содержит перечень регионов и их кодов (МФО);
//							"ТекстФайлаМФО" - ТекстовыйДокумент, содержит перечень банков.
Процедура ЗагрузкаДанных(СтруктураЗапроса) Экспорт
	
	Отказ = ПроверитьИспользованиеРежимаЗаполненияПоИНН();
	
	Если Отказ = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Соединение = Новый HTTPСоединение("ssl.venkon.uz");
		Запрос = Новый HTTPЗапрос("sl/hs/venkon_fresh/v1.0/downloaddata?data=" + "GETPARTNERDETAILS&tin="  + СтруктураЗапроса.INN);
		ОтветСервера = Соединение.Получить(Запрос);
		Если ОтветСервера.КодСостояния = 200 Тогда 
			
			СтрокаJSON = ОтветСервера.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
			Попытка
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON, Ложь);
			Исключение
				Сообщить("Ошибка при получении ответа.");
				Возврат;
			КонецПопытки;
			ЧтениеJSON.Закрыть();
			
			Для Каждого КлючИЗначение Из СтруктураJSON Цикл
				СтруктураЗапроса.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение); 
			КонецЦикла;
		Иначе
			Сообщить("Ошибка работы с сервисом. Код ошибки " + ОтветСервера.КодСостояния + ".");
		КонецЕсли;
	Иначе 
		ВызватьИсключение НСтр("ru = 'Сервис не работает. Подключитесь к Интернет-поддержке пользователей,
		| и вы сможете получать сервисы, включенные в информационно-технологическое сопровождение. 
		|.'");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьИспользованиеРежимаЗаполненияПоИНН()
	
	Отказ = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИспользоватьСервисЗаполненияПоИНН.Значение КАК Значение
	|ИЗ
	|	Константа.ИспользоватьСервисЗаполненияПоИНН КАК ИспользоватьСервисЗаполненияПоИНН";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Значение = Истина Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;

	
КонецФункции

#КонецОбласти  
